Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3099 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x25e2f): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xbd288): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x57e35): /home/peppe/Desktop/Progetto_Embedded/STM32cubeIDE_Workspace/Matlab_Controller/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <2a>   DW_AT_encoding    : 5	(signed)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0x26c>
    <30>   DW_AT_decl_file   : 7
    <31>   DW_AT_decl_line   : 67
    <32>   DW_AT_decl_column : 1
    <33>   DW_AT_sibling     : <0x26c>
 <2><37>: Abbrev Number: 3 (DW_TAG_enumerator)
    <38>   DW_AT_name        : (indirect string, offset: 0x1ff75): NonMaskableInt_IRQn
    <3c>   DW_AT_const_value : -14
 <2><3d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3e>   DW_AT_name        : (indirect string, offset: 0x87989): MemoryManagement_IRQn

 <1><2a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x82c04): __int32_t
    <2a5>   DW_AT_decl_file   : 3
    <2a6>   DW_AT_decl_line   : 77
    <2a7>   DW_AT_decl_column : 24
    <2a8>   DW_AT_type        : <0x2ac>
 <1><2ac>: Abbrev Number: 5 (DW_TAG_base_type)
    <2ad>   DW_AT_byte_size   : 4
    <2ae>   DW_AT_encoding    : 5	(signed)
    <2af>   DW_AT_name        : (indirect string, offset: 0x1235a): long int
 <1><2b3>: Abbrev Number: 6 (DW_TAG_typedef)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x877db): __uint32_t
    <2b8>   DW_AT_decl_file   : 3
    <2b9>   DW_AT_decl_line   : 79
    <2ba>   DW_AT_decl_column : 25
    <2bb>   DW_AT_type        : <0x2bf>
 <1><2bf>: Abbrev Number: 5 (DW_TAG_base_type)
    <2c0>   DW_AT_byte_size   : 4
    <2c1>   DW_AT_encoding    : 7	(unsigned)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x50dec): long unsigned int
 <1><2c6>: Abbrev Number: 5 (DW_TAG_base_type)
    <2c7>   DW_AT_byte_size   : 8
    <2c8>   DW_AT_encoding    : 5	(signed)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x60a35): long long int
 <1><2cd>: Abbrev Number: 5 (DW_TAG_base_type)
    <2ce>   DW_AT_byte_size   : 8
    <2cf>   DW_AT_encoding    : 7	(unsigned)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x2cb47): long long unsigned int
 <1><2d4>: Abbrev Number: 7 (DW_TAG_base_type)
    <2d5>   DW_AT_byte_size   : 4
    <2d6>   DW_AT_encoding    : 5	(signed)
    <2d7>   DW_AT_name        : int
 <1><2db>: Abbrev Number: 5 (DW_TAG_base_type)
    <2dc>   DW_AT_byte_size   : 4
    <2dd>   DW_AT_encoding    : 7	(unsigned)
    <2de>   DW_AT_name        : (indirect string, offset: 0x117f4): unsigned int
 <1><2e2>: Abbrev Number: 6 (DW_TAG_typedef)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x3de9e): uint8_t
    <2e7>   DW_AT_decl_file   : 4
    <2e8>   DW_AT_decl_line   : 24
    <2e9>   DW_AT_decl_column : 19
    <2ea>   DW_AT_type        : <0x273>
 <1><2ee>: Abbrev Number: 8 (DW_TAG_const_type)
    <2ef>   DW_AT_type        : <0x2e2>
 <1><2f3>: Abbrev Number: 6 (DW_TAG_typedef)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x9ba47): uint16_t
    <2f8>   DW_AT_decl_file   : 4
    <2f9>   DW_AT_decl_line   : 36
    <2fa>   DW_AT_decl_column : 20
    <2fb>   DW_AT_type        : <0x28d>
 <1><2ff>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <300>   DW_AT_type        : <0x2f3>
 <1><304>: Abbrev Number: 6 (DW_TAG_typedef)
    <305>   DW_AT_name        : (indirect string, offset: 0x82c06): int32_t
    <309>   DW_AT_decl_file   : 4
    <30a>   DW_AT_decl_line   : 44
    <30b>   DW_AT_decl_column : 19
    <30c>   DW_AT_type        : <0x2a0>
 <1><310>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <311>   DW_AT_type        : <0x304>
 <1><315>: Abbrev Number: 6 (DW_TAG_typedef)
    <316>   DW_AT_name        : (indirect string, offset: 0xcb0eb): uint32_t
    <31a>   DW_AT_decl_file   : 4
    <31b>   DW_AT_decl_line   : 48
    <31c>   DW_AT_decl_column : 20
    <31d>   DW_AT_type        : <0x2b3>
 <1><321>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <322>   DW_AT_type        : <0x315>
 <1><326>: Abbrev Number: 10 (DW_TAG_array_type)
    <327>   DW_AT_type        : <0x315>
    <32b>   DW_AT_sibling     : <0x336>
 <2><32f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <330>   DW_AT_type        : <0x2db>
    <334>   DW_AT_upper_bound : 1
 <2><335>: Abbrev Number: 0
 <1><336>: Abbrev Number: 12 (DW_TAG_variable)
    <337>   DW_AT_name        : (indirect string, offset: 0x4970): ITM_RxBuffer
    <33b>   DW_AT_decl_file   : 5
    <33c>   DW_AT_decl_line   : 2052
    <33e>   DW_AT_decl_column : 25
    <33f>   DW_AT_type        : <0x310>
    <343>   DW_AT_external    : 1
    <343>   DW_AT_declaration : 1
 <1><343>: Abbrev Number: 13 (DW_TAG_variable)
    <344>   DW_AT_name        : (indirect string, offset: 0xa06bd): SystemCoreClock
    <348>   DW_AT_decl_file   : 6
    <349>   DW_AT_decl_line   : 74
    <34a>   DW_AT_decl_column : 17
    <34b>   DW_AT_type        : <0x315>
    <34f>   DW_AT_external    : 1
    <34f>   DW_AT_declaration : 1
 <1><34f>: Abbrev Number: 10 (DW_TAG_array_type)
    <350>   DW_AT_type        : <0x2ee>
    <354>   DW_AT_sibling     : <0x35f>
 <2><358>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <359>   DW_AT_type        : <0x2db>
    <35d>   DW_AT_upper_bound : 15
 <2><35e>: Abbrev Number: 0
 <1><35f>: Abbrev Number: 8 (DW_TAG_const_type)
    <360>   DW_AT_type        : <0x34f>
 <1><364>: Abbrev Number: 13 (DW_TAG_variable)
    <365>   DW_AT_name        : (indirect string, offset: 0xc09f2): AHBPrescTable
    <369>   DW_AT_decl_file   : 6
    <36a>   DW_AT_decl_line   : 76
    <36b>   DW_AT_decl_column : 23
    <36c>   DW_AT_type        : <0x35f>
    <370>   DW_AT_external    : 1
    <370>   DW_AT_declaration : 1
 <1><370>: Abbrev Number: 10 (DW_TAG_array_type)
    <371>   DW_AT_type        : <0x2ee>
    <375>   DW_AT_sibling     : <0x380>
 <2><379>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <37a>   DW_AT_type        : <0x2db>
    <37e>   DW_AT_upper_bound : 7
 <2><37f>: Abbrev Number: 0
 <1><380>: Abbrev Number: 8 (DW_TAG_const_type)
    <381>   DW_AT_type        : <0x370>
 <1><385>: Abbrev Number: 13 (DW_TAG_variable)
    <386>   DW_AT_name        : (indirect string, offset: 0x884dd): APBPrescTable
    <38a>   DW_AT_decl_file   : 6
    <38b>   DW_AT_decl_line   : 77
    <38c>   DW_AT_decl_column : 23
    <38d>   DW_AT_type        : <0x380>
    <391>   DW_AT_external    : 1
    <391>   DW_AT_declaration : 1
 <1><391>: Abbrev Number: 14 (DW_TAG_structure_type)
    <392>   DW_AT_byte_size   : 24
    <393>   DW_AT_decl_file   : 7
    <394>   DW_AT_decl_line   : 363
    <396>   DW_AT_decl_column : 9
    <397>   DW_AT_sibling     : <0x3ef>
 <2><39b>: Abbrev Number: 15 (DW_TAG_member)
    <39c>   DW_AT_name        : CR
    <39f>   DW_AT_decl_file   : 7
    <3a0>   DW_AT_decl_line   : 365
    <3a2>   DW_AT_decl_column : 17
    <3a3>   DW_AT_type        : <0x321>
    <3a7>   DW_AT_data_member_location: 0
 <2><3a8>: Abbrev Number: 16 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x1975f): NDTR
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 366
    <3b0>   DW_AT_decl_column : 17
    <3b1>   DW_AT_type        : <0x321>
    <3b5>   DW_AT_data_member_location: 4
 <2><3b6>: Abbrev Number: 15 (DW_TAG_member)
    <3b7>   DW_AT_name        : PAR
    <3bb>   DW_AT_decl_file   : 7
    <3bc>   DW_AT_decl_line   : 367
    <3be>   DW_AT_decl_column : 17
    <3bf>   DW_AT_type        : <0x321>
    <3c3>   DW_AT_data_member_location: 8
 <2><3c4>: Abbrev Number: 16 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x57fd6): M0AR
    <3c9>   DW_AT_decl_file   : 7
    <3ca>   DW_AT_decl_line   : 368
    <3cc>   DW_AT_decl_column : 17
    <3cd>   DW_AT_type        : <0x321>
    <3d1>   DW_AT_data_member_location: 12
 <2><3d2>: Abbrev Number: 16 (DW_TAG_member)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x753e1): M1AR
    <3d7>   DW_AT_decl_file   : 7
    <3d8>   DW_AT_decl_line   : 369
    <3da>   DW_AT_decl_column : 17
    <3db>   DW_AT_type        : <0x321>
    <3df>   DW_AT_data_member_location: 16
 <2><3e0>: Abbrev Number: 15 (DW_TAG_member)
    <3e1>   DW_AT_name        : FCR
    <3e5>   DW_AT_decl_file   : 7
    <3e6>   DW_AT_decl_line   : 370
    <3e8>   DW_AT_decl_column : 17
    <3e9>   DW_AT_type        : <0x321>
    <3ed>   DW_AT_data_member_location: 20
 <2><3ee>: Abbrev Number: 0
 <1><3ef>: Abbrev Number: 17 (DW_TAG_typedef)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x1a5d5): DMA_Stream_TypeDef
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 371
    <3f7>   DW_AT_decl_column : 3
    <3f8>   DW_AT_type        : <0x391>
 <1><3fc>: Abbrev Number: 10 (DW_TAG_array_type)
    <3fd>   DW_AT_type        : <0x321>
    <401>   DW_AT_sibling     : <0x40c>
 <2><405>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <406>   DW_AT_type        : <0x2db>
    <40a>   DW_AT_upper_bound : 1
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <40d>   DW_AT_type        : <0x3fc>
 <1><411>: Abbrev Number: 14 (DW_TAG_structure_type)
    <412>   DW_AT_byte_size   : 40
    <413>   DW_AT_decl_file   : 7
    <414>   DW_AT_decl_line   : 459
    <416>   DW_AT_decl_column : 9
    <417>   DW_AT_sibling     : <0x49a>
 <2><41b>: Abbrev Number: 16 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x1870): MODER
    <420>   DW_AT_decl_file   : 7
    <421>   DW_AT_decl_line   : 461
    <423>   DW_AT_decl_column : 17
    <424>   DW_AT_type        : <0x321>
    <428>   DW_AT_data_member_location: 0
 <2><429>: Abbrev Number: 16 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0xa4bb1): OTYPER
    <42e>   DW_AT_decl_file   : 7
    <42f>   DW_AT_decl_line   : 462
    <431>   DW_AT_decl_column : 17
    <432>   DW_AT_type        : <0x321>
    <436>   DW_AT_data_member_location: 4
 <2><437>: Abbrev Number: 16 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xb8c9e): OSPEEDR
    <43c>   DW_AT_decl_file   : 7
    <43d>   DW_AT_decl_line   : 463
    <43f>   DW_AT_decl_column : 17
    <440>   DW_AT_type        : <0x321>
    <444>   DW_AT_data_member_location: 8
 <2><445>: Abbrev Number: 16 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x98301): PUPDR
    <44a>   DW_AT_decl_file   : 7
    <44b>   DW_AT_decl_line   : 464
    <44d>   DW_AT_decl_column : 17
    <44e>   DW_AT_type        : <0x321>
    <452>   DW_AT_data_member_location: 12
 <2><453>: Abbrev Number: 15 (DW_TAG_member)
    <454>   DW_AT_name        : IDR
    <458>   DW_AT_decl_file   : 7
    <459>   DW_AT_decl_line   : 465
    <45b>   DW_AT_decl_column : 17
    <45c>   DW_AT_type        : <0x321>
    <460>   DW_AT_data_member_location: 16
 <2><461>: Abbrev Number: 15 (DW_TAG_member)
    <462>   DW_AT_name        : ODR
    <466>   DW_AT_decl_file   : 7
    <467>   DW_AT_decl_line   : 466
    <469>   DW_AT_decl_column : 17
    <46a>   DW_AT_type        : <0x321>
    <46e>   DW_AT_data_member_location: 20
 <2><46f>: Abbrev Number: 16 (DW_TAG_member)
    <470>   DW_AT_name        : (indirect string, offset: 0x30312): BSRR
    <474>   DW_AT_decl_file   : 7
    <475>   DW_AT_decl_line   : 467
    <477>   DW_AT_decl_column : 17
    <478>   DW_AT_type        : <0x321>
    <47c>   DW_AT_data_member_location: 24
 <2><47d>: Abbrev Number: 16 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0xb5f83): LCKR
    <482>   DW_AT_decl_file   : 7
    <483>   DW_AT_decl_line   : 468
    <485>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0x321>
    <48a>   DW_AT_data_member_location: 28
 <2><48b>: Abbrev Number: 15 (DW_TAG_member)
    <48c>   DW_AT_name        : AFR
    <490>   DW_AT_decl_file   : 7
    <491>   DW_AT_decl_line   : 469
    <493>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0x40c>
    <498>   DW_AT_data_member_location: 32
 <2><499>: Abbrev Number: 0
 <1><49a>: Abbrev Number: 17 (DW_TAG_typedef)
    <49b>   DW_AT_name        : (indirect string, offset: 0xce011): GPIO_TypeDef
    <49f>   DW_AT_decl_file   : 7
    <4a0>   DW_AT_decl_line   : 470
    <4a2>   DW_AT_decl_column : 3
    <4a3>   DW_AT_type        : <0x411>
 <1><4a7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4a8>   DW_AT_byte_size   : 8
    <4a9>   DW_AT_decl_file   : 7
    <4aa>   DW_AT_decl_line   : 541
    <4ac>   DW_AT_decl_column : 9
    <4ad>   DW_AT_sibling     : <0x4cd>
 <2><4b1>: Abbrev Number: 15 (DW_TAG_member)
    <4b2>   DW_AT_name        : CR
    <4b5>   DW_AT_decl_file   : 7
    <4b6>   DW_AT_decl_line   : 543
    <4b8>   DW_AT_decl_column : 17
    <4b9>   DW_AT_type        : <0x321>
    <4bd>   DW_AT_data_member_location: 0
 <2><4be>: Abbrev Number: 15 (DW_TAG_member)
    <4bf>   DW_AT_name        : CSR
    <4c3>   DW_AT_decl_file   : 7
    <4c4>   DW_AT_decl_line   : 544
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0x321>
    <4cb>   DW_AT_data_member_location: 4
 <2><4cc>: Abbrev Number: 0
 <1><4cd>: Abbrev Number: 17 (DW_TAG_typedef)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x9a241): PWR_TypeDef
    <4d2>   DW_AT_decl_file   : 7
    <4d3>   DW_AT_decl_line   : 545
    <4d5>   DW_AT_decl_column : 3
    <4d6>   DW_AT_type        : <0x4a7>
 <1><4da>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4db>   DW_AT_byte_size   : 152
    <4dc>   DW_AT_decl_file   : 7
    <4dd>   DW_AT_decl_line   : 551
    <4df>   DW_AT_decl_column : 9
    <4e0>   DW_AT_sibling     : <0x6c0>
 <2><4e4>: Abbrev Number: 15 (DW_TAG_member)
    <4e5>   DW_AT_name        : CR
    <4e8>   DW_AT_decl_file   : 7
    <4e9>   DW_AT_decl_line   : 553
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0x321>
    <4f0>   DW_AT_data_member_location: 0
 <2><4f1>: Abbrev Number: 16 (DW_TAG_member)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x94d51): PLLCFGR
    <4f6>   DW_AT_decl_file   : 7
    <4f7>   DW_AT_decl_line   : 554
    <4f9>   DW_AT_decl_column : 17
    <4fa>   DW_AT_type        : <0x321>
    <4fe>   DW_AT_data_member_location: 4
 <2><4ff>: Abbrev Number: 16 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0xc0f2f): CFGR
    <504>   DW_AT_decl_file   : 7
    <505>   DW_AT_decl_line   : 555
    <507>   DW_AT_decl_column : 17
    <508>   DW_AT_type        : <0x321>
    <50c>   DW_AT_data_member_location: 8
 <2><50d>: Abbrev Number: 15 (DW_TAG_member)
    <50e>   DW_AT_name        : CIR
    <512>   DW_AT_decl_file   : 7
    <513>   DW_AT_decl_line   : 556
    <515>   DW_AT_decl_column : 17
    <516>   DW_AT_type        : <0x321>
    <51a>   DW_AT_data_member_location: 12
 <2><51b>: Abbrev Number: 16 (DW_TAG_member)
    <51c>   DW_AT_name        : (indirect string, offset: 0xa94ef): AHB1RSTR
    <520>   DW_AT_decl_file   : 7
    <521>   DW_AT_decl_line   : 557
    <523>   DW_AT_decl_column : 17
    <524>   DW_AT_type        : <0x321>
    <528>   DW_AT_data_member_location: 16
 <2><529>: Abbrev Number: 16 (DW_TAG_member)
    <52a>   DW_AT_name        : (indirect string, offset: 0x18a22): AHB2RSTR
    <52e>   DW_AT_decl_file   : 7
    <52f>   DW_AT_decl_line   : 558
    <531>   DW_AT_decl_column : 17
    <532>   DW_AT_type        : <0x321>
    <536>   DW_AT_data_member_location: 20
 <2><537>: Abbrev Number: 16 (DW_TAG_member)
    <538>   DW_AT_name        : (indirect string, offset: 0x5c2a5): AHB3RSTR
    <53c>   DW_AT_decl_file   : 7
    <53d>   DW_AT_decl_line   : 559
    <53f>   DW_AT_decl_column : 17
    <540>   DW_AT_type        : <0x321>
    <544>   DW_AT_data_member_location: 24
 <2><545>: Abbrev Number: 16 (DW_TAG_member)
    <546>   DW_AT_name        : (indirect string, offset: 0xc80cf): RESERVED0
    <54a>   DW_AT_decl_file   : 7
    <54b>   DW_AT_decl_line   : 560
    <54d>   DW_AT_decl_column : 17
    <54e>   DW_AT_type        : <0x315>
    <552>   DW_AT_data_member_location: 28
 <2><553>: Abbrev Number: 16 (DW_TAG_member)
    <554>   DW_AT_name        : (indirect string, offset: 0x184f7): APB1RSTR
    <558>   DW_AT_decl_file   : 7
    <559>   DW_AT_decl_line   : 561
    <55b>   DW_AT_decl_column : 17
    <55c>   DW_AT_type        : <0x321>
    <560>   DW_AT_data_member_location: 32
 <2><561>: Abbrev Number: 16 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x5bd79): APB2RSTR
    <566>   DW_AT_decl_file   : 7
    <567>   DW_AT_decl_line   : 562
    <569>   DW_AT_decl_column : 17
    <56a>   DW_AT_type        : <0x321>
    <56e>   DW_AT_data_member_location: 36
 <2><56f>: Abbrev Number: 16 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0xc80d9): RESERVED1
    <574>   DW_AT_decl_file   : 7
    <575>   DW_AT_decl_line   : 563
    <577>   DW_AT_decl_column : 17
    <578>   DW_AT_type        : <0x326>
    <57c>   DW_AT_data_member_location: 40
 <2><57d>: Abbrev Number: 16 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x11789): AHB1ENR
    <582>   DW_AT_decl_file   : 7
    <583>   DW_AT_decl_line   : 564
    <585>   DW_AT_decl_column : 17
    <586>   DW_AT_type        : <0x321>
    <58a>   DW_AT_data_member_location: 48
 <2><58b>: Abbrev Number: 16 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0x38bd0): AHB2ENR
    <590>   DW_AT_decl_file   : 7
    <591>   DW_AT_decl_line   : 565
    <593>   DW_AT_decl_column : 17
    <594>   DW_AT_type        : <0x321>
    <598>   DW_AT_data_member_location: 52
 <2><599>: Abbrev Number: 16 (DW_TAG_member)
    <59a>   DW_AT_name        : (indirect string, offset: 0x5f1e4): AHB3ENR
    <59e>   DW_AT_decl_file   : 7
    <59f>   DW_AT_decl_line   : 566
    <5a1>   DW_AT_decl_column : 17
    <5a2>   DW_AT_type        : <0x321>
    <5a6>   DW_AT_data_member_location: 56
 <2><5a7>: Abbrev Number: 16 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0xc80e3): RESERVED2
    <5ac>   DW_AT_decl_file   : 7
    <5ad>   DW_AT_decl_line   : 567
    <5af>   DW_AT_decl_column : 17
    <5b0>   DW_AT_type        : <0x315>
    <5b4>   DW_AT_data_member_location: 60
 <2><5b5>: Abbrev Number: 16 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x79805): APB1ENR
    <5ba>   DW_AT_decl_file   : 7
    <5bb>   DW_AT_decl_line   : 568
    <5bd>   DW_AT_decl_column : 17
    <5be>   DW_AT_type        : <0x321>
    <5c2>   DW_AT_data_member_location: 64
 <2><5c3>: Abbrev Number: 16 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x19fcb): APB2ENR
    <5c8>   DW_AT_decl_file   : 7
    <5c9>   DW_AT_decl_line   : 569
    <5cb>   DW_AT_decl_column : 17
    <5cc>   DW_AT_type        : <0x321>
    <5d0>   DW_AT_data_member_location: 68
 <2><5d1>: Abbrev Number: 16 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xc80ed): RESERVED3
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 570
    <5d9>   DW_AT_decl_column : 17
    <5da>   DW_AT_type        : <0x326>
    <5de>   DW_AT_data_member_location: 72
 <2><5df>: Abbrev Number: 16 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0xad74d): AHB1LPENR
    <5e4>   DW_AT_decl_file   : 7
    <5e5>   DW_AT_decl_line   : 571
    <5e7>   DW_AT_decl_column : 17
    <5e8>   DW_AT_type        : <0x321>
    <5ec>   DW_AT_data_member_location: 80
 <2><5ed>: Abbrev Number: 16 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x2feb0): AHB2LPENR
    <5f2>   DW_AT_decl_file   : 7
    <5f3>   DW_AT_decl_line   : 572
    <5f5>   DW_AT_decl_column : 17
    <5f6>   DW_AT_type        : <0x321>
    <5fa>   DW_AT_data_member_location: 84
 <2><5fb>: Abbrev Number: 16 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x8feaf): AHB3LPENR
    <600>   DW_AT_decl_file   : 7
    <601>   DW_AT_decl_line   : 573
    <603>   DW_AT_decl_column : 17
    <604>   DW_AT_type        : <0x321>
    <608>   DW_AT_data_member_location: 88
 <2><609>: Abbrev Number: 16 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xc80f7): RESERVED4
    <60e>   DW_AT_decl_file   : 7
    <60f>   DW_AT_decl_line   : 574
    <611>   DW_AT_decl_column : 17
    <612>   DW_AT_type        : <0x315>
    <616>   DW_AT_data_member_location: 92
 <2><617>: Abbrev Number: 16 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0xb253c): APB1LPENR
    <61c>   DW_AT_decl_file   : 7
    <61d>   DW_AT_decl_line   : 575
    <61f>   DW_AT_decl_column : 17
    <620>   DW_AT_type        : <0x321>
    <624>   DW_AT_data_member_location: 96
 <2><625>: Abbrev Number: 16 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0x23803): APB2LPENR
    <62a>   DW_AT_decl_file   : 7
    <62b>   DW_AT_decl_line   : 576
    <62d>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0x321>
    <632>   DW_AT_data_member_location: 100
 <2><633>: Abbrev Number: 16 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xc8101): RESERVED5
    <638>   DW_AT_decl_file   : 7
    <639>   DW_AT_decl_line   : 577
    <63b>   DW_AT_decl_column : 17
    <63c>   DW_AT_type        : <0x326>
    <640>   DW_AT_data_member_location: 104
 <2><641>: Abbrev Number: 16 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0x50a11): BDCR
    <646>   DW_AT_decl_file   : 7
    <647>   DW_AT_decl_line   : 578
    <649>   DW_AT_decl_column : 17
    <64a>   DW_AT_type        : <0x321>
    <64e>   DW_AT_data_member_location: 112
 <2><64f>: Abbrev Number: 15 (DW_TAG_member)
    <650>   DW_AT_name        : CSR
    <654>   DW_AT_decl_file   : 7
    <655>   DW_AT_decl_line   : 579
    <657>   DW_AT_decl_column : 17
    <658>   DW_AT_type        : <0x321>
    <65c>   DW_AT_data_member_location: 116
 <2><65d>: Abbrev Number: 16 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0x7e433): RESERVED6
    <662>   DW_AT_decl_file   : 7
    <663>   DW_AT_decl_line   : 580
    <665>   DW_AT_decl_column : 17
    <666>   DW_AT_type        : <0x326>
    <66a>   DW_AT_data_member_location: 120
 <2><66b>: Abbrev Number: 16 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0x7043d): SSCGR
    <670>   DW_AT_decl_file   : 7
    <671>   DW_AT_decl_line   : 581
    <673>   DW_AT_decl_column : 17
    <674>   DW_AT_type        : <0x321>
    <678>   DW_AT_data_member_location: 128
 <2><679>: Abbrev Number: 16 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0x46c15): PLLI2SCFGR
    <67e>   DW_AT_decl_file   : 7
    <67f>   DW_AT_decl_line   : 582
    <681>   DW_AT_decl_column : 17
    <682>   DW_AT_type        : <0x321>
    <686>   DW_AT_data_member_location: 132
 <2><687>: Abbrev Number: 16 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0xc0f29): PLLSAICFGR
    <68c>   DW_AT_decl_file   : 7
    <68d>   DW_AT_decl_line   : 583
    <68f>   DW_AT_decl_column : 17
    <690>   DW_AT_type        : <0x321>
    <694>   DW_AT_data_member_location: 136
 <2><695>: Abbrev Number: 16 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x5c45e): DCKCFGR
    <69a>   DW_AT_decl_file   : 7
    <69b>   DW_AT_decl_line   : 584
    <69d>   DW_AT_decl_column : 17
    <69e>   DW_AT_type        : <0x321>
    <6a2>   DW_AT_data_member_location: 140
 <2><6a3>: Abbrev Number: 16 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0xa3981): CKGATENR
    <6a8>   DW_AT_decl_file   : 7
    <6a9>   DW_AT_decl_line   : 585
    <6ab>   DW_AT_decl_column : 17
    <6ac>   DW_AT_type        : <0x321>
    <6b0>   DW_AT_data_member_location: 144
 <2><6b1>: Abbrev Number: 16 (DW_TAG_member)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x9389a): DCKCFGR2
    <6b6>   DW_AT_decl_file   : 7
    <6b7>   DW_AT_decl_line   : 586
    <6b9>   DW_AT_decl_column : 17
    <6ba>   DW_AT_type        : <0x321>
    <6be>   DW_AT_data_member_location: 148
 <2><6bf>: Abbrev Number: 0
 <1><6c0>: Abbrev Number: 17 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x620cd): RCC_TypeDef
    <6c5>   DW_AT_decl_file   : 7
    <6c6>   DW_AT_decl_line   : 587
    <6c8>   DW_AT_decl_column : 3
    <6c9>   DW_AT_type        : <0x4da>
 <1><6cd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6ce>   DW_AT_byte_size   : 84
    <6cf>   DW_AT_decl_file   : 7
    <6d0>   DW_AT_decl_line   : 746
    <6d2>   DW_AT_decl_column : 9
    <6d3>   DW_AT_sibling     : <0x7fc>
 <2><6d7>: Abbrev Number: 15 (DW_TAG_member)
    <6d8>   DW_AT_name        : CR1
    <6dc>   DW_AT_decl_file   : 7
    <6dd>   DW_AT_decl_line   : 748
    <6df>   DW_AT_decl_column : 17
    <6e0>   DW_AT_type        : <0x321>
    <6e4>   DW_AT_data_member_location: 0
 <2><6e5>: Abbrev Number: 15 (DW_TAG_member)
    <6e6>   DW_AT_name        : CR2
    <6ea>   DW_AT_decl_file   : 7
    <6eb>   DW_AT_decl_line   : 749
    <6ed>   DW_AT_decl_column : 17
    <6ee>   DW_AT_type        : <0x321>
    <6f2>   DW_AT_data_member_location: 4
 <2><6f3>: Abbrev Number: 16 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0x3e857): SMCR
    <6f8>   DW_AT_decl_file   : 7
    <6f9>   DW_AT_decl_line   : 750
    <6fb>   DW_AT_decl_column : 17
    <6fc>   DW_AT_type        : <0x321>
    <700>   DW_AT_data_member_location: 8
 <2><701>: Abbrev Number: 16 (DW_TAG_member)
    <702>   DW_AT_name        : (indirect string, offset: 0x46526): DIER
    <706>   DW_AT_decl_file   : 7
    <707>   DW_AT_decl_line   : 751
    <709>   DW_AT_decl_column : 17
    <70a>   DW_AT_type        : <0x321>
    <70e>   DW_AT_data_member_location: 12
 <2><70f>: Abbrev Number: 15 (DW_TAG_member)
    <710>   DW_AT_name        : SR
    <713>   DW_AT_decl_file   : 7
    <714>   DW_AT_decl_line   : 752
    <716>   DW_AT_decl_column : 17
    <717>   DW_AT_type        : <0x321>
    <71b>   DW_AT_data_member_location: 16
 <2><71c>: Abbrev Number: 15 (DW_TAG_member)
    <71d>   DW_AT_name        : EGR
    <721>   DW_AT_decl_file   : 7
    <722>   DW_AT_decl_line   : 753
    <724>   DW_AT_decl_column : 17
    <725>   DW_AT_type        : <0x321>
    <729>   DW_AT_data_member_location: 20
 <2><72a>: Abbrev Number: 16 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0xc1c4a): CCMR1
    <72f>   DW_AT_decl_file   : 7
    <730>   DW_AT_decl_line   : 754
    <732>   DW_AT_decl_column : 17
    <733>   DW_AT_type        : <0x321>
    <737>   DW_AT_data_member_location: 24
 <2><738>: Abbrev Number: 16 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0x548ac): CCMR2
    <73d>   DW_AT_decl_file   : 7
    <73e>   DW_AT_decl_line   : 755
    <740>   DW_AT_decl_column : 17
    <741>   DW_AT_type        : <0x321>
    <745>   DW_AT_data_member_location: 28
 <2><746>: Abbrev Number: 16 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x341ad): CCER
    <74b>   DW_AT_decl_file   : 7
    <74c>   DW_AT_decl_line   : 756
    <74e>   DW_AT_decl_column : 17
    <74f>   DW_AT_type        : <0x321>
    <753>   DW_AT_data_member_location: 32
 <2><754>: Abbrev Number: 15 (DW_TAG_member)
    <755>   DW_AT_name        : CNT
    <759>   DW_AT_decl_file   : 7
    <75a>   DW_AT_decl_line   : 757
    <75c>   DW_AT_decl_column : 17
    <75d>   DW_AT_type        : <0x321>
    <761>   DW_AT_data_member_location: 36
 <2><762>: Abbrev Number: 15 (DW_TAG_member)
    <763>   DW_AT_name        : PSC
    <767>   DW_AT_decl_file   : 7
    <768>   DW_AT_decl_line   : 758
    <76a>   DW_AT_decl_column : 17
    <76b>   DW_AT_type        : <0x321>
    <76f>   DW_AT_data_member_location: 40
 <2><770>: Abbrev Number: 15 (DW_TAG_member)
    <771>   DW_AT_name        : ARR
    <775>   DW_AT_decl_file   : 7
    <776>   DW_AT_decl_line   : 759
    <778>   DW_AT_decl_column : 17
    <779>   DW_AT_type        : <0x321>
    <77d>   DW_AT_data_member_location: 44
 <2><77e>: Abbrev Number: 15 (DW_TAG_member)
    <77f>   DW_AT_name        : RCR
    <783>   DW_AT_decl_file   : 7
    <784>   DW_AT_decl_line   : 760
    <786>   DW_AT_decl_column : 17
    <787>   DW_AT_type        : <0x321>
    <78b>   DW_AT_data_member_location: 48
 <2><78c>: Abbrev Number: 16 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x19fc6): CCR1
    <791>   DW_AT_decl_file   : 7
    <792>   DW_AT_decl_line   : 761
    <794>   DW_AT_decl_column : 17
    <795>   DW_AT_type        : <0x321>
    <799>   DW_AT_data_member_location: 52
 <2><79a>: Abbrev Number: 16 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x58c5f): CCR2
    <79f>   DW_AT_decl_file   : 7
    <7a0>   DW_AT_decl_line   : 762
    <7a2>   DW_AT_decl_column : 17
    <7a3>   DW_AT_type        : <0x321>
    <7a7>   DW_AT_data_member_location: 56
 <2><7a8>: Abbrev Number: 16 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0xa2df7): CCR3
    <7ad>   DW_AT_decl_file   : 7
    <7ae>   DW_AT_decl_line   : 763
    <7b0>   DW_AT_decl_column : 17
    <7b1>   DW_AT_type        : <0x321>
    <7b5>   DW_AT_data_member_location: 60
 <2><7b6>: Abbrev Number: 16 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xd5c8): CCR4
    <7bb>   DW_AT_decl_file   : 7
    <7bc>   DW_AT_decl_line   : 764
    <7be>   DW_AT_decl_column : 17
    <7bf>   DW_AT_type        : <0x321>
    <7c3>   DW_AT_data_member_location: 64
 <2><7c4>: Abbrev Number: 16 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x91164): BDTR
    <7c9>   DW_AT_decl_file   : 7
    <7ca>   DW_AT_decl_line   : 765
    <7cc>   DW_AT_decl_column : 17
    <7cd>   DW_AT_type        : <0x321>
    <7d1>   DW_AT_data_member_location: 68
 <2><7d2>: Abbrev Number: 15 (DW_TAG_member)
    <7d3>   DW_AT_name        : DCR
    <7d7>   DW_AT_decl_file   : 7
    <7d8>   DW_AT_decl_line   : 766
    <7da>   DW_AT_decl_column : 17
    <7db>   DW_AT_type        : <0x321>
    <7df>   DW_AT_data_member_location: 72
 <2><7e0>: Abbrev Number: 16 (DW_TAG_member)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xb663c): DMAR
    <7e5>   DW_AT_decl_file   : 7
    <7e6>   DW_AT_decl_line   : 767
    <7e8>   DW_AT_decl_column : 17
    <7e9>   DW_AT_type        : <0x321>
    <7ed>   DW_AT_data_member_location: 76
 <2><7ee>: Abbrev Number: 15 (DW_TAG_member)
    <7ef>   DW_AT_name        : OR
    <7f2>   DW_AT_decl_file   : 7
    <7f3>   DW_AT_decl_line   : 768
    <7f5>   DW_AT_decl_column : 17
    <7f6>   DW_AT_type        : <0x321>
    <7fa>   DW_AT_data_member_location: 80
 <2><7fb>: Abbrev Number: 0
 <1><7fc>: Abbrev Number: 17 (DW_TAG_typedef)
    <7fd>   DW_AT_name        : (indirect string, offset: 0xc8b9c): TIM_TypeDef
    <801>   DW_AT_decl_file   : 7
    <802>   DW_AT_decl_line   : 769
    <804>   DW_AT_decl_column : 3
    <805>   DW_AT_type        : <0x6cd>
 <1><809>: Abbrev Number: 14 (DW_TAG_structure_type)
    <80a>   DW_AT_byte_size   : 28
    <80b>   DW_AT_decl_file   : 7
    <80c>   DW_AT_decl_line   : 775
    <80e>   DW_AT_decl_column : 9
    <80f>   DW_AT_sibling     : <0x874>
 <2><813>: Abbrev Number: 15 (DW_TAG_member)
    <814>   DW_AT_name        : SR
    <817>   DW_AT_decl_file   : 7
    <818>   DW_AT_decl_line   : 777
    <81a>   DW_AT_decl_column : 17
    <81b>   DW_AT_type        : <0x321>
    <81f>   DW_AT_data_member_location: 0
 <2><820>: Abbrev Number: 15 (DW_TAG_member)
    <821>   DW_AT_name        : DR
    <824>   DW_AT_decl_file   : 7
    <825>   DW_AT_decl_line   : 778
    <827>   DW_AT_decl_column : 17
    <828>   DW_AT_type        : <0x321>
    <82c>   DW_AT_data_member_location: 4
 <2><82d>: Abbrev Number: 15 (DW_TAG_member)
    <82e>   DW_AT_name        : BRR
    <832>   DW_AT_decl_file   : 7
    <833>   DW_AT_decl_line   : 779
    <835>   DW_AT_decl_column : 17
    <836>   DW_AT_type        : <0x321>
    <83a>   DW_AT_data_member_location: 8
 <2><83b>: Abbrev Number: 15 (DW_TAG_member)
    <83c>   DW_AT_name        : CR1
    <840>   DW_AT_decl_file   : 7
    <841>   DW_AT_decl_line   : 780
    <843>   DW_AT_decl_column : 17
    <844>   DW_AT_type        : <0x321>
    <848>   DW_AT_data_member_location: 12
 <2><849>: Abbrev Number: 15 (DW_TAG_member)
    <84a>   DW_AT_name        : CR2
    <84e>   DW_AT_decl_file   : 7
    <84f>   DW_AT_decl_line   : 781
    <851>   DW_AT_decl_column : 17
    <852>   DW_AT_type        : <0x321>
    <856>   DW_AT_data_member_location: 16
 <2><857>: Abbrev Number: 15 (DW_TAG_member)
    <858>   DW_AT_name        : CR3
    <85c>   DW_AT_decl_file   : 7
    <85d>   DW_AT_decl_line   : 782
    <85f>   DW_AT_decl_column : 17
    <860>   DW_AT_type        : <0x321>
    <864>   DW_AT_data_member_location: 20
 <2><865>: Abbrev Number: 16 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x3b3e3): GTPR
    <86a>   DW_AT_decl_file   : 7
    <86b>   DW_AT_decl_line   : 783
    <86d>   DW_AT_decl_column : 17
    <86e>   DW_AT_type        : <0x321>
    <872>   DW_AT_data_member_location: 24
 <2><873>: Abbrev Number: 0
 <1><874>: Abbrev Number: 17 (DW_TAG_typedef)
    <875>   DW_AT_name        : (indirect string, offset: 0x7183f): USART_TypeDef
    <879>   DW_AT_decl_file   : 7
    <87a>   DW_AT_decl_line   : 784
    <87c>   DW_AT_decl_column : 3
    <87d>   DW_AT_type        : <0x809>
 <1><881>: Abbrev Number: 5 (DW_TAG_base_type)
    <882>   DW_AT_byte_size   : 8
    <883>   DW_AT_encoding    : 4	(float)
    <884>   DW_AT_name        : (indirect string, offset: 0x4d39b): long double
 <1><888>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <889>   DW_AT_encoding    : 7	(unsigned)
    <88a>   DW_AT_byte_size   : 1
    <88b>   DW_AT_type        : <0x27f>
    <88f>   DW_AT_decl_file   : 8
    <890>   DW_AT_decl_line   : 40
    <891>   DW_AT_decl_column : 1
    <892>   DW_AT_sibling     : <0x8af>
 <2><896>: Abbrev Number: 4 (DW_TAG_enumerator)
    <897>   DW_AT_name        : (indirect string, offset: 0x47f01): HAL_OK
    <89b>   DW_AT_const_value : 0
 <2><89c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89d>   DW_AT_name        : (indirect string, offset: 0x84d27): HAL_ERROR
    <8a1>   DW_AT_const_value : 1
 <2><8a2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x25b64): HAL_BUSY
    <8a7>   DW_AT_const_value : 2
 <2><8a8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8a9>   DW_AT_name        : (indirect string, offset: 0x3e616): HAL_TIMEOUT
    <8ad>   DW_AT_const_value : 3
 <2><8ae>: Abbrev Number: 0
 <1><8af>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <8b0>   DW_AT_encoding    : 7	(unsigned)
    <8b1>   DW_AT_byte_size   : 1
    <8b2>   DW_AT_type        : <0x27f>
    <8b6>   DW_AT_decl_file   : 8
    <8b7>   DW_AT_decl_line   : 51
    <8b8>   DW_AT_decl_column : 1
    <8b9>   DW_AT_sibling     : <0x8ca>
 <2><8bd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8be>   DW_AT_name        : (indirect string, offset: 0x9daee): HAL_UNLOCKED
    <8c2>   DW_AT_const_value : 0
 <2><8c3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xd3c43): HAL_LOCKED
    <8c8>   DW_AT_const_value : 1
 <2><8c9>: Abbrev Number: 0
 <1><8ca>: Abbrev Number: 6 (DW_TAG_typedef)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x7d335): HAL_LockTypeDef
    <8cf>   DW_AT_decl_file   : 8
    <8d0>   DW_AT_decl_line   : 54
    <8d1>   DW_AT_decl_column : 3
    <8d2>   DW_AT_type        : <0x8af>
 <1><8d6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8d7>   DW_AT_byte_size   : 28
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 47
    <8da>   DW_AT_decl_column : 9
    <8db>   DW_AT_sibling     : <0x93b>
 <2><8df>: Abbrev Number: 19 (DW_TAG_member)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x8eb92): PLLState
    <8e4>   DW_AT_decl_file   : 9
    <8e5>   DW_AT_decl_line   : 49
    <8e6>   DW_AT_decl_column : 12
    <8e7>   DW_AT_type        : <0x315>
    <8eb>   DW_AT_data_member_location: 0
 <2><8ec>: Abbrev Number: 19 (DW_TAG_member)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x93a6f): PLLSource
    <8f1>   DW_AT_decl_file   : 9
    <8f2>   DW_AT_decl_line   : 52
    <8f3>   DW_AT_decl_column : 12
    <8f4>   DW_AT_type        : <0x315>
    <8f8>   DW_AT_data_member_location: 4
 <2><8f9>: Abbrev Number: 19 (DW_TAG_member)
    <8fa>   DW_AT_name        : (indirect string, offset: 0xaff3f): PLLM
    <8fe>   DW_AT_decl_file   : 9
    <8ff>   DW_AT_decl_line   : 55
    <900>   DW_AT_decl_column : 12
    <901>   DW_AT_type        : <0x315>
    <905>   DW_AT_data_member_location: 8
 <2><906>: Abbrev Number: 19 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0xaff44): PLLN
    <90b>   DW_AT_decl_file   : 9
    <90c>   DW_AT_decl_line   : 58
    <90d>   DW_AT_decl_column : 12
    <90e>   DW_AT_type        : <0x315>
    <912>   DW_AT_data_member_location: 12
 <2><913>: Abbrev Number: 19 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0xaff61): PLLP
    <918>   DW_AT_decl_file   : 9
    <919>   DW_AT_decl_line   : 62
    <91a>   DW_AT_decl_column : 12
    <91b>   DW_AT_type        : <0x315>
    <91f>   DW_AT_data_member_location: 16
 <2><920>: Abbrev Number: 19 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0x4ec57): PLLQ
    <925>   DW_AT_decl_file   : 9
    <926>   DW_AT_decl_line   : 65
    <927>   DW_AT_decl_column : 12
    <928>   DW_AT_type        : <0x315>
    <92c>   DW_AT_data_member_location: 20
 <2><92d>: Abbrev Number: 19 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x89d44): PLLR
    <932>   DW_AT_decl_file   : 9
    <933>   DW_AT_decl_line   : 70
    <934>   DW_AT_decl_column : 12
    <935>   DW_AT_type        : <0x315>
    <939>   DW_AT_data_member_location: 24
 <2><93a>: Abbrev Number: 0
 <1><93b>: Abbrev Number: 6 (DW_TAG_typedef)
    <93c>   DW_AT_name        : (indirect string, offset: 0x80594): RCC_PLLInitTypeDef
    <940>   DW_AT_decl_file   : 9
    <941>   DW_AT_decl_line   : 75
    <942>   DW_AT_decl_column : 2
    <943>   DW_AT_type        : <0x8d6>
 <1><947>: Abbrev Number: 18 (DW_TAG_structure_type)
    <948>   DW_AT_byte_size   : 52
    <949>   DW_AT_decl_file   : 10
    <94a>   DW_AT_decl_line   : 51
    <94b>   DW_AT_decl_column : 9
    <94c>   DW_AT_sibling     : <0x9ac>
 <2><950>: Abbrev Number: 19 (DW_TAG_member)
    <951>   DW_AT_name        : (indirect string, offset: 0xad120): OscillatorType
    <955>   DW_AT_decl_file   : 10
    <956>   DW_AT_decl_line   : 53
    <957>   DW_AT_decl_column : 12
    <958>   DW_AT_type        : <0x315>
    <95c>   DW_AT_data_member_location: 0
 <2><95d>: Abbrev Number: 19 (DW_TAG_member)
    <95e>   DW_AT_name        : (indirect string, offset: 0x90488): HSEState
    <962>   DW_AT_decl_file   : 10
    <963>   DW_AT_decl_line   : 56
    <964>   DW_AT_decl_column : 12
    <965>   DW_AT_type        : <0x315>
    <969>   DW_AT_data_member_location: 4
 <2><96a>: Abbrev Number: 19 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x85800): LSEState
    <96f>   DW_AT_decl_file   : 10
    <970>   DW_AT_decl_line   : 59
    <971>   DW_AT_decl_column : 12
    <972>   DW_AT_type        : <0x315>
    <976>   DW_AT_data_member_location: 8
 <2><977>: Abbrev Number: 19 (DW_TAG_member)
    <978>   DW_AT_name        : (indirect string, offset: 0x5e838): HSIState
    <97c>   DW_AT_decl_file   : 10
    <97d>   DW_AT_decl_line   : 62
    <97e>   DW_AT_decl_column : 12
    <97f>   DW_AT_type        : <0x315>
    <983>   DW_AT_data_member_location: 12
 <2><984>: Abbrev Number: 19 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0xb68df): HSICalibrationValue
    <989>   DW_AT_decl_file   : 10
    <98a>   DW_AT_decl_line   : 65
    <98b>   DW_AT_decl_column : 12
    <98c>   DW_AT_type        : <0x315>
    <990>   DW_AT_data_member_location: 16
 <2><991>: Abbrev Number: 19 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x4a682): LSIState
    <996>   DW_AT_decl_file   : 10
    <997>   DW_AT_decl_line   : 68
    <998>   DW_AT_decl_column : 12
    <999>   DW_AT_type        : <0x315>
    <99d>   DW_AT_data_member_location: 20
 <2><99e>: Abbrev Number: 20 (DW_TAG_member)
    <99f>   DW_AT_name        : PLL
    <9a3>   DW_AT_decl_file   : 10
    <9a4>   DW_AT_decl_line   : 71
    <9a5>   DW_AT_decl_column : 22
    <9a6>   DW_AT_type        : <0x93b>
    <9aa>   DW_AT_data_member_location: 24
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 6 (DW_TAG_typedef)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x70a3d): RCC_OscInitTypeDef
    <9b1>   DW_AT_decl_file   : 10
    <9b2>   DW_AT_decl_line   : 72
    <9b3>   DW_AT_decl_column : 2
    <9b4>   DW_AT_type        : <0x947>
 <1><9b8>: Abbrev Number: 18 (DW_TAG_structure_type)
    <9b9>   DW_AT_byte_size   : 20
    <9ba>   DW_AT_decl_file   : 10
    <9bb>   DW_AT_decl_line   : 77
    <9bc>   DW_AT_decl_column : 9
    <9bd>   DW_AT_sibling     : <0xa03>
 <2><9c1>: Abbrev Number: 19 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x4144c): ClockType
    <9c6>   DW_AT_decl_file   : 10
    <9c7>   DW_AT_decl_line   : 79
    <9c8>   DW_AT_decl_column : 12
    <9c9>   DW_AT_type        : <0x315>
    <9cd>   DW_AT_data_member_location: 0
 <2><9ce>: Abbrev Number: 19 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x7ff90): SYSCLKSource
    <9d3>   DW_AT_decl_file   : 10
    <9d4>   DW_AT_decl_line   : 82
    <9d5>   DW_AT_decl_column : 12
    <9d6>   DW_AT_type        : <0x315>
    <9da>   DW_AT_data_member_location: 4
 <2><9db>: Abbrev Number: 19 (DW_TAG_member)
    <9dc>   DW_AT_name        : (indirect string, offset: 0xafa2a): AHBCLKDivider
    <9e0>   DW_AT_decl_file   : 10
    <9e1>   DW_AT_decl_line   : 85
    <9e2>   DW_AT_decl_column : 12
    <9e3>   DW_AT_type        : <0x315>
    <9e7>   DW_AT_data_member_location: 8
 <2><9e8>: Abbrev Number: 19 (DW_TAG_member)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x83bb): APB1CLKDivider
    <9ed>   DW_AT_decl_file   : 10
    <9ee>   DW_AT_decl_line   : 88
    <9ef>   DW_AT_decl_column : 12
    <9f0>   DW_AT_type        : <0x315>
    <9f4>   DW_AT_data_member_location: 12
 <2><9f5>: Abbrev Number: 19 (DW_TAG_member)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x610cc): APB2CLKDivider
    <9fa>   DW_AT_decl_file   : 10
    <9fb>   DW_AT_decl_line   : 91
    <9fc>   DW_AT_decl_column : 12
    <9fd>   DW_AT_type        : <0x315>
    <a01>   DW_AT_data_member_location: 16
 <2><a02>: Abbrev Number: 0
 <1><a03>: Abbrev Number: 6 (DW_TAG_typedef)
    <a04>   DW_AT_name        : (indirect string, offset: 0x94d3e): RCC_ClkInitTypeDef
    <a08>   DW_AT_decl_file   : 10
    <a09>   DW_AT_decl_line   : 94
    <a0a>   DW_AT_decl_column : 2
    <a0b>   DW_AT_type        : <0x9b8>
 <1><a0f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a10>   DW_AT_byte_size   : 20
    <a11>   DW_AT_decl_file   : 11
    <a12>   DW_AT_decl_line   : 47
    <a13>   DW_AT_decl_column : 9
    <a14>   DW_AT_sibling     : <0xa5a>
 <2><a18>: Abbrev Number: 20 (DW_TAG_member)
    <a19>   DW_AT_name        : Pin
    <a1d>   DW_AT_decl_file   : 11
    <a1e>   DW_AT_decl_line   : 49
    <a1f>   DW_AT_decl_column : 12
    <a20>   DW_AT_type        : <0x315>
    <a24>   DW_AT_data_member_location: 0
 <2><a25>: Abbrev Number: 19 (DW_TAG_member)
    <a26>   DW_AT_name        : (indirect string, offset: 0x5c21a): Mode
    <a2a>   DW_AT_decl_file   : 11
    <a2b>   DW_AT_decl_line   : 52
    <a2c>   DW_AT_decl_column : 12
    <a2d>   DW_AT_type        : <0x315>
    <a31>   DW_AT_data_member_location: 4
 <2><a32>: Abbrev Number: 19 (DW_TAG_member)
    <a33>   DW_AT_name        : (indirect string, offset: 0x6d06c): Pull
    <a37>   DW_AT_decl_file   : 11
    <a38>   DW_AT_decl_line   : 55
    <a39>   DW_AT_decl_column : 12
    <a3a>   DW_AT_type        : <0x315>
    <a3e>   DW_AT_data_member_location: 8
 <2><a3f>: Abbrev Number: 19 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0x7c5bb): Speed
    <a44>   DW_AT_decl_file   : 11
    <a45>   DW_AT_decl_line   : 58
    <a46>   DW_AT_decl_column : 12
    <a47>   DW_AT_type        : <0x315>
    <a4b>   DW_AT_data_member_location: 12
 <2><a4c>: Abbrev Number: 19 (DW_TAG_member)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x6108d): Alternate
    <a51>   DW_AT_decl_file   : 11
    <a52>   DW_AT_decl_line   : 61
    <a53>   DW_AT_decl_column : 12
    <a54>   DW_AT_type        : <0x315>
    <a58>   DW_AT_data_member_location: 16
 <2><a59>: Abbrev Number: 0
 <1><a5a>: Abbrev Number: 6 (DW_TAG_typedef)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xa675b): GPIO_InitTypeDef
    <a5f>   DW_AT_decl_file   : 11
    <a60>   DW_AT_decl_line   : 63
    <a61>   DW_AT_decl_column : 2
    <a62>   DW_AT_type        : <0xa0f>
 <1><a66>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <a67>   DW_AT_encoding    : 7	(unsigned)
    <a68>   DW_AT_byte_size   : 1
    <a69>   DW_AT_type        : <0x27f>
    <a6d>   DW_AT_decl_file   : 11
    <a6e>   DW_AT_decl_line   : 69
    <a6f>   DW_AT_decl_column : 1
    <a70>   DW_AT_sibling     : <0xa81>
 <2><a74>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a75>   DW_AT_name        : (indirect string, offset: 0x2c628): GPIO_PIN_RESET
    <a79>   DW_AT_const_value : 0
 <2><a7a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x35ed7): GPIO_PIN_SET
    <a7f>   DW_AT_const_value : 1
 <2><a80>: Abbrev Number: 0
 <1><a81>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <a82>   DW_AT_prototyped  : 1
 <1><a82>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <a83>   DW_AT_byte_size   : 4
    <a84>   DW_AT_type        : <0xa81>
 <1><a88>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a89>   DW_AT_byte_size   : 48
    <a8a>   DW_AT_decl_file   : 12
    <a8b>   DW_AT_decl_line   : 49
    <a8c>   DW_AT_decl_column : 9
    <a8d>   DW_AT_sibling     : <0xb2e>
 <2><a91>: Abbrev Number: 19 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x6e2b6): Channel
    <a96>   DW_AT_decl_file   : 12
    <a97>   DW_AT_decl_line   : 51
    <a98>   DW_AT_decl_column : 12
    <a99>   DW_AT_type        : <0x315>
    <a9d>   DW_AT_data_member_location: 0
 <2><a9e>: Abbrev Number: 19 (DW_TAG_member)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x4e895): Direction
    <aa3>   DW_AT_decl_file   : 12
    <aa4>   DW_AT_decl_line   : 54
    <aa5>   DW_AT_decl_column : 12
    <aa6>   DW_AT_type        : <0x315>
    <aaa>   DW_AT_data_member_location: 4
 <2><aab>: Abbrev Number: 19 (DW_TAG_member)
    <aac>   DW_AT_name        : (indirect string, offset: 0xe288): PeriphInc
    <ab0>   DW_AT_decl_file   : 12
    <ab1>   DW_AT_decl_line   : 58
    <ab2>   DW_AT_decl_column : 12
    <ab3>   DW_AT_type        : <0x315>
    <ab7>   DW_AT_data_member_location: 8
 <2><ab8>: Abbrev Number: 19 (DW_TAG_member)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x21df4): MemInc
    <abd>   DW_AT_decl_file   : 12
    <abe>   DW_AT_decl_line   : 61
    <abf>   DW_AT_decl_column : 12
    <ac0>   DW_AT_type        : <0x315>
    <ac4>   DW_AT_data_member_location: 12
 <2><ac5>: Abbrev Number: 19 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x694c9): PeriphDataAlignment
    <aca>   DW_AT_decl_file   : 12
    <acb>   DW_AT_decl_line   : 64
    <acc>   DW_AT_decl_column : 12
    <acd>   DW_AT_type        : <0x315>
    <ad1>   DW_AT_data_member_location: 16
 <2><ad2>: Abbrev Number: 19 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0xbfc6c): MemDataAlignment
    <ad7>   DW_AT_decl_file   : 12
    <ad8>   DW_AT_decl_line   : 67
    <ad9>   DW_AT_decl_column : 12
    <ada>   DW_AT_type        : <0x315>
    <ade>   DW_AT_data_member_location: 20
 <2><adf>: Abbrev Number: 19 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x5c21a): Mode
    <ae4>   DW_AT_decl_file   : 12
    <ae5>   DW_AT_decl_line   : 70
    <ae6>   DW_AT_decl_column : 12
    <ae7>   DW_AT_type        : <0x315>
    <aeb>   DW_AT_data_member_location: 24
 <2><aec>: Abbrev Number: 19 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0xd6785): Priority
    <af1>   DW_AT_decl_file   : 12
    <af2>   DW_AT_decl_line   : 75
    <af3>   DW_AT_decl_column : 12
    <af4>   DW_AT_type        : <0x315>
    <af8>   DW_AT_data_member_location: 28
 <2><af9>: Abbrev Number: 19 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x5b619): FIFOMode
    <afe>   DW_AT_decl_file   : 12
    <aff>   DW_AT_decl_line   : 78
    <b00>   DW_AT_decl_column : 12
    <b01>   DW_AT_type        : <0x315>
    <b05>   DW_AT_data_member_location: 32
 <2><b06>: Abbrev Number: 19 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0xa21a0): FIFOThreshold
    <b0b>   DW_AT_decl_file   : 12
    <b0c>   DW_AT_decl_line   : 83
    <b0d>   DW_AT_decl_column : 12
    <b0e>   DW_AT_type        : <0x315>
    <b12>   DW_AT_data_member_location: 36
 <2><b13>: Abbrev Number: 19 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0xa00ad): MemBurst
    <b18>   DW_AT_decl_file   : 12
    <b19>   DW_AT_decl_line   : 86
    <b1a>   DW_AT_decl_column : 12
    <b1b>   DW_AT_type        : <0x315>
    <b1f>   DW_AT_data_member_location: 40
 <2><b20>: Abbrev Number: 19 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0x48ee3): PeriphBurst
    <b25>   DW_AT_decl_file   : 12
    <b26>   DW_AT_decl_line   : 92
    <b27>   DW_AT_decl_column : 12
    <b28>   DW_AT_type        : <0x315>
    <b2c>   DW_AT_data_member_location: 44
 <2><b2d>: Abbrev Number: 0
 <1><b2e>: Abbrev Number: 6 (DW_TAG_typedef)
    <b2f>   DW_AT_name        : (indirect string, offset: 0x39681): DMA_InitTypeDef
    <b33>   DW_AT_decl_file   : 12
    <b34>   DW_AT_decl_line   : 97
    <b35>   DW_AT_decl_column : 2
    <b36>   DW_AT_type        : <0xa88>
 <1><b3a>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <b3b>   DW_AT_encoding    : 7	(unsigned)
    <b3c>   DW_AT_byte_size   : 1
    <b3d>   DW_AT_type        : <0x27f>
    <b41>   DW_AT_decl_file   : 12
    <b42>   DW_AT_decl_line   : 104
    <b43>   DW_AT_decl_column : 1
    <b44>   DW_AT_sibling     : <0xb6d>
 <2><b48>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b49>   DW_AT_name        : (indirect string, offset: 0x9ee4c): HAL_DMA_STATE_RESET
    <b4d>   DW_AT_const_value : 0
 <2><b4e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x3aa3a): HAL_DMA_STATE_READY
    <b53>   DW_AT_const_value : 1
 <2><b54>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b55>   DW_AT_name        : (indirect string, offset: 0x933cb): HAL_DMA_STATE_BUSY
    <b59>   DW_AT_const_value : 2
 <2><b5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b5b>   DW_AT_name        : (indirect string, offset: 0xd0a5d): HAL_DMA_STATE_TIMEOUT
    <b5f>   DW_AT_const_value : 3
 <2><b60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b61>   DW_AT_name        : (indirect string, offset: 0xb5a7e): HAL_DMA_STATE_ERROR
    <b65>   DW_AT_const_value : 4
 <2><b66>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b67>   DW_AT_name        : (indirect string, offset: 0x30c5d): HAL_DMA_STATE_ABORT
    <b6b>   DW_AT_const_value : 5
 <2><b6c>: Abbrev Number: 0
 <1><b6d>: Abbrev Number: 6 (DW_TAG_typedef)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xbf02b): HAL_DMA_StateTypeDef
    <b72>   DW_AT_decl_file   : 12
    <b73>   DW_AT_decl_line   : 111
    <b74>   DW_AT_decl_column : 2
    <b75>   DW_AT_type        : <0xb3a>
 <1><b79>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b7a>   DW_AT_type        : <0xb6d>
 <1><b7e>: Abbrev Number: 23 (DW_TAG_structure_type)
    <b7f>   DW_AT_name        : (indirect string, offset: 0xb4b84): __DMA_HandleTypeDef
    <b83>   DW_AT_byte_size   : 96
    <b84>   DW_AT_decl_file   : 12
    <b85>   DW_AT_decl_line   : 139
    <b86>   DW_AT_decl_column : 16
    <b87>   DW_AT_sibling     : <0xc42>
 <2><b8b>: Abbrev Number: 19 (DW_TAG_member)
    <b8c>   DW_AT_name        : (indirect string, offset: 0xcd032): Instance
    <b90>   DW_AT_decl_file   : 12
    <b91>   DW_AT_decl_line   : 141
    <b92>   DW_AT_decl_column : 31
    <b93>   DW_AT_type        : <0xc42>
    <b97>   DW_AT_data_member_location: 0
 <2><b98>: Abbrev Number: 19 (DW_TAG_member)
    <b99>   DW_AT_name        : (indirect string, offset: 0xd71f9): Init
    <b9d>   DW_AT_decl_file   : 12
    <b9e>   DW_AT_decl_line   : 143
    <b9f>   DW_AT_decl_column : 30
    <ba0>   DW_AT_type        : <0xb2e>
    <ba4>   DW_AT_data_member_location: 4
 <2><ba5>: Abbrev Number: 19 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x97d68): Lock
    <baa>   DW_AT_decl_file   : 12
    <bab>   DW_AT_decl_line   : 145
    <bac>   DW_AT_decl_column : 30
    <bad>   DW_AT_type        : <0x8ca>
    <bb1>   DW_AT_data_member_location: 52
 <2><bb2>: Abbrev Number: 19 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x9048b): State
    <bb7>   DW_AT_decl_file   : 12
    <bb8>   DW_AT_decl_line   : 147
    <bb9>   DW_AT_decl_column : 30
    <bba>   DW_AT_type        : <0xb79>
    <bbe>   DW_AT_data_member_location: 53
 <2><bbf>: Abbrev Number: 19 (DW_TAG_member)
    <bc0>   DW_AT_name        : (indirect string, offset: 0xc9b63): Parent
    <bc4>   DW_AT_decl_file   : 12
    <bc5>   DW_AT_decl_line   : 149
    <bc6>   DW_AT_decl_column : 31
    <bc7>   DW_AT_type        : <0xc48>
    <bcb>   DW_AT_data_member_location: 56
 <2><bcc>: Abbrev Number: 19 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0xd3181): XferCpltCallback
    <bd1>   DW_AT_decl_file   : 12
    <bd2>   DW_AT_decl_line   : 151
    <bd3>   DW_AT_decl_column : 33
    <bd4>   DW_AT_type        : <0xc5b>
    <bd8>   DW_AT_data_member_location: 60
 <2><bd9>: Abbrev Number: 19 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0xa575a): XferHalfCpltCallback
    <bde>   DW_AT_decl_file   : 12
    <bdf>   DW_AT_decl_line   : 153
    <be0>   DW_AT_decl_column : 33
    <be1>   DW_AT_type        : <0xc5b>
    <be5>   DW_AT_data_member_location: 64
 <2><be6>: Abbrev Number: 19 (DW_TAG_member)
    <be7>   DW_AT_name        : (indirect string, offset: 0xc24cc): XferM1CpltCallback
    <beb>   DW_AT_decl_file   : 12
    <bec>   DW_AT_decl_line   : 155
    <bed>   DW_AT_decl_column : 33
    <bee>   DW_AT_type        : <0xc5b>
    <bf2>   DW_AT_data_member_location: 68
 <2><bf3>: Abbrev Number: 19 (DW_TAG_member)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x65dc7): XferM1HalfCpltCallback
    <bf8>   DW_AT_decl_file   : 12
    <bf9>   DW_AT_decl_line   : 157
    <bfa>   DW_AT_decl_column : 33
    <bfb>   DW_AT_type        : <0xc5b>
    <bff>   DW_AT_data_member_location: 72
 <2><c00>: Abbrev Number: 19 (DW_TAG_member)
    <c01>   DW_AT_name        : (indirect string, offset: 0x1f09a): XferErrorCallback
    <c05>   DW_AT_decl_file   : 12
    <c06>   DW_AT_decl_line   : 159
    <c07>   DW_AT_decl_column : 33
    <c08>   DW_AT_type        : <0xc5b>
    <c0c>   DW_AT_data_member_location: 76
 <2><c0d>: Abbrev Number: 19 (DW_TAG_member)
    <c0e>   DW_AT_name        : (indirect string, offset: 0xc60ec): XferAbortCallback
    <c12>   DW_AT_decl_file   : 12
    <c13>   DW_AT_decl_line   : 161
    <c14>   DW_AT_decl_column : 33
    <c15>   DW_AT_type        : <0xc5b>
    <c19>   DW_AT_data_member_location: 80
 <2><c1a>: Abbrev Number: 19 (DW_TAG_member)
    <c1b>   DW_AT_name        : (indirect string, offset: 0xcf5e8): ErrorCode
    <c1f>   DW_AT_decl_file   : 12
    <c20>   DW_AT_decl_line   : 163
    <c21>   DW_AT_decl_column : 30
    <c22>   DW_AT_type        : <0x321>
    <c26>   DW_AT_data_member_location: 84
 <2><c27>: Abbrev Number: 19 (DW_TAG_member)
    <c28>   DW_AT_name        : (indirect string, offset: 0x5ec1a): StreamBaseAddress
    <c2c>   DW_AT_decl_file   : 12
    <c2d>   DW_AT_decl_line   : 165
    <c2e>   DW_AT_decl_column : 30
    <c2f>   DW_AT_type        : <0x315>
    <c33>   DW_AT_data_member_location: 88
 <2><c34>: Abbrev Number: 19 (DW_TAG_member)
    <c35>   DW_AT_name        : (indirect string, offset: 0xb29ef): StreamIndex
    <c39>   DW_AT_decl_file   : 12
    <c3a>   DW_AT_decl_line   : 167
    <c3b>   DW_AT_decl_column : 30
    <c3c>   DW_AT_type        : <0x315>
    <c40>   DW_AT_data_member_location: 92
 <2><c41>: Abbrev Number: 0
 <1><c42>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <c43>   DW_AT_byte_size   : 4
    <c44>   DW_AT_type        : <0x3ef>
 <1><c48>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <c49>   DW_AT_byte_size   : 4
 <1><c4a>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <c4b>   DW_AT_prototyped  : 1
    <c4b>   DW_AT_sibling     : <0xc55>
 <2><c4f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <c50>   DW_AT_type        : <0xc55>
 <2><c54>: Abbrev Number: 0
 <1><c55>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <c56>   DW_AT_byte_size   : 4
    <c57>   DW_AT_type        : <0xb7e>
 <1><c5b>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <c5c>   DW_AT_byte_size   : 4
    <c5d>   DW_AT_type        : <0xc4a>
 <1><c61>: Abbrev Number: 6 (DW_TAG_typedef)
    <c62>   DW_AT_name        : (indirect string, offset: 0xb4b86): DMA_HandleTypeDef
    <c66>   DW_AT_decl_file   : 12
    <c67>   DW_AT_decl_line   : 169
    <c68>   DW_AT_decl_column : 2
    <c69>   DW_AT_type        : <0xb7e>
 <1><c6d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c6e>   DW_AT_byte_size   : 24
    <c6f>   DW_AT_decl_file   : 13
    <c70>   DW_AT_decl_line   : 47
    <c71>   DW_AT_decl_column : 9
    <c72>   DW_AT_sibling     : <0xcc5>
 <2><c76>: Abbrev Number: 19 (DW_TAG_member)
    <c77>   DW_AT_name        : (indirect string, offset: 0x6d3db): Prescaler
    <c7b>   DW_AT_decl_file   : 13
    <c7c>   DW_AT_decl_line   : 49
    <c7d>   DW_AT_decl_column : 12
    <c7e>   DW_AT_type        : <0x315>
    <c82>   DW_AT_data_member_location: 0
 <2><c83>: Abbrev Number: 19 (DW_TAG_member)
    <c84>   DW_AT_name        : (indirect string, offset: 0xc0e3c): CounterMode
    <c88>   DW_AT_decl_file   : 13
    <c89>   DW_AT_decl_line   : 52
    <c8a>   DW_AT_decl_column : 12
    <c8b>   DW_AT_type        : <0x315>
    <c8f>   DW_AT_data_member_location: 4
 <2><c90>: Abbrev Number: 19 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0xdd9d8): Period
    <c95>   DW_AT_decl_file   : 13
    <c96>   DW_AT_decl_line   : 55
    <c97>   DW_AT_decl_column : 12
    <c98>   DW_AT_type        : <0x315>
    <c9c>   DW_AT_data_member_location: 8
 <2><c9d>: Abbrev Number: 19 (DW_TAG_member)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x5614c): ClockDivision
    <ca2>   DW_AT_decl_file   : 13
    <ca3>   DW_AT_decl_line   : 59
    <ca4>   DW_AT_decl_column : 12
    <ca5>   DW_AT_type        : <0x315>
    <ca9>   DW_AT_data_member_location: 12
 <2><caa>: Abbrev Number: 19 (DW_TAG_member)
    <cab>   DW_AT_name        : (indirect string, offset: 0x94ad0): RepetitionCounter
    <caf>   DW_AT_decl_file   : 13
    <cb0>   DW_AT_decl_line   : 62
    <cb1>   DW_AT_decl_column : 12
    <cb2>   DW_AT_type        : <0x315>
    <cb6>   DW_AT_data_member_location: 16
 <2><cb7>: Abbrev Number: 19 (DW_TAG_member)
    <cb8>   DW_AT_name        : (indirect string, offset: 0xc3e78): AutoReloadPreload
    <cbc>   DW_AT_decl_file   : 13
    <cbd>   DW_AT_decl_line   : 73
    <cbe>   DW_AT_decl_column : 12
    <cbf>   DW_AT_type        : <0x315>
    <cc3>   DW_AT_data_member_location: 20
 <2><cc4>: Abbrev Number: 0
 <1><cc5>: Abbrev Number: 6 (DW_TAG_typedef)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x49703): TIM_Base_InitTypeDef
    <cca>   DW_AT_decl_file   : 13
    <ccb>   DW_AT_decl_line   : 75
    <ccc>   DW_AT_decl_column : 3
    <ccd>   DW_AT_type        : <0xc6d>
 <1><cd1>: Abbrev Number: 18 (DW_TAG_structure_type)
    <cd2>   DW_AT_byte_size   : 28
    <cd3>   DW_AT_decl_file   : 13
    <cd4>   DW_AT_decl_line   : 80
    <cd5>   DW_AT_decl_column : 9
    <cd6>   DW_AT_sibling     : <0xd36>
 <2><cda>: Abbrev Number: 19 (DW_TAG_member)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x5c218): OCMode
    <cdf>   DW_AT_decl_file   : 13
    <ce0>   DW_AT_decl_line   : 82
    <ce1>   DW_AT_decl_column : 12
    <ce2>   DW_AT_type        : <0x315>
    <ce6>   DW_AT_data_member_location: 0
 <2><ce7>: Abbrev Number: 19 (DW_TAG_member)
    <ce8>   DW_AT_name        : (indirect string, offset: 0xb18d9): Pulse
    <cec>   DW_AT_decl_file   : 13
    <ced>   DW_AT_decl_line   : 85
    <cee>   DW_AT_decl_column : 12
    <cef>   DW_AT_type        : <0x315>
    <cf3>   DW_AT_data_member_location: 4
 <2><cf4>: Abbrev Number: 19 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x8beb3): OCPolarity
    <cf9>   DW_AT_decl_file   : 13
    <cfa>   DW_AT_decl_line   : 88
    <cfb>   DW_AT_decl_column : 12
    <cfc>   DW_AT_type        : <0x315>
    <d00>   DW_AT_data_member_location: 8
 <2><d01>: Abbrev Number: 19 (DW_TAG_member)
    <d02>   DW_AT_name        : (indirect string, offset: 0x250b8): OCNPolarity
    <d06>   DW_AT_decl_file   : 13
    <d07>   DW_AT_decl_line   : 91
    <d08>   DW_AT_decl_column : 12
    <d09>   DW_AT_type        : <0x315>
    <d0d>   DW_AT_data_member_location: 12
 <2><d0e>: Abbrev Number: 19 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x1ee24): OCFastMode
    <d13>   DW_AT_decl_file   : 13
    <d14>   DW_AT_decl_line   : 95
    <d15>   DW_AT_decl_column : 12
    <d16>   DW_AT_type        : <0x315>
    <d1a>   DW_AT_data_member_location: 16
 <2><d1b>: Abbrev Number: 19 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x521f8): OCIdleState
    <d20>   DW_AT_decl_file   : 13
    <d21>   DW_AT_decl_line   : 100
    <d22>   DW_AT_decl_column : 12
    <d23>   DW_AT_type        : <0x315>
    <d27>   DW_AT_data_member_location: 20
 <2><d28>: Abbrev Number: 19 (DW_TAG_member)
    <d29>   DW_AT_name        : (indirect string, offset: 0x1d2a3): OCNIdleState
    <d2d>   DW_AT_decl_file   : 13
    <d2e>   DW_AT_decl_line   : 104
    <d2f>   DW_AT_decl_column : 12
    <d30>   DW_AT_type        : <0x315>
    <d34>   DW_AT_data_member_location: 24
 <2><d35>: Abbrev Number: 0
 <1><d36>: Abbrev Number: 6 (DW_TAG_typedef)
    <d37>   DW_AT_name        : (indirect string, offset: 0x14b94): TIM_OC_InitTypeDef
    <d3b>   DW_AT_decl_file   : 13
    <d3c>   DW_AT_decl_line   : 107
    <d3d>   DW_AT_decl_column : 3
    <d3e>   DW_AT_type        : <0xcd1>
 <1><d42>: Abbrev Number: 18 (DW_TAG_structure_type)
    <d43>   DW_AT_byte_size   : 36
    <d44>   DW_AT_decl_file   : 13
    <d45>   DW_AT_decl_line   : 166
    <d46>   DW_AT_decl_column : 9
    <d47>   DW_AT_sibling     : <0xdc1>
 <2><d4b>: Abbrev Number: 19 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x227b7): EncoderMode
    <d50>   DW_AT_decl_file   : 13
    <d51>   DW_AT_decl_line   : 168
    <d52>   DW_AT_decl_column : 12
    <d53>   DW_AT_type        : <0x315>
    <d57>   DW_AT_data_member_location: 0
 <2><d58>: Abbrev Number: 19 (DW_TAG_member)
    <d59>   DW_AT_name        : (indirect string, offset: 0xd0182): IC1Polarity
    <d5d>   DW_AT_decl_file   : 13
    <d5e>   DW_AT_decl_line   : 171
    <d5f>   DW_AT_decl_column : 12
    <d60>   DW_AT_type        : <0x315>
    <d64>   DW_AT_data_member_location: 4
 <2><d65>: Abbrev Number: 19 (DW_TAG_member)
    <d66>   DW_AT_name        : (indirect string, offset: 0xd07db): IC1Selection
    <d6a>   DW_AT_decl_file   : 13
    <d6b>   DW_AT_decl_line   : 174
    <d6c>   DW_AT_decl_column : 12
    <d6d>   DW_AT_type        : <0x315>
    <d71>   DW_AT_data_member_location: 8
 <2><d72>: Abbrev Number: 19 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0x6d3d8): IC1Prescaler
    <d77>   DW_AT_decl_file   : 13
    <d78>   DW_AT_decl_line   : 177
    <d79>   DW_AT_decl_column : 12
    <d7a>   DW_AT_type        : <0x315>
    <d7e>   DW_AT_data_member_location: 12
 <2><d7f>: Abbrev Number: 19 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0x17b55): IC1Filter
    <d84>   DW_AT_decl_file   : 13
    <d85>   DW_AT_decl_line   : 180
    <d86>   DW_AT_decl_column : 12
    <d87>   DW_AT_type        : <0x315>
    <d8b>   DW_AT_data_member_location: 16
 <2><d8c>: Abbrev Number: 19 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xa1119): IC2Polarity
    <d91>   DW_AT_decl_file   : 13
    <d92>   DW_AT_decl_line   : 183
    <d93>   DW_AT_decl_column : 12
    <d94>   DW_AT_type        : <0x315>
    <d98>   DW_AT_data_member_location: 20
 <2><d99>: Abbrev Number: 19 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xcabc9): IC2Selection
    <d9e>   DW_AT_decl_file   : 13
    <d9f>   DW_AT_decl_line   : 186
    <da0>   DW_AT_decl_column : 12
    <da1>   DW_AT_type        : <0x315>
    <da5>   DW_AT_data_member_location: 24
 <2><da6>: Abbrev Number: 19 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x67872): IC2Prescaler
    <dab>   DW_AT_decl_file   : 13
    <dac>   DW_AT_decl_line   : 189
    <dad>   DW_AT_decl_column : 12
    <dae>   DW_AT_type        : <0x315>
    <db2>   DW_AT_data_member_location: 28
 <2><db3>: Abbrev Number: 19 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x70cf4): IC2Filter
    <db8>   DW_AT_decl_file   : 13
    <db9>   DW_AT_decl_line   : 192
    <dba>   DW_AT_decl_column : 12
    <dbb>   DW_AT_type        : <0x315>
    <dbf>   DW_AT_data_member_location: 32
 <2><dc0>: Abbrev Number: 0
 <1><dc1>: Abbrev Number: 6 (DW_TAG_typedef)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x315bf): TIM_Encoder_InitTypeDef
    <dc6>   DW_AT_decl_file   : 13
    <dc7>   DW_AT_decl_line   : 194
    <dc8>   DW_AT_decl_column : 3
    <dc9>   DW_AT_type        : <0xd42>
 <1><dcd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <dce>   DW_AT_byte_size   : 16
    <dcf>   DW_AT_decl_file   : 13
    <dd0>   DW_AT_decl_line   : 199
    <dd1>   DW_AT_decl_column : 9
    <dd2>   DW_AT_sibling     : <0xe0b>
 <2><dd6>: Abbrev Number: 19 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0xd75e4): ClockSource
    <ddb>   DW_AT_decl_file   : 13
    <ddc>   DW_AT_decl_line   : 201
    <ddd>   DW_AT_decl_column : 12
    <dde>   DW_AT_type        : <0x315>
    <de2>   DW_AT_data_member_location: 0
 <2><de3>: Abbrev Number: 19 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x75221): ClockPolarity
    <de8>   DW_AT_decl_file   : 13
    <de9>   DW_AT_decl_line   : 203
    <dea>   DW_AT_decl_column : 12
    <deb>   DW_AT_type        : <0x315>
    <def>   DW_AT_data_member_location: 4
 <2><df0>: Abbrev Number: 19 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xbb5d4): ClockPrescaler
    <df5>   DW_AT_decl_file   : 13
    <df6>   DW_AT_decl_line   : 205
    <df7>   DW_AT_decl_column : 12
    <df8>   DW_AT_type        : <0x315>
    <dfc>   DW_AT_data_member_location: 8
 <2><dfd>: Abbrev Number: 19 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x89081): ClockFilter
    <e02>   DW_AT_decl_file   : 13
    <e03>   DW_AT_decl_line   : 207
    <e04>   DW_AT_decl_column : 12
    <e05>   DW_AT_type        : <0x315>
    <e09>   DW_AT_data_member_location: 12
 <2><e0a>: Abbrev Number: 0
 <1><e0b>: Abbrev Number: 6 (DW_TAG_typedef)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x6d01): TIM_ClockConfigTypeDef
    <e10>   DW_AT_decl_file   : 13
    <e11>   DW_AT_decl_line   : 209
    <e12>   DW_AT_decl_column : 3
    <e13>   DW_AT_type        : <0xdcd>
 <1><e17>: Abbrev Number: 18 (DW_TAG_structure_type)
    <e18>   DW_AT_byte_size   : 8
    <e19>   DW_AT_decl_file   : 13
    <e1a>   DW_AT_decl_line   : 232
    <e1b>   DW_AT_decl_column : 9
    <e1c>   DW_AT_sibling     : <0xe3b>
 <2><e20>: Abbrev Number: 19 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0x7d27d): MasterOutputTrigger
    <e25>   DW_AT_decl_file   : 13
    <e26>   DW_AT_decl_line   : 234
    <e27>   DW_AT_decl_column : 13
    <e28>   DW_AT_type        : <0x315>
    <e2c>   DW_AT_data_member_location: 0
 <2><e2d>: Abbrev Number: 19 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x6f751): MasterSlaveMode
    <e32>   DW_AT_decl_file   : 13
    <e33>   DW_AT_decl_line   : 236
    <e34>   DW_AT_decl_column : 13
    <e35>   DW_AT_type        : <0x315>
    <e39>   DW_AT_data_member_location: 4
 <2><e3a>: Abbrev Number: 0
 <1><e3b>: Abbrev Number: 6 (DW_TAG_typedef)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x9a229): TIM_MasterConfigTypeDef
    <e40>   DW_AT_decl_file   : 13
    <e41>   DW_AT_decl_line   : 243
    <e42>   DW_AT_decl_column : 3
    <e43>   DW_AT_type        : <0xe17>
 <1><e47>: Abbrev Number: 14 (DW_TAG_structure_type)
    <e48>   DW_AT_byte_size   : 32
    <e49>   DW_AT_decl_file   : 13
    <e4a>   DW_AT_decl_line   : 268
    <e4c>   DW_AT_decl_column : 9
    <e4d>   DW_AT_sibling     : <0xec2>
 <2><e51>: Abbrev Number: 16 (DW_TAG_member)
    <e52>   DW_AT_name        : (indirect string, offset: 0xdb9a): OffStateRunMode
    <e56>   DW_AT_decl_file   : 13
    <e57>   DW_AT_decl_line   : 270
    <e59>   DW_AT_decl_column : 12
    <e5a>   DW_AT_type        : <0x315>
    <e5e>   DW_AT_data_member_location: 0
 <2><e5f>: Abbrev Number: 16 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0xa0413): OffStateIDLEMode
    <e64>   DW_AT_decl_file   : 13
    <e65>   DW_AT_decl_line   : 272
    <e67>   DW_AT_decl_column : 12
    <e68>   DW_AT_type        : <0x315>
    <e6c>   DW_AT_data_member_location: 4
 <2><e6d>: Abbrev Number: 16 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x6b3f3): LockLevel
    <e72>   DW_AT_decl_file   : 13
    <e73>   DW_AT_decl_line   : 274
    <e75>   DW_AT_decl_column : 12
    <e76>   DW_AT_type        : <0x315>
    <e7a>   DW_AT_data_member_location: 8
 <2><e7b>: Abbrev Number: 16 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xd8521): DeadTime
    <e80>   DW_AT_decl_file   : 13
    <e81>   DW_AT_decl_line   : 276
    <e83>   DW_AT_decl_column : 12
    <e84>   DW_AT_type        : <0x315>
    <e88>   DW_AT_data_member_location: 12
 <2><e89>: Abbrev Number: 16 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x75ad2): BreakState
    <e8e>   DW_AT_decl_file   : 13
    <e8f>   DW_AT_decl_line   : 278
    <e91>   DW_AT_decl_column : 12
    <e92>   DW_AT_type        : <0x315>
    <e96>   DW_AT_data_member_location: 16
 <2><e97>: Abbrev Number: 16 (DW_TAG_member)
    <e98>   DW_AT_name        : (indirect string, offset: 0xb0cea): BreakPolarity
    <e9c>   DW_AT_decl_file   : 13
    <e9d>   DW_AT_decl_line   : 280
    <e9f>   DW_AT_decl_column : 12
    <ea0>   DW_AT_type        : <0x315>
    <ea4>   DW_AT_data_member_location: 20
 <2><ea5>: Abbrev Number: 16 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x9b8c6): BreakFilter
    <eaa>   DW_AT_decl_file   : 13
    <eab>   DW_AT_decl_line   : 282
    <ead>   DW_AT_decl_column : 12
    <eae>   DW_AT_type        : <0x315>
    <eb2>   DW_AT_data_member_location: 24
 <2><eb3>: Abbrev Number: 16 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xbc33e): AutomaticOutput
    <eb8>   DW_AT_decl_file   : 13
    <eb9>   DW_AT_decl_line   : 284
    <ebb>   DW_AT_decl_column : 12
    <ebc>   DW_AT_type        : <0x315>
    <ec0>   DW_AT_data_member_location: 28
 <2><ec1>: Abbrev Number: 0
 <1><ec2>: Abbrev Number: 17 (DW_TAG_typedef)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x3100b): TIM_BreakDeadTimeConfigTypeDef
    <ec7>   DW_AT_decl_file   : 13
    <ec8>   DW_AT_decl_line   : 286
    <eca>   DW_AT_decl_column : 3
    <ecb>   DW_AT_type        : <0xe47>
 <1><ecf>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <ed0>   DW_AT_encoding    : 7	(unsigned)
    <ed1>   DW_AT_byte_size   : 1
    <ed2>   DW_AT_type        : <0x27f>
    <ed6>   DW_AT_decl_file   : 13
    <ed7>   DW_AT_decl_line   : 292
    <ed9>   DW_AT_decl_column : 1
    <eda>   DW_AT_sibling     : <0xefd>
 <2><ede>: Abbrev Number: 4 (DW_TAG_enumerator)
    <edf>   DW_AT_name        : (indirect string, offset: 0xb8a51): HAL_TIM_STATE_RESET
    <ee3>   DW_AT_const_value : 0
 <2><ee4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x7931): HAL_TIM_STATE_READY
    <ee9>   DW_AT_const_value : 1
 <2><eea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x35e93): HAL_TIM_STATE_BUSY
    <eef>   DW_AT_const_value : 2
 <2><ef0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xb18df): HAL_TIM_STATE_TIMEOUT
    <ef5>   DW_AT_const_value : 3
 <2><ef6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x83123): HAL_TIM_STATE_ERROR
    <efb>   DW_AT_const_value : 4
 <2><efc>: Abbrev Number: 0
 <1><efd>: Abbrev Number: 17 (DW_TAG_typedef)
    <efe>   DW_AT_name        : (indirect string, offset: 0x8b9f7): HAL_TIM_StateTypeDef
    <f02>   DW_AT_decl_file   : 13
    <f03>   DW_AT_decl_line   : 298
    <f05>   DW_AT_decl_column : 3
    <f06>   DW_AT_type        : <0xecf>
 <1><f0a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <f0b>   DW_AT_type        : <0xefd>
 <1><f0f>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <f10>   DW_AT_encoding    : 7	(unsigned)
    <f11>   DW_AT_byte_size   : 1
    <f12>   DW_AT_type        : <0x27f>
    <f16>   DW_AT_decl_file   : 13
    <f17>   DW_AT_decl_line   : 304
    <f19>   DW_AT_decl_column : 1
    <f1a>   DW_AT_sibling     : <0xf31>
 <2><f1e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xbe3e): HAL_TIM_CHANNEL_STATE_RESET
    <f23>   DW_AT_const_value : 0
 <2><f24>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x7cbac): HAL_TIM_CHANNEL_STATE_READY
    <f29>   DW_AT_const_value : 1
 <2><f2a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x65f54): HAL_TIM_CHANNEL_STATE_BUSY
    <f2f>   DW_AT_const_value : 2
 <2><f30>: Abbrev Number: 0
 <1><f31>: Abbrev Number: 17 (DW_TAG_typedef)
    <f32>   DW_AT_name        : (indirect string, offset: 0x2d0b7): HAL_TIM_ChannelStateTypeDef
    <f36>   DW_AT_decl_file   : 13
    <f37>   DW_AT_decl_line   : 308
    <f39>   DW_AT_decl_column : 3
    <f3a>   DW_AT_type        : <0xf0f>
 <1><f3e>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <f3f>   DW_AT_type        : <0xf31>
 <1><f43>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <f44>   DW_AT_encoding    : 7	(unsigned)
    <f45>   DW_AT_byte_size   : 1
    <f46>   DW_AT_type        : <0x27f>
    <f4a>   DW_AT_decl_file   : 13
    <f4b>   DW_AT_decl_line   : 314
    <f4d>   DW_AT_decl_column : 1
    <f4e>   DW_AT_sibling     : <0xf65>
 <2><f52>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f53>   DW_AT_name        : (indirect string, offset: 0x450f): HAL_DMA_BURST_STATE_RESET
    <f57>   DW_AT_const_value : 0
 <2><f58>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f59>   DW_AT_name        : (indirect string, offset: 0x74e67): HAL_DMA_BURST_STATE_READY
    <f5d>   DW_AT_const_value : 1
 <2><f5e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x47e2c): HAL_DMA_BURST_STATE_BUSY
    <f63>   DW_AT_const_value : 2
 <2><f64>: Abbrev Number: 0
 <1><f65>: Abbrev Number: 17 (DW_TAG_typedef)
    <f66>   DW_AT_name        : (indirect string, offset: 0xc27ce): HAL_TIM_DMABurstStateTypeDef
    <f6a>   DW_AT_decl_file   : 13
    <f6b>   DW_AT_decl_line   : 318
    <f6d>   DW_AT_decl_column : 3
    <f6e>   DW_AT_type        : <0xf43>
 <1><f72>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <f73>   DW_AT_type        : <0xf65>
 <1><f77>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <f78>   DW_AT_encoding    : 7	(unsigned)
    <f79>   DW_AT_byte_size   : 1
    <f7a>   DW_AT_type        : <0x27f>
    <f7e>   DW_AT_decl_file   : 13
    <f7f>   DW_AT_decl_line   : 324
    <f81>   DW_AT_decl_column : 1
    <f82>   DW_AT_sibling     : <0xfa5>
 <2><f86>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f87>   DW_AT_name        : (indirect string, offset: 0x771ee): HAL_TIM_ACTIVE_CHANNEL_1
    <f8b>   DW_AT_const_value : 1
 <2><f8c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x77207): HAL_TIM_ACTIVE_CHANNEL_2
    <f91>   DW_AT_const_value : 2
 <2><f92>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f93>   DW_AT_name        : (indirect string, offset: 0x77220): HAL_TIM_ACTIVE_CHANNEL_3
    <f97>   DW_AT_const_value : 4
 <2><f98>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f99>   DW_AT_name        : (indirect string, offset: 0x77239): HAL_TIM_ACTIVE_CHANNEL_4
    <f9d>   DW_AT_const_value : 8
 <2><f9e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x5732b): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <fa3>   DW_AT_const_value : 0
 <2><fa4>: Abbrev Number: 0
 <1><fa5>: Abbrev Number: 17 (DW_TAG_typedef)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x6e2a8): HAL_TIM_ActiveChannel
    <faa>   DW_AT_decl_file   : 13
    <fab>   DW_AT_decl_line   : 330
    <fad>   DW_AT_decl_column : 3
    <fae>   DW_AT_type        : <0xf77>
 <1><fb2>: Abbrev Number: 28 (DW_TAG_structure_type)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x485e3): __TIM_HandleTypeDef
    <fb7>   DW_AT_byte_size   : 180
    <fb8>   DW_AT_decl_file   : 13
    <fb9>   DW_AT_decl_line   : 336
    <fbb>   DW_AT_decl_column : 16
    <fbc>   DW_AT_sibling     : <0x11b9>
 <2><fc0>: Abbrev Number: 16 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0xcd032): Instance
    <fc5>   DW_AT_decl_file   : 13
    <fc6>   DW_AT_decl_line   : 341
    <fc8>   DW_AT_decl_column : 39
    <fc9>   DW_AT_type        : <0x11b9>
    <fcd>   DW_AT_data_member_location: 0
 <2><fce>: Abbrev Number: 16 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xd71f9): Init
    <fd3>   DW_AT_decl_file   : 13
    <fd4>   DW_AT_decl_line   : 342
    <fd6>   DW_AT_decl_column : 38
    <fd7>   DW_AT_type        : <0xcc5>
    <fdb>   DW_AT_data_member_location: 4
 <2><fdc>: Abbrev Number: 16 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x6e2b6): Channel
    <fe1>   DW_AT_decl_file   : 13
    <fe2>   DW_AT_decl_line   : 343
    <fe4>   DW_AT_decl_column : 38
    <fe5>   DW_AT_type        : <0xfa5>
    <fe9>   DW_AT_data_member_location: 28
 <2><fea>: Abbrev Number: 16 (DW_TAG_member)
    <feb>   DW_AT_name        : (indirect string, offset: 0x7f579): hdma
    <fef>   DW_AT_decl_file   : 13
    <ff0>   DW_AT_decl_line   : 344
    <ff2>   DW_AT_decl_column : 39
    <ff3>   DW_AT_type        : <0x11bf>
    <ff7>   DW_AT_data_member_location: 32
 <2><ff8>: Abbrev Number: 16 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x97d68): Lock
    <ffd>   DW_AT_decl_file   : 13
    <ffe>   DW_AT_decl_line   : 346
    <1000>   DW_AT_decl_column : 38
    <1001>   DW_AT_type        : <0x8ca>
    <1005>   DW_AT_data_member_location: 60
 <2><1006>: Abbrev Number: 16 (DW_TAG_member)
    <1007>   DW_AT_name        : (indirect string, offset: 0x9048b): State
    <100b>   DW_AT_decl_file   : 13
    <100c>   DW_AT_decl_line   : 347
    <100e>   DW_AT_decl_column : 38
    <100f>   DW_AT_type        : <0xf0a>
    <1013>   DW_AT_data_member_location: 61
 <2><1014>: Abbrev Number: 16 (DW_TAG_member)
    <1015>   DW_AT_name        : (indirect string, offset: 0xd818a): ChannelState
    <1019>   DW_AT_decl_file   : 13
    <101a>   DW_AT_decl_line   : 348
    <101c>   DW_AT_decl_column : 38
    <101d>   DW_AT_type        : <0x11e5>
    <1021>   DW_AT_data_member_location: 62
 <2><1022>: Abbrev Number: 16 (DW_TAG_member)
    <1023>   DW_AT_name        : (indirect string, offset: 0xd86e3): ChannelNState
    <1027>   DW_AT_decl_file   : 13
    <1028>   DW_AT_decl_line   : 349
    <102a>   DW_AT_decl_column : 38
    <102b>   DW_AT_type        : <0x11e5>
    <102f>   DW_AT_data_member_location: 66
 <2><1030>: Abbrev Number: 16 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0xd7c7d): DMABurstState
    <1035>   DW_AT_decl_file   : 13
    <1036>   DW_AT_decl_line   : 350
    <1038>   DW_AT_decl_column : 38
    <1039>   DW_AT_type        : <0xf72>
    <103d>   DW_AT_data_member_location: 70
 <2><103e>: Abbrev Number: 16 (DW_TAG_member)
    <103f>   DW_AT_name        : (indirect string, offset: 0xcc56f): Base_MspInitCallback
    <1043>   DW_AT_decl_file   : 13
    <1044>   DW_AT_decl_line   : 353
    <1046>   DW_AT_decl_column : 11
    <1047>   DW_AT_type        : <0x11fb>
    <104b>   DW_AT_data_member_location: 72
 <2><104c>: Abbrev Number: 16 (DW_TAG_member)
    <104d>   DW_AT_name        : (indirect string, offset: 0x77b94): Base_MspDeInitCallback
    <1051>   DW_AT_decl_file   : 13
    <1052>   DW_AT_decl_line   : 354
    <1054>   DW_AT_decl_column : 11
    <1055>   DW_AT_type        : <0x11fb>
    <1059>   DW_AT_data_member_location: 76
 <2><105a>: Abbrev Number: 16 (DW_TAG_member)
    <105b>   DW_AT_name        : (indirect string, offset: 0x71616): IC_MspInitCallback
    <105f>   DW_AT_decl_file   : 13
    <1060>   DW_AT_decl_line   : 355
    <1062>   DW_AT_decl_column : 11
    <1063>   DW_AT_type        : <0x11fb>
    <1067>   DW_AT_data_member_location: 80
 <2><1068>: Abbrev Number: 16 (DW_TAG_member)
    <1069>   DW_AT_name        : (indirect string, offset: 0xa5b24): IC_MspDeInitCallback
    <106d>   DW_AT_decl_file   : 13
    <106e>   DW_AT_decl_line   : 356
    <1070>   DW_AT_decl_column : 11
    <1071>   DW_AT_type        : <0x11fb>
    <1075>   DW_AT_data_member_location: 84
 <2><1076>: Abbrev Number: 16 (DW_TAG_member)
    <1077>   DW_AT_name        : (indirect string, offset: 0x624f3): OC_MspInitCallback
    <107b>   DW_AT_decl_file   : 13
    <107c>   DW_AT_decl_line   : 357
    <107e>   DW_AT_decl_column : 11
    <107f>   DW_AT_type        : <0x11fb>
    <1083>   DW_AT_data_member_location: 88
 <2><1084>: Abbrev Number: 16 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0x77887): OC_MspDeInitCallback
    <1089>   DW_AT_decl_file   : 13
    <108a>   DW_AT_decl_line   : 358
    <108c>   DW_AT_decl_column : 11
    <108d>   DW_AT_type        : <0x11fb>
    <1091>   DW_AT_data_member_location: 92
 <2><1092>: Abbrev Number: 16 (DW_TAG_member)
    <1093>   DW_AT_name        : (indirect string, offset: 0x3d19): PWM_MspInitCallback
    <1097>   DW_AT_decl_file   : 13
    <1098>   DW_AT_decl_line   : 359
    <109a>   DW_AT_decl_column : 11
    <109b>   DW_AT_type        : <0x11fb>
    <109f>   DW_AT_data_member_location: 96
 <2><10a0>: Abbrev Number: 16 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x9b48c): PWM_MspDeInitCallback
    <10a5>   DW_AT_decl_file   : 13
    <10a6>   DW_AT_decl_line   : 360
    <10a8>   DW_AT_decl_column : 11
    <10a9>   DW_AT_type        : <0x11fb>
    <10ad>   DW_AT_data_member_location: 100
 <2><10ae>: Abbrev Number: 16 (DW_TAG_member)
    <10af>   DW_AT_name        : (indirect string, offset: 0x8af9b): OnePulse_MspInitCallback
    <10b3>   DW_AT_decl_file   : 13
    <10b4>   DW_AT_decl_line   : 361
    <10b6>   DW_AT_decl_column : 11
    <10b7>   DW_AT_type        : <0x11fb>
    <10bb>   DW_AT_data_member_location: 104
 <2><10bc>: Abbrev Number: 16 (DW_TAG_member)
    <10bd>   DW_AT_name        : (indirect string, offset: 0x815c2): OnePulse_MspDeInitCallback
    <10c1>   DW_AT_decl_file   : 13
    <10c2>   DW_AT_decl_line   : 362
    <10c4>   DW_AT_decl_column : 11
    <10c5>   DW_AT_type        : <0x11fb>
    <10c9>   DW_AT_data_member_location: 108
 <2><10ca>: Abbrev Number: 16 (DW_TAG_member)
    <10cb>   DW_AT_name        : (indirect string, offset: 0xd379c): Encoder_MspInitCallback
    <10cf>   DW_AT_decl_file   : 13
    <10d0>   DW_AT_decl_line   : 363
    <10d2>   DW_AT_decl_column : 11
    <10d3>   DW_AT_type        : <0x11fb>
    <10d7>   DW_AT_data_member_location: 112
 <2><10d8>: Abbrev Number: 16 (DW_TAG_member)
    <10d9>   DW_AT_name        : (indirect string, offset: 0x875a): Encoder_MspDeInitCallback
    <10dd>   DW_AT_decl_file   : 13
    <10de>   DW_AT_decl_line   : 364
    <10e0>   DW_AT_decl_column : 11
    <10e1>   DW_AT_type        : <0x11fb>
    <10e5>   DW_AT_data_member_location: 116
 <2><10e6>: Abbrev Number: 16 (DW_TAG_member)
    <10e7>   DW_AT_name        : (indirect string, offset: 0x976e2): HallSensor_MspInitCallback
    <10eb>   DW_AT_decl_file   : 13
    <10ec>   DW_AT_decl_line   : 365
    <10ee>   DW_AT_decl_column : 11
    <10ef>   DW_AT_type        : <0x11fb>
    <10f3>   DW_AT_data_member_location: 120
 <2><10f4>: Abbrev Number: 16 (DW_TAG_member)
    <10f5>   DW_AT_name        : (indirect string, offset: 0x9158f): HallSensor_MspDeInitCallback
    <10f9>   DW_AT_decl_file   : 13
    <10fa>   DW_AT_decl_line   : 366
    <10fc>   DW_AT_decl_column : 11
    <10fd>   DW_AT_type        : <0x11fb>
    <1101>   DW_AT_data_member_location: 124
 <2><1102>: Abbrev Number: 16 (DW_TAG_member)
    <1103>   DW_AT_name        : (indirect string, offset: 0xd5353): PeriodElapsedCallback
    <1107>   DW_AT_decl_file   : 13
    <1108>   DW_AT_decl_line   : 367
    <110a>   DW_AT_decl_column : 11
    <110b>   DW_AT_type        : <0x11fb>
    <110f>   DW_AT_data_member_location: 128
 <2><1110>: Abbrev Number: 16 (DW_TAG_member)
    <1111>   DW_AT_name        : (indirect string, offset: 0xd76e3): PeriodElapsedHalfCpltCallback
    <1115>   DW_AT_decl_file   : 13
    <1116>   DW_AT_decl_line   : 368
    <1118>   DW_AT_decl_column : 11
    <1119>   DW_AT_type        : <0x11fb>
    <111d>   DW_AT_data_member_location: 132
 <2><111e>: Abbrev Number: 16 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0xd7f4e): TriggerCallback
    <1123>   DW_AT_decl_file   : 13
    <1124>   DW_AT_decl_line   : 369
    <1126>   DW_AT_decl_column : 11
    <1127>   DW_AT_type        : <0x11fb>
    <112b>   DW_AT_data_member_location: 136
 <2><112c>: Abbrev Number: 16 (DW_TAG_member)
    <112d>   DW_AT_name        : (indirect string, offset: 0xd7dbf): TriggerHalfCpltCallback
    <1131>   DW_AT_decl_file   : 13
    <1132>   DW_AT_decl_line   : 370
    <1134>   DW_AT_decl_column : 11
    <1135>   DW_AT_type        : <0x11fb>
    <1139>   DW_AT_data_member_location: 140
 <2><113a>: Abbrev Number: 16 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0xd740f): IC_CaptureCallback
    <113f>   DW_AT_decl_file   : 13
    <1140>   DW_AT_decl_line   : 371
    <1142>   DW_AT_decl_column : 11
    <1143>   DW_AT_type        : <0x11fb>
    <1147>   DW_AT_data_member_location: 144
 <2><1148>: Abbrev Number: 16 (DW_TAG_member)
    <1149>   DW_AT_name        : (indirect string, offset: 0xd74e6): IC_CaptureHalfCpltCallback
    <114d>   DW_AT_decl_file   : 13
    <114e>   DW_AT_decl_line   : 372
    <1150>   DW_AT_decl_column : 11
    <1151>   DW_AT_type        : <0x11fb>
    <1155>   DW_AT_data_member_location: 148
 <2><1156>: Abbrev Number: 16 (DW_TAG_member)
    <1157>   DW_AT_name        : (indirect string, offset: 0xd7d74): OC_DelayElapsedCallback
    <115b>   DW_AT_decl_file   : 13
    <115c>   DW_AT_decl_line   : 373
    <115e>   DW_AT_decl_column : 11
    <115f>   DW_AT_type        : <0x11fb>
    <1163>   DW_AT_data_member_location: 152
 <2><1164>: Abbrev Number: 16 (DW_TAG_member)
    <1165>   DW_AT_name        : (indirect string, offset: 0xd7fc5): PWM_PulseFinishedCallback
    <1169>   DW_AT_decl_file   : 13
    <116a>   DW_AT_decl_line   : 374
    <116c>   DW_AT_decl_column : 11
    <116d>   DW_AT_type        : <0x11fb>
    <1171>   DW_AT_data_member_location: 156
 <2><1172>: Abbrev Number: 16 (DW_TAG_member)
    <1173>   DW_AT_name        : (indirect string, offset: 0xd771d): PWM_PulseFinishedHalfCpltCallback
    <1177>   DW_AT_decl_file   : 13
    <1178>   DW_AT_decl_line   : 375
    <117a>   DW_AT_decl_column : 11
    <117b>   DW_AT_type        : <0x11fb>
    <117f>   DW_AT_data_member_location: 160
 <2><1180>: Abbrev Number: 16 (DW_TAG_member)
    <1181>   DW_AT_name        : (indirect string, offset: 0xd5273): ErrorCallback
    <1185>   DW_AT_decl_file   : 13
    <1186>   DW_AT_decl_line   : 376
    <1188>   DW_AT_decl_column : 11
    <1189>   DW_AT_type        : <0x11fb>
    <118d>   DW_AT_data_member_location: 164
 <2><118e>: Abbrev Number: 16 (DW_TAG_member)
    <118f>   DW_AT_name        : (indirect string, offset: 0xc3e29): CommutationCallback
    <1193>   DW_AT_decl_file   : 13
    <1194>   DW_AT_decl_line   : 377
    <1196>   DW_AT_decl_column : 11
    <1197>   DW_AT_type        : <0x11fb>
    <119b>   DW_AT_data_member_location: 168
 <2><119c>: Abbrev Number: 16 (DW_TAG_member)
    <119d>   DW_AT_name        : (indirect string, offset: 0x7214): CommutationHalfCpltCallback
    <11a1>   DW_AT_decl_file   : 13
    <11a2>   DW_AT_decl_line   : 378
    <11a4>   DW_AT_decl_column : 11
    <11a5>   DW_AT_type        : <0x11fb>
    <11a9>   DW_AT_data_member_location: 172
 <2><11aa>: Abbrev Number: 16 (DW_TAG_member)
    <11ab>   DW_AT_name        : (indirect string, offset: 0xd8772): BreakCallback
    <11af>   DW_AT_decl_file   : 13
    <11b0>   DW_AT_decl_line   : 379
    <11b2>   DW_AT_decl_column : 11
    <11b3>   DW_AT_type        : <0x11fb>
    <11b7>   DW_AT_data_member_location: 176
 <2><11b8>: Abbrev Number: 0
 <1><11b9>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <11ba>   DW_AT_byte_size   : 4
    <11bb>   DW_AT_type        : <0x7fc>
 <1><11bf>: Abbrev Number: 10 (DW_TAG_array_type)
    <11c0>   DW_AT_type        : <0x11cf>
    <11c4>   DW_AT_sibling     : <0x11cf>
 <2><11c8>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <11c9>   DW_AT_type        : <0x2db>
    <11cd>   DW_AT_upper_bound : 6
 <2><11ce>: Abbrev Number: 0
 <1><11cf>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <11d0>   DW_AT_byte_size   : 4
    <11d1>   DW_AT_type        : <0xc61>
 <1><11d5>: Abbrev Number: 10 (DW_TAG_array_type)
    <11d6>   DW_AT_type        : <0xf3e>
    <11da>   DW_AT_sibling     : <0x11e5>
 <2><11de>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <11df>   DW_AT_type        : <0x2db>
    <11e3>   DW_AT_upper_bound : 3
 <2><11e4>: Abbrev Number: 0
 <1><11e5>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <11e6>   DW_AT_type        : <0x11d5>
 <1><11ea>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <11eb>   DW_AT_prototyped  : 1
    <11eb>   DW_AT_sibling     : <0x11f5>
 <2><11ef>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <11f0>   DW_AT_type        : <0x11f5>
 <2><11f4>: Abbrev Number: 0
 <1><11f5>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <11f6>   DW_AT_byte_size   : 4
    <11f7>   DW_AT_type        : <0xfb2>
 <1><11fb>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <11fc>   DW_AT_byte_size   : 4
    <11fd>   DW_AT_type        : <0x11ea>
 <1><1201>: Abbrev Number: 17 (DW_TAG_typedef)
    <1202>   DW_AT_name        : (indirect string, offset: 0x485e5): TIM_HandleTypeDef
    <1206>   DW_AT_decl_file   : 13
    <1207>   DW_AT_decl_line   : 381
    <1209>   DW_AT_decl_column : 3
    <120a>   DW_AT_type        : <0xfb2>
 <1><120e>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <120f>   DW_AT_byte_size   : 4
    <1210>   DW_AT_type        : <0x1201>
 <1><1214>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1215>   DW_AT_byte_size   : 28
    <1216>   DW_AT_decl_file   : 14
    <1217>   DW_AT_decl_line   : 47
    <1218>   DW_AT_decl_column : 9
    <1219>   DW_AT_sibling     : <0x1279>
 <2><121d>: Abbrev Number: 19 (DW_TAG_member)
    <121e>   DW_AT_name        : (indirect string, offset: 0xc2233): BaudRate
    <1222>   DW_AT_decl_file   : 14
    <1223>   DW_AT_decl_line   : 49
    <1224>   DW_AT_decl_column : 12
    <1225>   DW_AT_type        : <0x315>
    <1229>   DW_AT_data_member_location: 0
 <2><122a>: Abbrev Number: 19 (DW_TAG_member)
    <122b>   DW_AT_name        : (indirect string, offset: 0x61d5): WordLength
    <122f>   DW_AT_decl_file   : 14
    <1230>   DW_AT_decl_line   : 55
    <1231>   DW_AT_decl_column : 12
    <1232>   DW_AT_type        : <0x315>
    <1236>   DW_AT_data_member_location: 4
 <2><1237>: Abbrev Number: 19 (DW_TAG_member)
    <1238>   DW_AT_name        : (indirect string, offset: 0xc2616): StopBits
    <123c>   DW_AT_decl_file   : 14
    <123d>   DW_AT_decl_line   : 58
    <123e>   DW_AT_decl_column : 12
    <123f>   DW_AT_type        : <0x315>
    <1243>   DW_AT_data_member_location: 8
 <2><1244>: Abbrev Number: 19 (DW_TAG_member)
    <1245>   DW_AT_name        : (indirect string, offset: 0x3d135): Parity
    <1249>   DW_AT_decl_file   : 14
    <124a>   DW_AT_decl_line   : 61
    <124b>   DW_AT_decl_column : 12
    <124c>   DW_AT_type        : <0x315>
    <1250>   DW_AT_data_member_location: 12
 <2><1251>: Abbrev Number: 19 (DW_TAG_member)
    <1252>   DW_AT_name        : (indirect string, offset: 0x5c21a): Mode
    <1256>   DW_AT_decl_file   : 14
    <1257>   DW_AT_decl_line   : 68
    <1258>   DW_AT_decl_column : 12
    <1259>   DW_AT_type        : <0x315>
    <125d>   DW_AT_data_member_location: 16
 <2><125e>: Abbrev Number: 19 (DW_TAG_member)
    <125f>   DW_AT_name        : (indirect string, offset: 0x1950f): HwFlowCtl
    <1263>   DW_AT_decl_file   : 14
    <1264>   DW_AT_decl_line   : 71
    <1265>   DW_AT_decl_column : 12
    <1266>   DW_AT_type        : <0x315>
    <126a>   DW_AT_data_member_location: 20
 <2><126b>: Abbrev Number: 19 (DW_TAG_member)
    <126c>   DW_AT_name        : (indirect string, offset: 0xb22d6): OverSampling
    <1270>   DW_AT_decl_file   : 14
    <1271>   DW_AT_decl_line   : 74
    <1272>   DW_AT_decl_column : 12
    <1273>   DW_AT_type        : <0x315>
    <1277>   DW_AT_data_member_location: 24
 <2><1278>: Abbrev Number: 0
 <1><1279>: Abbrev Number: 6 (DW_TAG_typedef)
    <127a>   DW_AT_name        : (indirect string, offset: 0x3bfe1): UART_InitTypeDef
    <127e>   DW_AT_decl_file   : 14
    <127f>   DW_AT_decl_line   : 76
    <1280>   DW_AT_decl_column : 3
    <1281>   DW_AT_type        : <0x1214>
 <1><1285>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1286>   DW_AT_encoding    : 7	(unsigned)
    <1287>   DW_AT_byte_size   : 1
    <1288>   DW_AT_type        : <0x27f>
    <128c>   DW_AT_decl_file   : 14
    <128d>   DW_AT_decl_line   : 118
    <128e>   DW_AT_decl_column : 1
    <128f>   DW_AT_sibling     : <0x12c4>
 <2><1293>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1294>   DW_AT_name        : (indirect string, offset: 0x37f30): HAL_UART_STATE_RESET
    <1298>   DW_AT_const_value : 0
 <2><1299>: Abbrev Number: 4 (DW_TAG_enumerator)
    <129a>   DW_AT_name        : (indirect string, offset: 0x18a88): HAL_UART_STATE_READY
    <129e>   DW_AT_const_value : 32
 <2><129f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12a0>   DW_AT_name        : (indirect string, offset: 0xbc1f8): HAL_UART_STATE_BUSY
    <12a4>   DW_AT_const_value : 36
 <2><12a5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12a6>   DW_AT_name        : (indirect string, offset: 0x2974): HAL_UART_STATE_BUSY_TX
    <12aa>   DW_AT_const_value : 33
 <2><12ab>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12ac>   DW_AT_name        : (indirect string, offset: 0x1c8b): HAL_UART_STATE_BUSY_RX
    <12b0>   DW_AT_const_value : 34
 <2><12b1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12b2>   DW_AT_name        : (indirect string, offset: 0x3017b): HAL_UART_STATE_BUSY_TX_RX
    <12b6>   DW_AT_const_value : 35
 <2><12b7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12b8>   DW_AT_name        : (indirect string, offset: 0x66b90): HAL_UART_STATE_TIMEOUT
    <12bc>   DW_AT_const_value : 160
 <2><12bd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12be>   DW_AT_name        : (indirect string, offset: 0x93ea1): HAL_UART_STATE_ERROR
    <12c2>   DW_AT_const_value : 224
 <2><12c3>: Abbrev Number: 0
 <1><12c4>: Abbrev Number: 6 (DW_TAG_typedef)
    <12c5>   DW_AT_name        : (indirect string, offset: 0x4137e): HAL_UART_StateTypeDef
    <12c9>   DW_AT_decl_file   : 14
    <12ca>   DW_AT_decl_line   : 136
    <12cb>   DW_AT_decl_column : 3
    <12cc>   DW_AT_type        : <0x1285>
 <1><12d0>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <12d1>   DW_AT_type        : <0x12c4>
 <1><12d5>: Abbrev Number: 6 (DW_TAG_typedef)
    <12d6>   DW_AT_name        : (indirect string, offset: 0x56b07): HAL_UART_RxTypeTypeDef
    <12da>   DW_AT_decl_file   : 14
    <12db>   DW_AT_decl_line   : 145
    <12dc>   DW_AT_decl_column : 18
    <12dd>   DW_AT_type        : <0x315>
 <1><12e1>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <12e2>   DW_AT_type        : <0x12d5>
 <1><12e6>: Abbrev Number: 23 (DW_TAG_structure_type)
    <12e7>   DW_AT_name        : (indirect string, offset: 0x7abeb): __UART_HandleTypeDef
    <12eb>   DW_AT_byte_size   : 116
    <12ec>   DW_AT_decl_file   : 14
    <12ed>   DW_AT_decl_line   : 150
    <12ee>   DW_AT_decl_column : 16
    <12ef>   DW_AT_sibling     : <0x1453>
 <2><12f3>: Abbrev Number: 19 (DW_TAG_member)
    <12f4>   DW_AT_name        : (indirect string, offset: 0xcd032): Instance
    <12f8>   DW_AT_decl_file   : 14
    <12f9>   DW_AT_decl_line   : 152
    <12fa>   DW_AT_decl_column : 34
    <12fb>   DW_AT_type        : <0x1453>
    <12ff>   DW_AT_data_member_location: 0
 <2><1300>: Abbrev Number: 19 (DW_TAG_member)
    <1301>   DW_AT_name        : (indirect string, offset: 0xd71f9): Init
    <1305>   DW_AT_decl_file   : 14
    <1306>   DW_AT_decl_line   : 154
    <1307>   DW_AT_decl_column : 33
    <1308>   DW_AT_type        : <0x1279>
    <130c>   DW_AT_data_member_location: 4
 <2><130d>: Abbrev Number: 19 (DW_TAG_member)
    <130e>   DW_AT_name        : (indirect string, offset: 0x653fe): pTxBuffPtr
    <1312>   DW_AT_decl_file   : 14
    <1313>   DW_AT_decl_line   : 156
    <1314>   DW_AT_decl_column : 34
    <1315>   DW_AT_type        : <0x1459>
    <1319>   DW_AT_data_member_location: 32
 <2><131a>: Abbrev Number: 19 (DW_TAG_member)
    <131b>   DW_AT_name        : (indirect string, offset: 0x59256): TxXferSize
    <131f>   DW_AT_decl_file   : 14
    <1320>   DW_AT_decl_line   : 158
    <1321>   DW_AT_decl_column : 33
    <1322>   DW_AT_type        : <0x2f3>
    <1326>   DW_AT_data_member_location: 36
 <2><1327>: Abbrev Number: 19 (DW_TAG_member)
    <1328>   DW_AT_name        : (indirect string, offset: 0x669fb): TxXferCount
    <132c>   DW_AT_decl_file   : 14
    <132d>   DW_AT_decl_line   : 160
    <132e>   DW_AT_decl_column : 33
    <132f>   DW_AT_type        : <0x2ff>
    <1333>   DW_AT_data_member_location: 38
 <2><1334>: Abbrev Number: 19 (DW_TAG_member)
    <1335>   DW_AT_name        : (indirect string, offset: 0xc5287): pRxBuffPtr
    <1339>   DW_AT_decl_file   : 14
    <133a>   DW_AT_decl_line   : 162
    <133b>   DW_AT_decl_column : 34
    <133c>   DW_AT_type        : <0x1459>
    <1340>   DW_AT_data_member_location: 40
 <2><1341>: Abbrev Number: 19 (DW_TAG_member)
