Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3239 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x2a08d): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xe40aa): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x2e6fe): /home/peppe/Desktop/Progetto_Embedded/STM32cubeIDE_Workspace/Autonomous/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x77b37): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x42162): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

    <59>   DW_AT_name        : (indirect string, offset: 0xf2473): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x902d4): __int32_t
    <62>   DW_AT_decl_file   : 3
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x1228e): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x94e05): __uint32_t
    <75>   DW_AT_decl_file   : 3
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x550a8): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x6e0bc): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x30dc8): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x1175e): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x42164): uint8_t
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0xb1014): uint16_t
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <bd>   DW_AT_type        : <0xb0>
 <1><c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x902d6): int32_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 44
    <c8>   DW_AT_decl_column : 19
    <c9>   DW_AT_type        : <0x5d>
 <1><cd>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <ce>   DW_AT_type        : <0xc1>
 <1><d2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d3>   DW_AT_name        : (indirect string, offset: 0xf1fd5): uint32_t
    <d7>   DW_AT_decl_file   : 4
    <d8>   DW_AT_decl_line   : 48
    <d9>   DW_AT_decl_column : 20
    <da>   DW_AT_type        : <0x70>
 <1><de>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <df>   DW_AT_type        : <0xd2>
 <1><e3>: Abbrev Number: 7 (DW_TAG_array_type)
    <e4>   DW_AT_type        : <0xd2>
    <e8>   DW_AT_sibling     : <0xf3>
 <2><ec>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ed>   DW_AT_type        : <0x98>
    <f1>   DW_AT_upper_bound : 1
 <2><f2>: Abbrev Number: 0
 <1><f3>: Abbrev Number: 9 (DW_TAG_variable)
    <f4>   DW_AT_name        : (indirect string, offset: 0x49ab): ITM_RxBuffer
    <f8>   DW_AT_decl_file   : 5
    <f9>   DW_AT_decl_line   : 2052
    <fb>   DW_AT_decl_column : 25
    <fc>   DW_AT_type        : <0xcd>
    <100>   DW_AT_external    : 1
    <100>   DW_AT_declaration : 1
 <1><100>: Abbrev Number: 10 (DW_TAG_variable)
    <101>   DW_AT_name        : (indirect string, offset: 0xb5d99): SystemCoreClock
    <105>   DW_AT_decl_file   : 6
    <106>   DW_AT_decl_line   : 74
    <107>   DW_AT_decl_column : 17
    <108>   DW_AT_type        : <0xd2>
    <10c>   DW_AT_external    : 1
    <10c>   DW_AT_declaration : 1
 <1><10c>: Abbrev Number: 7 (DW_TAG_array_type)
    <10d>   DW_AT_type        : <0xab>
    <111>   DW_AT_sibling     : <0x11c>
 <2><115>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <116>   DW_AT_type        : <0x98>
    <11a>   DW_AT_upper_bound : 15
 <2><11b>: Abbrev Number: 0
 <1><11c>: Abbrev Number: 5 (DW_TAG_const_type)
    <11d>   DW_AT_type        : <0x10c>
 <1><121>: Abbrev Number: 10 (DW_TAG_variable)
    <122>   DW_AT_name        : (indirect string, offset: 0xe77ba): AHBPrescTable
    <126>   DW_AT_decl_file   : 6
    <127>   DW_AT_decl_line   : 76
    <128>   DW_AT_decl_column : 23
    <129>   DW_AT_type        : <0x11c>
    <12d>   DW_AT_external    : 1
    <12d>   DW_AT_declaration : 1
 <1><12d>: Abbrev Number: 7 (DW_TAG_array_type)
    <12e>   DW_AT_type        : <0xab>
    <132>   DW_AT_sibling     : <0x13d>
 <2><136>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <137>   DW_AT_type        : <0x98>
    <13b>   DW_AT_upper_bound : 7
 <2><13c>: Abbrev Number: 0
 <1><13d>: Abbrev Number: 5 (DW_TAG_const_type)
    <13e>   DW_AT_type        : <0x12d>
 <1><142>: Abbrev Number: 10 (DW_TAG_variable)
    <143>   DW_AT_name        : (indirect string, offset: 0x95acd): APBPrescTable
    <147>   DW_AT_decl_file   : 6
    <148>   DW_AT_decl_line   : 77
    <149>   DW_AT_decl_column : 23
    <14a>   DW_AT_type        : <0x13d>
    <14e>   DW_AT_external    : 1
    <14e>   DW_AT_declaration : 1
 <1><14e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <14f>   DW_AT_byte_size   : 24
    <150>   DW_AT_decl_file   : 7
    <151>   DW_AT_decl_line   : 363
    <153>   DW_AT_decl_column : 9
    <154>   DW_AT_sibling     : <0x1ac>
 <2><158>: Abbrev Number: 12 (DW_TAG_member)
    <159>   DW_AT_name        : CR
    <15c>   DW_AT_decl_file   : 7
    <15d>   DW_AT_decl_line   : 365
    <15f>   DW_AT_decl_column : 17
    <160>   DW_AT_type        : <0xde>
    <164>   DW_AT_data_member_location: 0
 <2><165>: Abbrev Number: 13 (DW_TAG_member)
    <166>   DW_AT_name        : (indirect string, offset: 0x1de7b): NDTR
    <16a>   DW_AT_decl_file   : 7
    <16b>   DW_AT_decl_line   : 366
    <16d>   DW_AT_decl_column : 17
    <16e>   DW_AT_type        : <0xde>
    <172>   DW_AT_data_member_location: 4
 <2><173>: Abbrev Number: 12 (DW_TAG_member)
    <174>   DW_AT_name        : PAR
    <178>   DW_AT_decl_file   : 7
    <179>   DW_AT_decl_line   : 367
    <17b>   DW_AT_decl_column : 17
    <17c>   DW_AT_type        : <0xde>
    <180>   DW_AT_data_member_location: 8
 <2><181>: Abbrev Number: 13 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x6569e): M0AR
    <186>   DW_AT_decl_file   : 7
    <187>   DW_AT_decl_line   : 368
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xde>
    <18e>   DW_AT_data_member_location: 12
 <2><18f>: Abbrev Number: 13 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x82b1c): M1AR
    <194>   DW_AT_decl_file   : 7
    <195>   DW_AT_decl_line   : 369
    <197>   DW_AT_decl_column : 17
    <198>   DW_AT_type        : <0xde>
    <19c>   DW_AT_data_member_location: 16
 <2><19d>: Abbrev Number: 12 (DW_TAG_member)
    <19e>   DW_AT_name        : FCR
    <1a2>   DW_AT_decl_file   : 7
    <1a3>   DW_AT_decl_line   : 370
    <1a5>   DW_AT_decl_column : 17
    <1a6>   DW_AT_type        : <0xde>
    <1aa>   DW_AT_data_member_location: 20
 <2><1ab>: Abbrev Number: 0
 <1><1ac>: Abbrev Number: 14 (DW_TAG_typedef)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x1ed22): DMA_Stream_TypeDef
    <1b1>   DW_AT_decl_file   : 7
    <1b2>   DW_AT_decl_line   : 371
    <1b4>   DW_AT_decl_column : 3
    <1b5>   DW_AT_type        : <0x14e>
 <1><1b9>: Abbrev Number: 7 (DW_TAG_array_type)
    <1ba>   DW_AT_type        : <0xde>
    <1be>   DW_AT_sibling     : <0x1c9>
 <2><1c2>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1c3>   DW_AT_type        : <0x98>
    <1c7>   DW_AT_upper_bound : 1
 <2><1c8>: Abbrev Number: 0
 <1><1c9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <1ca>   DW_AT_type        : <0x1b9>
 <1><1ce>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1cf>   DW_AT_byte_size   : 40
    <1d0>   DW_AT_decl_file   : 7
    <1d1>   DW_AT_decl_line   : 459
    <1d3>   DW_AT_decl_column : 9
    <1d4>   DW_AT_sibling     : <0x257>
 <2><1d8>: Abbrev Number: 13 (DW_TAG_member)
    <1d9>   DW_AT_name        : (indirect string, offset: 0x1876): MODER
    <1dd>   DW_AT_decl_file   : 7
    <1de>   DW_AT_decl_line   : 461
    <1e0>   DW_AT_decl_column : 17
    <1e1>   DW_AT_type        : <0xde>
    <1e5>   DW_AT_data_member_location: 0
 <2><1e6>: Abbrev Number: 13 (DW_TAG_member)
    <1e7>   DW_AT_name        : (indirect string, offset: 0xba28f): OTYPER
    <1eb>   DW_AT_decl_file   : 7
    <1ec>   DW_AT_decl_line   : 462
    <1ee>   DW_AT_decl_column : 17
    <1ef>   DW_AT_type        : <0xde>
    <1f3>   DW_AT_data_member_location: 4
 <2><1f4>: Abbrev Number: 13 (DW_TAG_member)
    <1f5>   DW_AT_name        : (indirect string, offset: 0xdb26d): OSPEEDR
    <1f9>   DW_AT_decl_file   : 7
    <1fa>   DW_AT_decl_line   : 463
    <1fc>   DW_AT_decl_column : 17
    <1fd>   DW_AT_type        : <0xde>
    <201>   DW_AT_data_member_location: 8
 <2><202>: Abbrev Number: 13 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0xada15): PUPDR
    <207>   DW_AT_decl_file   : 7
    <208>   DW_AT_decl_line   : 464
    <20a>   DW_AT_decl_column : 17
    <20b>   DW_AT_type        : <0xde>
    <20f>   DW_AT_data_member_location: 12
 <2><210>: Abbrev Number: 12 (DW_TAG_member)
    <211>   DW_AT_name        : IDR
    <215>   DW_AT_decl_file   : 7
    <216>   DW_AT_decl_line   : 465
    <218>   DW_AT_decl_column : 17
    <219>   DW_AT_type        : <0xde>
    <21d>   DW_AT_data_member_location: 16
 <2><21e>: Abbrev Number: 12 (DW_TAG_member)
    <21f>   DW_AT_name        : ODR
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 466
    <226>   DW_AT_decl_column : 17
    <227>   DW_AT_type        : <0xde>
    <22b>   DW_AT_data_member_location: 20
 <2><22c>: Abbrev Number: 13 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x3455a): BSRR
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 467
    <234>   DW_AT_decl_column : 17
    <235>   DW_AT_type        : <0xde>
    <239>   DW_AT_data_member_location: 24
 <2><23a>: Abbrev Number: 13 (DW_TAG_member)
    <23b>   DW_AT_name        : (indirect string, offset: 0xd8511): LCKR
    <23f>   DW_AT_decl_file   : 7
    <240>   DW_AT_decl_line   : 468
    <242>   DW_AT_decl_column : 17
    <243>   DW_AT_type        : <0xde>
    <247>   DW_AT_data_member_location: 28
 <2><248>: Abbrev Number: 12 (DW_TAG_member)
    <249>   DW_AT_name        : AFR
    <24d>   DW_AT_decl_file   : 7
    <24e>   DW_AT_decl_line   : 469
    <250>   DW_AT_decl_column : 17
    <251>   DW_AT_type        : <0x1c9>
    <255>   DW_AT_data_member_location: 32
 <2><256>: Abbrev Number: 0
 <1><257>: Abbrev Number: 14 (DW_TAG_typedef)
    <258>   DW_AT_name        : (indirect string, offset: 0xf9926): GPIO_TypeDef
    <25c>   DW_AT_decl_file   : 7
    <25d>   DW_AT_decl_line   : 470
    <25f>   DW_AT_decl_column : 3
    <260>   DW_AT_type        : <0x1ce>
 <1><264>: Abbrev Number: 11 (DW_TAG_structure_type)
    <265>   DW_AT_byte_size   : 8
    <266>   DW_AT_decl_file   : 7
    <267>   DW_AT_decl_line   : 541
    <269>   DW_AT_decl_column : 9
    <26a>   DW_AT_sibling     : <0x28a>
 <2><26e>: Abbrev Number: 12 (DW_TAG_member)
    <26f>   DW_AT_name        : CR
    <272>   DW_AT_decl_file   : 7
    <273>   DW_AT_decl_line   : 543
    <275>   DW_AT_decl_column : 17
    <276>   DW_AT_type        : <0xde>
    <27a>   DW_AT_data_member_location: 0
 <2><27b>: Abbrev Number: 12 (DW_TAG_member)
    <27c>   DW_AT_name        : CSR
    <280>   DW_AT_decl_file   : 7
    <281>   DW_AT_decl_line   : 544
    <283>   DW_AT_decl_column : 17
    <284>   DW_AT_type        : <0xde>
    <288>   DW_AT_data_member_location: 4
 <2><289>: Abbrev Number: 0
 <1><28a>: Abbrev Number: 14 (DW_TAG_typedef)
    <28b>   DW_AT_name        : (indirect string, offset: 0xaf818): PWR_TypeDef
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 545
    <292>   DW_AT_decl_column : 3
    <293>   DW_AT_type        : <0x264>
 <1><297>: Abbrev Number: 11 (DW_TAG_structure_type)
    <298>   DW_AT_byte_size   : 152
    <299>   DW_AT_decl_file   : 7
    <29a>   DW_AT_decl_line   : 551
    <29c>   DW_AT_decl_column : 9
    <29d>   DW_AT_sibling     : <0x47d>
 <2><2a1>: Abbrev Number: 12 (DW_TAG_member)
    <2a2>   DW_AT_name        : CR
    <2a5>   DW_AT_decl_file   : 7
    <2a6>   DW_AT_decl_line   : 553
    <2a8>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0xde>
    <2ad>   DW_AT_data_member_location: 0
 <2><2ae>: Abbrev Number: 13 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0xaa4e1): PLLCFGR
    <2b3>   DW_AT_decl_file   : 7
    <2b4>   DW_AT_decl_line   : 554
    <2b6>   DW_AT_decl_column : 17
    <2b7>   DW_AT_type        : <0xde>
    <2bb>   DW_AT_data_member_location: 4
 <2><2bc>: Abbrev Number: 13 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0xe7ceb): CFGR
    <2c1>   DW_AT_decl_file   : 7
    <2c2>   DW_AT_decl_line   : 555
    <2c4>   DW_AT_decl_column : 17
    <2c5>   DW_AT_type        : <0xde>
    <2c9>   DW_AT_data_member_location: 8
 <2><2ca>: Abbrev Number: 12 (DW_TAG_member)
    <2cb>   DW_AT_name        : CIR
    <2cf>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 556
    <2d2>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0xde>
    <2d7>   DW_AT_data_member_location: 12
 <2><2d8>: Abbrev Number: 13 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xbec60): AHB1RSTR
    <2dd>   DW_AT_decl_file   : 7
    <2de>   DW_AT_decl_line   : 557
    <2e0>   DW_AT_decl_column : 17
    <2e1>   DW_AT_type        : <0xde>
    <2e5>   DW_AT_data_member_location: 16
 <2><2e6>: Abbrev Number: 13 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x1d161): AHB2RSTR
    <2eb>   DW_AT_decl_file   : 7
    <2ec>   DW_AT_decl_line   : 558
    <2ee>   DW_AT_decl_column : 17
    <2ef>   DW_AT_type        : <0xde>
    <2f3>   DW_AT_data_member_location: 20
 <2><2f4>: Abbrev Number: 13 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x69940): AHB3RSTR
    <2f9>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 559
    <2fc>   DW_AT_decl_column : 17
    <2fd>   DW_AT_type        : <0xde>
    <301>   DW_AT_data_member_location: 24
 <2><302>: Abbrev Number: 13 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0xeefcb): RESERVED0
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 560
    <30a>   DW_AT_decl_column : 17
    <30b>   DW_AT_type        : <0xd2>
    <30f>   DW_AT_data_member_location: 28
 <2><310>: Abbrev Number: 13 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x1cbf5): APB1RSTR
    <315>   DW_AT_decl_file   : 7
    <316>   DW_AT_decl_line   : 561
    <318>   DW_AT_decl_column : 17
    <319>   DW_AT_type        : <0xde>
    <31d>   DW_AT_data_member_location: 32
 <2><31e>: Abbrev Number: 13 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x69414): APB2RSTR
    <323>   DW_AT_decl_file   : 7
    <324>   DW_AT_decl_line   : 562
    <326>   DW_AT_decl_column : 17
    <327>   DW_AT_type        : <0xde>
    <32b>   DW_AT_data_member_location: 36
 <2><32c>: Abbrev Number: 13 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0xeefd5): RESERVED1
    <331>   DW_AT_decl_file   : 7
    <332>   DW_AT_decl_line   : 563
    <334>   DW_AT_decl_column : 17
    <335>   DW_AT_type        : <0xe3>
    <339>   DW_AT_data_member_location: 40
 <2><33a>: Abbrev Number: 13 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x116f3): AHB1ENR
    <33f>   DW_AT_decl_file   : 7
    <340>   DW_AT_decl_line   : 564
    <342>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0xde>
    <347>   DW_AT_data_member_location: 48
 <2><348>: Abbrev Number: 13 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x3ce36): AHB2ENR
    <34d>   DW_AT_decl_file   : 7
    <34e>   DW_AT_decl_line   : 565
    <350>   DW_AT_decl_column : 17
    <351>   DW_AT_type        : <0xde>
    <355>   DW_AT_data_member_location: 52
 <2><356>: Abbrev Number: 13 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x6c877): AHB3ENR
    <35b>   DW_AT_decl_file   : 7
    <35c>   DW_AT_decl_line   : 566
    <35e>   DW_AT_decl_column : 17
    <35f>   DW_AT_type        : <0xde>
    <363>   DW_AT_data_member_location: 56
 <2><364>: Abbrev Number: 13 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0xeefdf): RESERVED2
    <369>   DW_AT_decl_file   : 7
    <36a>   DW_AT_decl_line   : 567
    <36c>   DW_AT_decl_column : 17
    <36d>   DW_AT_type        : <0xd2>
    <371>   DW_AT_data_member_location: 60
 <2><372>: Abbrev Number: 13 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x87081): APB1ENR
    <377>   DW_AT_decl_file   : 7
    <378>   DW_AT_decl_line   : 568
    <37a>   DW_AT_decl_column : 17
    <37b>   DW_AT_type        : <0xde>
    <37f>   DW_AT_data_member_location: 64
 <2><380>: Abbrev Number: 13 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x1e6e7): APB2ENR
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 569
    <388>   DW_AT_decl_column : 17
    <389>   DW_AT_type        : <0xde>
    <38d>   DW_AT_data_member_location: 68
 <2><38e>: Abbrev Number: 13 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0xeefe9): RESERVED3
    <393>   DW_AT_decl_file   : 7
    <394>   DW_AT_decl_line   : 570
    <396>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0xe3>
    <39b>   DW_AT_data_member_location: 72
 <2><39c>: Abbrev Number: 13 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0xc7aa2): AHB1LPENR
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 571
    <3a4>   DW_AT_decl_column : 17
    <3a5>   DW_AT_type        : <0xde>
    <3a9>   DW_AT_data_member_location: 80
 <2><3aa>: Abbrev Number: 13 (DW_TAG_member)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x3410d): AHB2LPENR
    <3af>   DW_AT_decl_file   : 7
    <3b0>   DW_AT_decl_line   : 572
    <3b2>   DW_AT_decl_column : 17
    <3b3>   DW_AT_type        : <0xde>
    <3b7>   DW_AT_data_member_location: 84
 <2><3b8>: Abbrev Number: 13 (DW_TAG_member)
    <3b9>   DW_AT_name        : (indirect string, offset: 0xa567e): AHB3LPENR
    <3bd>   DW_AT_decl_file   : 7
    <3be>   DW_AT_decl_line   : 573
    <3c0>   DW_AT_decl_column : 17
    <3c1>   DW_AT_type        : <0xde>
    <3c5>   DW_AT_data_member_location: 88
 <2><3c6>: Abbrev Number: 13 (DW_TAG_member)
    <3c7>   DW_AT_name        : (indirect string, offset: 0xeeff3): RESERVED4
    <3cb>   DW_AT_decl_file   : 7
    <3cc>   DW_AT_decl_line   : 574
    <3ce>   DW_AT_decl_column : 17
    <3cf>   DW_AT_type        : <0xd2>
    <3d3>   DW_AT_data_member_location: 92
 <2><3d4>: Abbrev Number: 13 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0xd107d): APB1LPENR
    <3d9>   DW_AT_decl_file   : 7
    <3da>   DW_AT_decl_line   : 575
    <3dc>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0xde>
    <3e1>   DW_AT_data_member_location: 96
 <2><3e2>: Abbrev Number: 13 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x27b4f): APB2LPENR
    <3e7>   DW_AT_decl_file   : 7
    <3e8>   DW_AT_decl_line   : 576
    <3ea>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0xde>
    <3ef>   DW_AT_data_member_location: 100
 <2><3f0>: Abbrev Number: 13 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xeeffd): RESERVED5
    <3f5>   DW_AT_decl_file   : 7
    <3f6>   DW_AT_decl_line   : 577
    <3f8>   DW_AT_decl_column : 17
    <3f9>   DW_AT_type        : <0xe3>
    <3fd>   DW_AT_data_member_location: 104
 <2><3fe>: Abbrev Number: 13 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x223b3): BDCR
    <403>   DW_AT_decl_file   : 7
    <404>   DW_AT_decl_line   : 578
    <406>   DW_AT_decl_column : 17
    <407>   DW_AT_type        : <0xde>
    <40b>   DW_AT_data_member_location: 112
 <2><40c>: Abbrev Number: 12 (DW_TAG_member)
    <40d>   DW_AT_name        : CSR
    <411>   DW_AT_decl_file   : 7
    <412>   DW_AT_decl_line   : 579
    <414>   DW_AT_decl_column : 17
    <415>   DW_AT_type        : <0xde>
    <419>   DW_AT_data_member_location: 116
 <2><41a>: Abbrev Number: 13 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x8bce0): RESERVED6
    <41f>   DW_AT_decl_file   : 7
    <420>   DW_AT_decl_line   : 580
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0xe3>
    <427>   DW_AT_data_member_location: 120
 <2><428>: Abbrev Number: 13 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0x7db64): SSCGR
    <42d>   DW_AT_decl_file   : 7
    <42e>   DW_AT_decl_line   : 581
    <430>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0xde>
    <435>   DW_AT_data_member_location: 128
 <2><436>: Abbrev Number: 13 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x4add6): PLLI2SCFGR
    <43b>   DW_AT_decl_file   : 7
    <43c>   DW_AT_decl_line   : 582
    <43e>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0xde>
    <443>   DW_AT_data_member_location: 132
 <2><444>: Abbrev Number: 13 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xe7ce5): PLLSAICFGR
    <449>   DW_AT_decl_file   : 7
    <44a>   DW_AT_decl_line   : 583
    <44c>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0xde>
    <451>   DW_AT_data_member_location: 136
 <2><452>: Abbrev Number: 13 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0x69af9): DCKCFGR
    <457>   DW_AT_decl_file   : 7
    <458>   DW_AT_decl_line   : 584
    <45a>   DW_AT_decl_column : 17
    <45b>   DW_AT_type        : <0xde>
    <45f>   DW_AT_data_member_location: 140
 <2><460>: Abbrev Number: 13 (DW_TAG_member)
    <461>   DW_AT_name        : (indirect string, offset: 0xb906d): CKGATENR
    <465>   DW_AT_decl_file   : 7
    <466>   DW_AT_decl_line   : 585
    <468>   DW_AT_decl_column : 17
    <469>   DW_AT_type        : <0xde>
    <46d>   DW_AT_data_member_location: 144
 <2><46e>: Abbrev Number: 13 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0xa8fcf): DCKCFGR2
    <473>   DW_AT_decl_file   : 7
    <474>   DW_AT_decl_line   : 586
    <476>   DW_AT_decl_column : 17
    <477>   DW_AT_type        : <0xde>
    <47b>   DW_AT_data_member_location: 148
 <2><47c>: Abbrev Number: 0
 <1><47d>: Abbrev Number: 14 (DW_TAG_typedef)
    <47e>   DW_AT_name        : (indirect string, offset: 0x6f747): RCC_TypeDef
    <482>   DW_AT_decl_file   : 7
    <483>   DW_AT_decl_line   : 587
    <485>   DW_AT_decl_column : 3
    <486>   DW_AT_type        : <0x297>
 <1><48a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <48b>   DW_AT_byte_size   : 84
    <48c>   DW_AT_decl_file   : 7
    <48d>   DW_AT_decl_line   : 746
    <48f>   DW_AT_decl_column : 9
    <490>   DW_AT_sibling     : <0x5b9>
 <2><494>: Abbrev Number: 12 (DW_TAG_member)
    <495>   DW_AT_name        : CR1
    <499>   DW_AT_decl_file   : 7
    <49a>   DW_AT_decl_line   : 748
    <49c>   DW_AT_decl_column : 17
    <49d>   DW_AT_type        : <0xde>
    <4a1>   DW_AT_data_member_location: 0
 <2><4a2>: Abbrev Number: 12 (DW_TAG_member)
    <4a3>   DW_AT_name        : CR2
    <4a7>   DW_AT_decl_file   : 7
    <4a8>   DW_AT_decl_line   : 749
    <4aa>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0xde>
    <4af>   DW_AT_data_member_location: 4
 <2><4b0>: Abbrev Number: 13 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x42b1d): SMCR
    <4b5>   DW_AT_decl_file   : 7
    <4b6>   DW_AT_decl_line   : 750
    <4b8>   DW_AT_decl_column : 17
    <4b9>   DW_AT_type        : <0xde>
    <4bd>   DW_AT_data_member_location: 8
 <2><4be>: Abbrev Number: 13 (DW_TAG_member)
    <4bf>   DW_AT_name        : (indirect string, offset: 0x4911c): DIER
    <4c3>   DW_AT_decl_file   : 7
    <4c4>   DW_AT_decl_line   : 751
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0xde>
    <4cb>   DW_AT_data_member_location: 12
 <2><4cc>: Abbrev Number: 12 (DW_TAG_member)
    <4cd>   DW_AT_name        : SR
    <4d0>   DW_AT_decl_file   : 7
    <4d1>   DW_AT_decl_line   : 752
    <4d3>   DW_AT_decl_column : 17
    <4d4>   DW_AT_type        : <0xde>
    <4d8>   DW_AT_data_member_location: 16
 <2><4d9>: Abbrev Number: 12 (DW_TAG_member)
    <4da>   DW_AT_name        : EGR
    <4de>   DW_AT_decl_file   : 7
    <4df>   DW_AT_decl_line   : 753
    <4e1>   DW_AT_decl_column : 17
    <4e2>   DW_AT_type        : <0xde>
    <4e6>   DW_AT_data_member_location: 20
 <2><4e7>: Abbrev Number: 13 (DW_TAG_member)
    <4e8>   DW_AT_name        : (indirect string, offset: 0xe89f5): CCMR1
    <4ec>   DW_AT_decl_file   : 7
    <4ed>   DW_AT_decl_line   : 754
    <4ef>   DW_AT_decl_column : 17
    <4f0>   DW_AT_type        : <0xde>
    <4f4>   DW_AT_data_member_location: 24
 <2><4f5>: Abbrev Number: 13 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x61fa2): CCMR2
    <4fa>   DW_AT_decl_file   : 7
    <4fb>   DW_AT_decl_line   : 755
    <4fd>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0xde>
    <502>   DW_AT_data_member_location: 28
 <2><503>: Abbrev Number: 13 (DW_TAG_member)
    <504>   DW_AT_name        : (indirect string, offset: 0x383a0): CCER
    <508>   DW_AT_decl_file   : 7
    <509>   DW_AT_decl_line   : 756
    <50b>   DW_AT_decl_column : 17
    <50c>   DW_AT_type        : <0xde>
    <510>   DW_AT_data_member_location: 32
 <2><511>: Abbrev Number: 12 (DW_TAG_member)
    <512>   DW_AT_name        : CNT
    <516>   DW_AT_decl_file   : 7
    <517>   DW_AT_decl_line   : 757
    <519>   DW_AT_decl_column : 17
    <51a>   DW_AT_type        : <0xde>
    <51e>   DW_AT_data_member_location: 36
 <2><51f>: Abbrev Number: 12 (DW_TAG_member)
    <520>   DW_AT_name        : PSC
    <524>   DW_AT_decl_file   : 7
    <525>   DW_AT_decl_line   : 758
    <527>   DW_AT_decl_column : 17
    <528>   DW_AT_type        : <0xde>
    <52c>   DW_AT_data_member_location: 40
 <2><52d>: Abbrev Number: 12 (DW_TAG_member)
    <52e>   DW_AT_name        : ARR
    <532>   DW_AT_decl_file   : 7
    <533>   DW_AT_decl_line   : 759
    <535>   DW_AT_decl_column : 17
    <536>   DW_AT_type        : <0xde>
    <53a>   DW_AT_data_member_location: 44
 <2><53b>: Abbrev Number: 12 (DW_TAG_member)
    <53c>   DW_AT_name        : RCR
    <540>   DW_AT_decl_file   : 7
    <541>   DW_AT_decl_line   : 760
    <543>   DW_AT_decl_column : 17
    <544>   DW_AT_type        : <0xde>
    <548>   DW_AT_data_member_location: 48
 <2><549>: Abbrev Number: 13 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x1e6e2): CCR1
    <54e>   DW_AT_decl_file   : 7
    <54f>   DW_AT_decl_line   : 761
    <551>   DW_AT_decl_column : 17
    <552>   DW_AT_type        : <0xde>
    <556>   DW_AT_data_member_location: 52
 <2><557>: Abbrev Number: 13 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0x6630a): CCR2
    <55c>   DW_AT_decl_file   : 7
    <55d>   DW_AT_decl_line   : 762
    <55f>   DW_AT_decl_column : 17
    <560>   DW_AT_type        : <0xde>
    <564>   DW_AT_data_member_location: 56
 <2><565>: Abbrev Number: 13 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0xb84e3): CCR3
    <56a>   DW_AT_decl_file   : 7
    <56b>   DW_AT_decl_line   : 763
    <56d>   DW_AT_decl_column : 17
    <56e>   DW_AT_type        : <0xde>
    <572>   DW_AT_data_member_location: 60
 <2><573>: Abbrev Number: 13 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0xd4fe): CCR4
    <578>   DW_AT_decl_file   : 7
    <579>   DW_AT_decl_line   : 764
    <57b>   DW_AT_decl_column : 17
    <57c>   DW_AT_type        : <0xde>
    <580>   DW_AT_data_member_location: 64
 <2><581>: Abbrev Number: 13 (DW_TAG_member)
    <582>   DW_AT_name        : (indirect string, offset: 0xa68ce): BDTR
    <586>   DW_AT_decl_file   : 7
    <587>   DW_AT_decl_line   : 765
    <589>   DW_AT_decl_column : 17
    <58a>   DW_AT_type        : <0xde>
    <58e>   DW_AT_data_member_location: 68
 <2><58f>: Abbrev Number: 12 (DW_TAG_member)
    <590>   DW_AT_name        : DCR
    <594>   DW_AT_decl_file   : 7
    <595>   DW_AT_decl_line   : 766
    <597>   DW_AT_decl_column : 17
    <598>   DW_AT_type        : <0xde>
    <59c>   DW_AT_data_member_location: 72
 <2><59d>: Abbrev Number: 13 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0xd8bca): DMAR
    <5a2>   DW_AT_decl_file   : 7
    <5a3>   DW_AT_decl_line   : 767
    <5a5>   DW_AT_decl_column : 17
    <5a6>   DW_AT_type        : <0xde>
    <5aa>   DW_AT_data_member_location: 76
 <2><5ab>: Abbrev Number: 12 (DW_TAG_member)
    <5ac>   DW_AT_name        : OR
    <5af>   DW_AT_decl_file   : 7
    <5b0>   DW_AT_decl_line   : 768
    <5b2>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0xde>
    <5b7>   DW_AT_data_member_location: 80
 <2><5b8>: Abbrev Number: 0
 <1><5b9>: Abbrev Number: 14 (DW_TAG_typedef)
    <5ba>   DW_AT_name        : (indirect string, offset: 0xefa8a): TIM_TypeDef
    <5be>   DW_AT_decl_file   : 7
    <5bf>   DW_AT_decl_line   : 769
    <5c1>   DW_AT_decl_column : 3
    <5c2>   DW_AT_type        : <0x48a>
 <1><5c6>: Abbrev Number: 11 (DW_TAG_structure_type)
    <5c7>   DW_AT_byte_size   : 28
    <5c8>   DW_AT_decl_file   : 7
    <5c9>   DW_AT_decl_line   : 775
    <5cb>   DW_AT_decl_column : 9
    <5cc>   DW_AT_sibling     : <0x631>
 <2><5d0>: Abbrev Number: 12 (DW_TAG_member)
    <5d1>   DW_AT_name        : SR
    <5d4>   DW_AT_decl_file   : 7
    <5d5>   DW_AT_decl_line   : 777
    <5d7>   DW_AT_decl_column : 17
    <5d8>   DW_AT_type        : <0xde>
    <5dc>   DW_AT_data_member_location: 0
 <2><5dd>: Abbrev Number: 12 (DW_TAG_member)
    <5de>   DW_AT_name        : DR
    <5e1>   DW_AT_decl_file   : 7
    <5e2>   DW_AT_decl_line   : 778
    <5e4>   DW_AT_decl_column : 17
    <5e5>   DW_AT_type        : <0xde>
    <5e9>   DW_AT_data_member_location: 4
 <2><5ea>: Abbrev Number: 12 (DW_TAG_member)
    <5eb>   DW_AT_name        : BRR
    <5ef>   DW_AT_decl_file   : 7
    <5f0>   DW_AT_decl_line   : 779
    <5f2>   DW_AT_decl_column : 17
    <5f3>   DW_AT_type        : <0xde>
    <5f7>   DW_AT_data_member_location: 8
 <2><5f8>: Abbrev Number: 12 (DW_TAG_member)
    <5f9>   DW_AT_name        : CR1
    <5fd>   DW_AT_decl_file   : 7
    <5fe>   DW_AT_decl_line   : 780
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0xde>
    <605>   DW_AT_data_member_location: 12
 <2><606>: Abbrev Number: 12 (DW_TAG_member)
    <607>   DW_AT_name        : CR2
    <60b>   DW_AT_decl_file   : 7
    <60c>   DW_AT_decl_line   : 781
    <60e>   DW_AT_decl_column : 17
    <60f>   DW_AT_type        : <0xde>
    <613>   DW_AT_data_member_location: 16
 <2><614>: Abbrev Number: 12 (DW_TAG_member)
    <615>   DW_AT_name        : CR3
    <619>   DW_AT_decl_file   : 7
    <61a>   DW_AT_decl_line   : 782
    <61c>   DW_AT_decl_column : 17
    <61d>   DW_AT_type        : <0xde>
    <621>   DW_AT_data_member_location: 20
 <2><622>: Abbrev Number: 13 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x3f683): GTPR
    <627>   DW_AT_decl_file   : 7
    <628>   DW_AT_decl_line   : 783
    <62a>   DW_AT_decl_column : 17
    <62b>   DW_AT_type        : <0xde>
    <62f>   DW_AT_data_member_location: 24
 <2><630>: Abbrev Number: 0
 <1><631>: Abbrev Number: 14 (DW_TAG_typedef)
    <632>   DW_AT_name        : (indirect string, offset: 0x7ef50): USART_TypeDef
    <636>   DW_AT_decl_file   : 7
    <637>   DW_AT_decl_line   : 784
    <639>   DW_AT_decl_column : 3
    <63a>   DW_AT_type        : <0x5c6>
 <1><63e>: Abbrev Number: 2 (DW_TAG_base_type)
    <63f>   DW_AT_byte_size   : 8
    <640>   DW_AT_encoding    : 4	(float)
    <641>   DW_AT_name        : (indirect string, offset: 0x515cd): long double
 <1><645>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <646>   DW_AT_encoding    : 7	(unsigned)
    <647>   DW_AT_byte_size   : 1
    <648>   DW_AT_type        : <0x3c>
    <64c>   DW_AT_decl_file   : 8
    <64d>   DW_AT_decl_line   : 40
    <64e>   DW_AT_decl_column : 1
    <64f>   DW_AT_sibling     : <0x66c>
 <2><653>: Abbrev Number: 16 (DW_TAG_enumerator)
    <654>   DW_AT_name        : (indirect string, offset: 0x4c132): HAL_OK
    <658>   DW_AT_const_value : 0
 <2><659>: Abbrev Number: 16 (DW_TAG_enumerator)
    <65a>   DW_AT_name        : (indirect string, offset: 0x9239f): HAL_ERROR
    <65e>   DW_AT_const_value : 1
 <2><65f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <660>   DW_AT_name        : (indirect string, offset: 0x29e05): HAL_BUSY
    <664>   DW_AT_const_value : 2
 <2><665>: Abbrev Number: 16 (DW_TAG_enumerator)
    <666>   DW_AT_name        : (indirect string, offset: 0x428dc): HAL_TIMEOUT
    <66a>   DW_AT_const_value : 3
 <2><66b>: Abbrev Number: 0
 <1><66c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <66d>   DW_AT_encoding    : 7	(unsigned)
    <66e>   DW_AT_byte_size   : 1
    <66f>   DW_AT_type        : <0x3c>
    <673>   DW_AT_decl_file   : 8
    <674>   DW_AT_decl_line   : 51
    <675>   DW_AT_decl_column : 1
    <676>   DW_AT_sibling     : <0x687>
 <2><67a>: Abbrev Number: 16 (DW_TAG_enumerator)
    <67b>   DW_AT_name        : (indirect string, offset: 0xb30ee): HAL_UNLOCKED
    <67f>   DW_AT_const_value : 0
 <2><680>: Abbrev Number: 16 (DW_TAG_enumerator)
    <681>   DW_AT_name        : (indirect string, offset: 0xff9ad): HAL_LOCKED
    <685>   DW_AT_const_value : 1
 <2><686>: Abbrev Number: 0
 <1><687>: Abbrev Number: 3 (DW_TAG_typedef)
    <688>   DW_AT_name        : (indirect string, offset: 0x8abde): HAL_LockTypeDef
    <68c>   DW_AT_decl_file   : 8
    <68d>   DW_AT_decl_line   : 54
    <68e>   DW_AT_decl_column : 3
    <68f>   DW_AT_type        : <0x66c>
 <1><693>: Abbrev Number: 17 (DW_TAG_structure_type)
    <694>   DW_AT_byte_size   : 28
    <695>   DW_AT_decl_file   : 9
    <696>   DW_AT_decl_line   : 47
    <697>   DW_AT_decl_column : 9
    <698>   DW_AT_sibling     : <0x6f8>
 <2><69c>: Abbrev Number: 18 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0xa0c7a): PLLState
    <6a1>   DW_AT_decl_file   : 9
    <6a2>   DW_AT_decl_line   : 49
    <6a3>   DW_AT_decl_column : 12
    <6a4>   DW_AT_type        : <0xd2>
    <6a8>   DW_AT_data_member_location: 0
 <2><6a9>: Abbrev Number: 18 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0xa91a4): PLLSource
    <6ae>   DW_AT_decl_file   : 9
    <6af>   DW_AT_decl_line   : 52
    <6b0>   DW_AT_decl_column : 12
    <6b1>   DW_AT_type        : <0xd2>
    <6b5>   DW_AT_data_member_location: 4
 <2><6b6>: Abbrev Number: 18 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xceb69): PLLM
    <6bb>   DW_AT_decl_file   : 9
    <6bc>   DW_AT_decl_line   : 55
    <6bd>   DW_AT_decl_column : 12
    <6be>   DW_AT_type        : <0xd2>
    <6c2>   DW_AT_data_member_location: 8
 <2><6c3>: Abbrev Number: 18 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0xceb6e): PLLN
    <6c8>   DW_AT_decl_file   : 9
    <6c9>   DW_AT_decl_line   : 58
    <6ca>   DW_AT_decl_column : 12
    <6cb>   DW_AT_type        : <0xd2>
    <6cf>   DW_AT_data_member_location: 12
 <2><6d0>: Abbrev Number: 18 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xceb8b): PLLP
    <6d5>   DW_AT_decl_file   : 9
    <6d6>   DW_AT_decl_line   : 62
    <6d7>   DW_AT_decl_column : 12
    <6d8>   DW_AT_type        : <0xd2>
    <6dc>   DW_AT_data_member_location: 16
 <2><6dd>: Abbrev Number: 18 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0x52e89): PLLQ
    <6e2>   DW_AT_decl_file   : 9
    <6e3>   DW_AT_decl_line   : 65
    <6e4>   DW_AT_decl_column : 12
    <6e5>   DW_AT_type        : <0xd2>
    <6e9>   DW_AT_data_member_location: 20
 <2><6ea>: Abbrev Number: 18 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x9721e): PLLR
    <6ef>   DW_AT_decl_file   : 9
    <6f0>   DW_AT_decl_line   : 70
    <6f1>   DW_AT_decl_column : 12
    <6f2>   DW_AT_type        : <0xd2>
    <6f6>   DW_AT_data_member_location: 24
 <2><6f7>: Abbrev Number: 0
 <1><6f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x8dccf): RCC_PLLInitTypeDef
    <6fd>   DW_AT_decl_file   : 9
    <6fe>   DW_AT_decl_line   : 75
    <6ff>   DW_AT_decl_column : 2
    <700>   DW_AT_type        : <0x693>
 <1><704>: Abbrev Number: 17 (DW_TAG_structure_type)
    <705>   DW_AT_byte_size   : 52
    <706>   DW_AT_decl_file   : 10
    <707>   DW_AT_decl_line   : 51
    <708>   DW_AT_decl_column : 9
    <709>   DW_AT_sibling     : <0x769>
 <2><70d>: Abbrev Number: 18 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0xc748b): OscillatorType
    <712>   DW_AT_decl_file   : 10
    <713>   DW_AT_decl_line   : 53
    <714>   DW_AT_decl_column : 12
    <715>   DW_AT_type        : <0xd2>
    <719>   DW_AT_data_member_location: 0
 <2><71a>: Abbrev Number: 18 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0xa5c08): HSEState
    <71f>   DW_AT_decl_file   : 10
    <720>   DW_AT_decl_line   : 56
    <721>   DW_AT_decl_column : 12
    <722>   DW_AT_type        : <0xd2>
    <726>   DW_AT_data_member_location: 4
 <2><727>: Abbrev Number: 18 (DW_TAG_member)
    <728>   DW_AT_name        : (indirect string, offset: 0x92e94): LSEState
    <72c>   DW_AT_decl_file   : 10
    <72d>   DW_AT_decl_line   : 59
    <72e>   DW_AT_decl_column : 12
    <72f>   DW_AT_type        : <0xd2>
    <733>   DW_AT_data_member_location: 8
 <2><734>: Abbrev Number: 18 (DW_TAG_member)
    <735>   DW_AT_name        : (indirect string, offset: 0x6beca): HSIState
    <739>   DW_AT_decl_file   : 10
    <73a>   DW_AT_decl_line   : 62
    <73b>   DW_AT_decl_column : 12
    <73c>   DW_AT_type        : <0xd2>
    <740>   DW_AT_data_member_location: 12
 <2><741>: Abbrev Number: 18 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0xd8e8a): HSICalibrationValue
    <746>   DW_AT_decl_file   : 10
    <747>   DW_AT_decl_line   : 65
    <748>   DW_AT_decl_column : 12
    <749>   DW_AT_type        : <0xd2>
    <74d>   DW_AT_data_member_location: 16
 <2><74e>: Abbrev Number: 18 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x4e8fc): LSIState
    <753>   DW_AT_decl_file   : 10
    <754>   DW_AT_decl_line   : 68
    <755>   DW_AT_decl_column : 12
    <756>   DW_AT_type        : <0xd2>
    <75a>   DW_AT_data_member_location: 20
 <2><75b>: Abbrev Number: 19 (DW_TAG_member)
    <75c>   DW_AT_name        : PLL
    <760>   DW_AT_decl_file   : 10
    <761>   DW_AT_decl_line   : 71
    <762>   DW_AT_decl_column : 22
    <763>   DW_AT_type        : <0x6f8>
    <767>   DW_AT_data_member_location: 24
 <2><768>: Abbrev Number: 0
 <1><769>: Abbrev Number: 3 (DW_TAG_typedef)
    <76a>   DW_AT_name        : (indirect string, offset: 0x7e164): RCC_OscInitTypeDef
    <76e>   DW_AT_decl_file   : 10
    <76f>   DW_AT_decl_line   : 72
    <770>   DW_AT_decl_column : 2
    <771>   DW_AT_type        : <0x704>
 <1><775>: Abbrev Number: 17 (DW_TAG_structure_type)
    <776>   DW_AT_byte_size   : 20
    <777>   DW_AT_decl_file   : 10
    <778>   DW_AT_decl_line   : 77
    <779>   DW_AT_decl_column : 9
    <77a>   DW_AT_sibling     : <0x7c0>
 <2><77e>: Abbrev Number: 18 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x456ca): ClockType
    <783>   DW_AT_decl_file   : 10
    <784>   DW_AT_decl_line   : 79
    <785>   DW_AT_decl_column : 12
    <786>   DW_AT_type        : <0xd2>
    <78a>   DW_AT_data_member_location: 0
 <2><78b>: Abbrev Number: 18 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x8d6dd): SYSCLKSource
    <790>   DW_AT_decl_file   : 10
    <791>   DW_AT_decl_line   : 82
    <792>   DW_AT_decl_column : 12
    <793>   DW_AT_type        : <0xd2>
    <797>   DW_AT_data_member_location: 4
 <2><798>: Abbrev Number: 18 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0xce668): AHBCLKDivider
    <79d>   DW_AT_decl_file   : 10
    <79e>   DW_AT_decl_line   : 85
    <79f>   DW_AT_decl_column : 12
    <7a0>   DW_AT_type        : <0xd2>
    <7a4>   DW_AT_data_member_location: 8
 <2><7a5>: Abbrev Number: 18 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x8346): APB1CLKDivider
    <7aa>   DW_AT_decl_file   : 10
    <7ab>   DW_AT_decl_line   : 88
    <7ac>   DW_AT_decl_column : 12
    <7ad>   DW_AT_type        : <0xd2>
    <7b1>   DW_AT_data_member_location: 12
 <2><7b2>: Abbrev Number: 18 (DW_TAG_member)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x6e753): APB2CLKDivider
    <7b7>   DW_AT_decl_file   : 10
    <7b8>   DW_AT_decl_line   : 91
    <7b9>   DW_AT_decl_column : 12
    <7ba>   DW_AT_type        : <0xd2>
    <7be>   DW_AT_data_member_location: 16
 <2><7bf>: Abbrev Number: 0
 <1><7c0>: Abbrev Number: 3 (DW_TAG_typedef)
    <7c1>   DW_AT_name        : (indirect string, offset: 0xaa4ce): RCC_ClkInitTypeDef
    <7c5>   DW_AT_decl_file   : 10
    <7c6>   DW_AT_decl_line   : 94
    <7c7>   DW_AT_decl_column : 2
    <7c8>   DW_AT_type        : <0x775>
 <1><7cc>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7cd>   DW_AT_byte_size   : 20
    <7ce>   DW_AT_decl_file   : 11
    <7cf>   DW_AT_decl_line   : 47
    <7d0>   DW_AT_decl_column : 9
    <7d1>   DW_AT_sibling     : <0x817>
 <2><7d5>: Abbrev Number: 19 (DW_TAG_member)
    <7d6>   DW_AT_name        : Pin
    <7da>   DW_AT_decl_file   : 11
    <7db>   DW_AT_decl_line   : 49
    <7dc>   DW_AT_decl_column : 12
    <7dd>   DW_AT_type        : <0xd2>
    <7e1>   DW_AT_data_member_location: 0
 <2><7e2>: Abbrev Number: 18 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x698b5): Mode
    <7e7>   DW_AT_decl_file   : 11
    <7e8>   DW_AT_decl_line   : 52
    <7e9>   DW_AT_decl_column : 12
    <7ea>   DW_AT_type        : <0xd2>
    <7ee>   DW_AT_data_member_location: 4
 <2><7ef>: Abbrev Number: 18 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x7a75d): Pull
    <7f4>   DW_AT_decl_file   : 11
    <7f5>   DW_AT_decl_line   : 55
    <7f6>   DW_AT_decl_column : 12
    <7f7>   DW_AT_type        : <0xd2>
    <7fb>   DW_AT_data_member_location: 8
 <2><7fc>: Abbrev Number: 18 (DW_TAG_member)
    <7fd>   DW_AT_name        : (indirect string, offset: 0x102af4): Speed
    <801>   DW_AT_decl_file   : 11
    <802>   DW_AT_decl_line   : 58
    <803>   DW_AT_decl_column : 12
    <804>   DW_AT_type        : <0xd2>
    <808>   DW_AT_data_member_location: 12
 <2><809>: Abbrev Number: 18 (DW_TAG_member)
    <80a>   DW_AT_name        : (indirect string, offset: 0x6e714): Alternate
    <80e>   DW_AT_decl_file   : 11
    <80f>   DW_AT_decl_line   : 61
    <810>   DW_AT_decl_column : 12
    <811>   DW_AT_type        : <0xd2>
    <815>   DW_AT_data_member_location: 16
 <2><816>: Abbrev Number: 0
 <1><817>: Abbrev Number: 3 (DW_TAG_typedef)
    <818>   DW_AT_name        : (indirect string, offset: 0xbbe65): GPIO_InitTypeDef
    <81c>   DW_AT_decl_file   : 11
    <81d>   DW_AT_decl_line   : 63
    <81e>   DW_AT_decl_column : 2
    <81f>   DW_AT_type        : <0x7cc>
 <1><823>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <824>   DW_AT_encoding    : 7	(unsigned)
    <825>   DW_AT_byte_size   : 1
    <826>   DW_AT_type        : <0x3c>
    <82a>   DW_AT_decl_file   : 11
    <82b>   DW_AT_decl_line   : 69
    <82c>   DW_AT_decl_column : 1
    <82d>   DW_AT_sibling     : <0x83e>
 <2><831>: Abbrev Number: 16 (DW_TAG_enumerator)
    <832>   DW_AT_name        : (indirect string, offset: 0x308b7): GPIO_PIN_RESET
    <836>   DW_AT_const_value : 0
 <2><837>: Abbrev Number: 16 (DW_TAG_enumerator)
    <838>   DW_AT_name        : (indirect string, offset: 0x3a104): GPIO_PIN_SET
    <83c>   DW_AT_const_value : 1
 <2><83d>: Abbrev Number: 0
 <1><83e>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <83f>   DW_AT_prototyped  : 1
 <1><83f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <840>   DW_AT_byte_size   : 4
    <841>   DW_AT_type        : <0x83e>
 <1><845>: Abbrev Number: 17 (DW_TAG_structure_type)
    <846>   DW_AT_byte_size   : 48
    <847>   DW_AT_decl_file   : 12
    <848>   DW_AT_decl_line   : 49
    <849>   DW_AT_decl_column : 9
    <84a>   DW_AT_sibling     : <0x8eb>
 <2><84e>: Abbrev Number: 18 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x7b9de): Channel
    <853>   DW_AT_decl_file   : 12
    <854>   DW_AT_decl_line   : 51
    <855>   DW_AT_decl_column : 12
    <856>   DW_AT_type        : <0xd2>
    <85a>   DW_AT_data_member_location: 0
 <2><85b>: Abbrev Number: 18 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x52ac7): Direction
    <860>   DW_AT_decl_file   : 12
    <861>   DW_AT_decl_line   : 54
    <862>   DW_AT_decl_column : 12
    <863>   DW_AT_type        : <0xd2>
    <867>   DW_AT_data_member_location: 4
 <2><868>: Abbrev Number: 18 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0xe17e): PeriphInc
    <86d>   DW_AT_decl_file   : 12
    <86e>   DW_AT_decl_line   : 58
    <86f>   DW_AT_decl_column : 12
    <870>   DW_AT_type        : <0xd2>
    <874>   DW_AT_data_member_location: 8
 <2><875>: Abbrev Number: 18 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0x26148): MemInc
    <87a>   DW_AT_decl_file   : 12
    <87b>   DW_AT_decl_line   : 61
    <87c>   DW_AT_decl_column : 12
    <87d>   DW_AT_type        : <0xd2>
    <881>   DW_AT_data_member_location: 12
 <2><882>: Abbrev Number: 18 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x76b7f): PeriphDataAlignment
    <887>   DW_AT_decl_file   : 12
    <888>   DW_AT_decl_line   : 64
    <889>   DW_AT_decl_column : 12
    <88a>   DW_AT_type        : <0xd2>
    <88e>   DW_AT_data_member_location: 16
 <2><88f>: Abbrev Number: 18 (DW_TAG_member)
    <890>   DW_AT_name        : (indirect string, offset: 0xe6a33): MemDataAlignment
    <894>   DW_AT_decl_file   : 12
    <895>   DW_AT_decl_line   : 67
    <896>   DW_AT_decl_column : 12
    <897>   DW_AT_type        : <0xd2>
    <89b>   DW_AT_data_member_location: 20
 <2><89c>: Abbrev Number: 18 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x698b5): Mode
    <8a1>   DW_AT_decl_file   : 12
    <8a2>   DW_AT_decl_line   : 70
    <8a3>   DW_AT_decl_column : 12
    <8a4>   DW_AT_type        : <0xd2>
    <8a8>   DW_AT_data_member_location: 24
 <2><8a9>: Abbrev Number: 18 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x103cb6): Priority
    <8ae>   DW_AT_decl_file   : 12
    <8af>   DW_AT_decl_line   : 75
    <8b0>   DW_AT_decl_column : 12
    <8b1>   DW_AT_type        : <0xd2>
    <8b5>   DW_AT_data_member_location: 28
 <2><8b6>: Abbrev Number: 18 (DW_TAG_member)
    <8b7>   DW_AT_name        : (indirect string, offset: 0x68cb4): FIFOMode
    <8bb>   DW_AT_decl_file   : 12
    <8bc>   DW_AT_decl_line   : 78
    <8bd>   DW_AT_decl_column : 12
    <8be>   DW_AT_type        : <0xd2>
    <8c2>   DW_AT_data_member_location: 32
 <2><8c3>: Abbrev Number: 18 (DW_TAG_member)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xb788c): FIFOThreshold
    <8c8>   DW_AT_decl_file   : 12
    <8c9>   DW_AT_decl_line   : 83
    <8ca>   DW_AT_decl_column : 12
    <8cb>   DW_AT_type        : <0xd2>
    <8cf>   DW_AT_data_member_location: 36
 <2><8d0>: Abbrev Number: 18 (DW_TAG_member)
    <8d1>   DW_AT_name        : (indirect string, offset: 0xb5740): MemBurst
    <8d5>   DW_AT_decl_file   : 12
    <8d6>   DW_AT_decl_line   : 86
    <8d7>   DW_AT_decl_column : 12
    <8d8>   DW_AT_type        : <0xd2>
    <8dc>   DW_AT_data_member_location: 40
 <2><8dd>: Abbrev Number: 18 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0x4d16e): PeriphBurst
    <8e2>   DW_AT_decl_file   : 12
    <8e3>   DW_AT_decl_line   : 92
    <8e4>   DW_AT_decl_column : 12
    <8e5>   DW_AT_type        : <0xd2>
    <8e9>   DW_AT_data_member_location: 44
 <2><8ea>: Abbrev Number: 0
 <1><8eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ec>   DW_AT_name        : (indirect string, offset: 0x3d8d9): DMA_InitTypeDef
    <8f0>   DW_AT_decl_file   : 12
    <8f1>   DW_AT_decl_line   : 97
    <8f2>   DW_AT_decl_column : 2
    <8f3>   DW_AT_type        : <0x845>
 <1><8f7>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <8f8>   DW_AT_encoding    : 7	(unsigned)
    <8f9>   DW_AT_byte_size   : 1
    <8fa>   DW_AT_type        : <0x3c>
    <8fe>   DW_AT_decl_file   : 12
    <8ff>   DW_AT_decl_line   : 104
    <900>   DW_AT_decl_column : 1
    <901>   DW_AT_sibling     : <0x92a>
 <2><905>: Abbrev Number: 16 (DW_TAG_enumerator)
    <906>   DW_AT_name        : (indirect string, offset: 0xb445d): HAL_DMA_STATE_RESET
    <90a>   DW_AT_const_value : 0
 <2><90b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <90c>   DW_AT_name        : (indirect string, offset: 0x3ecb3): HAL_DMA_STATE_READY
    <910>   DW_AT_const_value : 1
 <2><911>: Abbrev Number: 16 (DW_TAG_enumerator)
    <912>   DW_AT_name        : (indirect string, offset: 0xa8af4): HAL_DMA_STATE_BUSY
    <916>   DW_AT_const_value : 2
 <2><917>: Abbrev Number: 16 (DW_TAG_enumerator)
    <918>   DW_AT_name        : (indirect string, offset: 0xfc7d5): HAL_DMA_STATE_TIMEOUT
    <91c>   DW_AT_const_value : 3
 <2><91d>: Abbrev Number: 16 (DW_TAG_enumerator)
    <91e>   DW_AT_name        : (indirect string, offset: 0xd800c): HAL_DMA_STATE_ERROR
    <922>   DW_AT_const_value : 4
 <2><923>: Abbrev Number: 16 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x34eb2): HAL_DMA_STATE_ABORT
    <928>   DW_AT_const_value : 5
 <2><929>: Abbrev Number: 0
 <1><92a>: Abbrev Number: 3 (DW_TAG_typedef)
    <92b>   DW_AT_name        : (indirect string, offset: 0xe5e3e): HAL_DMA_StateTypeDef
    <92f>   DW_AT_decl_file   : 12
    <930>   DW_AT_decl_line   : 111
    <931>   DW_AT_decl_column : 2
    <932>   DW_AT_type        : <0x8f7>
 <1><936>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <937>   DW_AT_type        : <0x92a>
 <1><93b>: Abbrev Number: 22 (DW_TAG_structure_type)
    <93c>   DW_AT_name        : (indirect string, offset: 0xd70d3): __DMA_HandleTypeDef
    <940>   DW_AT_byte_size   : 96
    <941>   DW_AT_decl_file   : 12
    <942>   DW_AT_decl_line   : 139
    <943>   DW_AT_decl_column : 16
    <944>   DW_AT_sibling     : <0x9ff>
 <2><948>: Abbrev Number: 18 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0xf403f): Instance
    <94d>   DW_AT_decl_file   : 12
    <94e>   DW_AT_decl_line   : 141
    <94f>   DW_AT_decl_column : 31
    <950>   DW_AT_type        : <0x9ff>
    <954>   DW_AT_data_member_location: 0
 <2><955>: Abbrev Number: 18 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x10440f): Init
    <95a>   DW_AT_decl_file   : 12
    <95b>   DW_AT_decl_line   : 143
    <95c>   DW_AT_decl_column : 30
    <95d>   DW_AT_type        : <0x8eb>
    <961>   DW_AT_data_member_location: 4
 <2><962>: Abbrev Number: 18 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0xad47c): Lock
    <967>   DW_AT_decl_file   : 12
    <968>   DW_AT_decl_line   : 145
    <969>   DW_AT_decl_column : 30
    <96a>   DW_AT_type        : <0x687>
    <96e>   DW_AT_data_member_location: 52
 <2><96f>: Abbrev Number: 18 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0xa5c0b): State
    <974>   DW_AT_decl_file   : 12
    <975>   DW_AT_decl_line   : 147
    <976>   DW_AT_decl_column : 30
    <977>   DW_AT_type        : <0x936>
    <97b>   DW_AT_data_member_location: 53
 <2><97c>: Abbrev Number: 18 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0xf0a46): Parent
    <981>   DW_AT_decl_file   : 12
    <982>   DW_AT_decl_line   : 149
    <983>   DW_AT_decl_column : 31
    <984>   DW_AT_type        : <0xa05>
    <988>   DW_AT_data_member_location: 56
 <2><989>: Abbrev Number: 18 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0xfeeab): XferCpltCallback
    <98e>   DW_AT_decl_file   : 12
    <98f>   DW_AT_decl_line   : 151
    <990>   DW_AT_decl_column : 33
    <991>   DW_AT_type        : <0xa18>
    <995>   DW_AT_data_member_location: 60
 <2><996>: Abbrev Number: 18 (DW_TAG_member)
    <997>   DW_AT_name        : (indirect string, offset: 0xbae38): XferHalfCpltCallback
    <99b>   DW_AT_decl_file   : 12
    <99c>   DW_AT_decl_line   : 153
    <99d>   DW_AT_decl_column : 33
    <99e>   DW_AT_type        : <0xa18>
    <9a2>   DW_AT_data_member_location: 64
 <2><9a3>: Abbrev Number: 18 (DW_TAG_member)
    <9a4>   DW_AT_name        : (indirect string, offset: 0xe925f): XferM1CpltCallback
    <9a8>   DW_AT_decl_file   : 12
    <9a9>   DW_AT_decl_line   : 155
    <9aa>   DW_AT_decl_column : 33
    <9ab>   DW_AT_type        : <0xa18>
    <9af>   DW_AT_data_member_location: 68
 <2><9b0>: Abbrev Number: 18 (DW_TAG_member)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x734d9): XferM1HalfCpltCallback
    <9b5>   DW_AT_decl_file   : 12
    <9b6>   DW_AT_decl_line   : 157
    <9b7>   DW_AT_decl_column : 33
    <9b8>   DW_AT_type        : <0xa18>
    <9bc>   DW_AT_data_member_location: 72
 <2><9bd>: Abbrev Number: 18 (DW_TAG_member)
    <9be>   DW_AT_name        : (indirect string, offset: 0x233b7): XferErrorCallback
    <9c2>   DW_AT_decl_file   : 12
    <9c3>   DW_AT_decl_line   : 159
    <9c4>   DW_AT_decl_column : 33
    <9c5>   DW_AT_type        : <0xa18>
    <9c9>   DW_AT_data_member_location: 76
 <2><9ca>: Abbrev Number: 18 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0xececa): XferAbortCallback
    <9cf>   DW_AT_decl_file   : 12
    <9d0>   DW_AT_decl_line   : 161
    <9d1>   DW_AT_decl_column : 33
    <9d2>   DW_AT_type        : <0xa18>
    <9d6>   DW_AT_data_member_location: 80
 <2><9d7>: Abbrev Number: 18 (DW_TAG_member)
    <9d8>   DW_AT_name        : (indirect string, offset: 0xfaf3d): ErrorCode
    <9dc>   DW_AT_decl_file   : 12
    <9dd>   DW_AT_decl_line   : 163
    <9de>   DW_AT_decl_column : 30
    <9df>   DW_AT_type        : <0xde>
    <9e3>   DW_AT_data_member_location: 84
 <2><9e4>: Abbrev Number: 18 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x6c29a): StreamBaseAddress
    <9e9>   DW_AT_decl_file   : 12
    <9ea>   DW_AT_decl_line   : 165
    <9eb>   DW_AT_decl_column : 30
    <9ec>   DW_AT_type        : <0xd2>
    <9f0>   DW_AT_data_member_location: 88
 <2><9f1>: Abbrev Number: 18 (DW_TAG_member)
    <9f2>   DW_AT_name        : (indirect string, offset: 0xd1530): StreamIndex
    <9f6>   DW_AT_decl_file   : 12
    <9f7>   DW_AT_decl_line   : 167
    <9f8>   DW_AT_decl_column : 30
    <9f9>   DW_AT_type        : <0xd2>
    <9fd>   DW_AT_data_member_location: 92
 <2><9fe>: Abbrev Number: 0
 <1><9ff>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <a00>   DW_AT_byte_size   : 4
    <a01>   DW_AT_type        : <0x1ac>
 <1><a05>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <a06>   DW_AT_byte_size   : 4
 <1><a07>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <a08>   DW_AT_prototyped  : 1
    <a08>   DW_AT_sibling     : <0xa12>
 <2><a0c>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <a0d>   DW_AT_type        : <0xa12>
 <2><a11>: Abbrev Number: 0
 <1><a12>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <a13>   DW_AT_byte_size   : 4
    <a14>   DW_AT_type        : <0x93b>
 <1><a18>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <a19>   DW_AT_byte_size   : 4
    <a1a>   DW_AT_type        : <0xa07>
 <1><a1e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xd70d5): DMA_HandleTypeDef
    <a23>   DW_AT_decl_file   : 12
    <a24>   DW_AT_decl_line   : 169
    <a25>   DW_AT_decl_column : 2
    <a26>   DW_AT_type        : <0x93b>
 <1><a2a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a2b>   DW_AT_byte_size   : 24
    <a2c>   DW_AT_decl_file   : 13
    <a2d>   DW_AT_decl_line   : 47
    <a2e>   DW_AT_decl_column : 9
    <a2f>   DW_AT_sibling     : <0xa82>
 <2><a33>: Abbrev Number: 18 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0x7aacc): Prescaler
    <a38>   DW_AT_decl_file   : 13
    <a39>   DW_AT_decl_line   : 49
    <a3a>   DW_AT_decl_column : 12
    <a3b>   DW_AT_type        : <0xd2>
    <a3f>   DW_AT_data_member_location: 0
 <2><a40>: Abbrev Number: 18 (DW_TAG_member)
    <a41>   DW_AT_name        : (indirect string, offset: 0xe7bf8): CounterMode
    <a45>   DW_AT_decl_file   : 13
    <a46>   DW_AT_decl_line   : 52
    <a47>   DW_AT_decl_column : 12
    <a48>   DW_AT_type        : <0xd2>
    <a4c>   DW_AT_data_member_location: 4
 <2><a4d>: Abbrev Number: 18 (DW_TAG_member)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x10ac8f): Period
    <a52>   DW_AT_decl_file   : 13
    <a53>   DW_AT_decl_line   : 55
    <a54>   DW_AT_decl_column : 12
    <a55>   DW_AT_type        : <0xd2>
    <a59>   DW_AT_data_member_location: 8
 <2><a5a>: Abbrev Number: 18 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x63837): ClockDivision
    <a5f>   DW_AT_decl_file   : 13
    <a60>   DW_AT_decl_line   : 59
    <a61>   DW_AT_decl_column : 12
    <a62>   DW_AT_type        : <0xd2>
    <a66>   DW_AT_data_member_location: 12
 <2><a67>: Abbrev Number: 18 (DW_TAG_member)
    <a68>   DW_AT_name        : (indirect string, offset: 0xaa260): RepetitionCounter
    <a6c>   DW_AT_decl_file   : 13
    <a6d>   DW_AT_decl_line   : 62
    <a6e>   DW_AT_decl_column : 12
    <a6f>   DW_AT_type        : <0xd2>
    <a73>   DW_AT_data_member_location: 16
 <2><a74>: Abbrev Number: 18 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0xeabe9): AutoReloadPreload
    <a79>   DW_AT_decl_file   : 13
    <a7a>   DW_AT_decl_line   : 73
    <a7b>   DW_AT_decl_column : 12
    <a7c>   DW_AT_type        : <0xd2>
    <a80>   DW_AT_data_member_location: 20
 <2><a81>: Abbrev Number: 0
 <1><a82>: Abbrev Number: 3 (DW_TAG_typedef)
    <a83>   DW_AT_name        : (indirect string, offset: 0x4d98a): TIM_Base_InitTypeDef
    <a87>   DW_AT_decl_file   : 13
    <a88>   DW_AT_decl_line   : 75
    <a89>   DW_AT_decl_column : 3
    <a8a>   DW_AT_type        : <0xa2a>
 <1><a8e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a8f>   DW_AT_byte_size   : 28
    <a90>   DW_AT_decl_file   : 13
    <a91>   DW_AT_decl_line   : 80
    <a92>   DW_AT_decl_column : 9
    <a93>   DW_AT_sibling     : <0xaf3>
 <2><a97>: Abbrev Number: 18 (DW_TAG_member)
    <a98>   DW_AT_name        : (indirect string, offset: 0x698b3): OCMode
    <a9c>   DW_AT_decl_file   : 13
    <a9d>   DW_AT_decl_line   : 82
    <a9e>   DW_AT_decl_column : 12
    <a9f>   DW_AT_type        : <0xd2>
    <aa3>   DW_AT_data_member_location: 0
 <2><aa4>: Abbrev Number: 18 (DW_TAG_member)
    <aa5>   DW_AT_name        : (indirect string, offset: 0xd04da): Pulse
    <aa9>   DW_AT_decl_file   : 13
    <aaa>   DW_AT_decl_line   : 85
    <aab>   DW_AT_decl_column : 12
    <aac>   DW_AT_type        : <0xd2>
    <ab0>   DW_AT_data_member_location: 4
 <2><ab1>: Abbrev Number: 18 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x9dfba): OCPolarity
    <ab6>   DW_AT_decl_file   : 13
    <ab7>   DW_AT_decl_line   : 88
    <ab8>   DW_AT_decl_column : 12
    <ab9>   DW_AT_type        : <0xd2>
    <abd>   DW_AT_data_member_location: 8
 <2><abe>: Abbrev Number: 18 (DW_TAG_member)
    <abf>   DW_AT_name        : (indirect string, offset: 0x29371): OCNPolarity
    <ac3>   DW_AT_decl_file   : 13
    <ac4>   DW_AT_decl_line   : 91
    <ac5>   DW_AT_decl_column : 12
    <ac6>   DW_AT_type        : <0xd2>
    <aca>   DW_AT_data_member_location: 12
 <2><acb>: Abbrev Number: 18 (DW_TAG_member)
    <acc>   DW_AT_name        : (indirect string, offset: 0x23141): OCFastMode
    <ad0>   DW_AT_decl_file   : 13
    <ad1>   DW_AT_decl_line   : 95
    <ad2>   DW_AT_decl_column : 12
    <ad3>   DW_AT_type        : <0xd2>
    <ad7>   DW_AT_data_member_location: 16
 <2><ad8>: Abbrev Number: 18 (DW_TAG_member)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x5af2c): OCIdleState
    <add>   DW_AT_decl_file   : 13
    <ade>   DW_AT_decl_line   : 100
    <adf>   DW_AT_decl_column : 12
    <ae0>   DW_AT_type        : <0xd2>
    <ae4>   DW_AT_data_member_location: 20
 <2><ae5>: Abbrev Number: 18 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x215be): OCNIdleState
    <aea>   DW_AT_decl_file   : 13
    <aeb>   DW_AT_decl_line   : 104
    <aec>   DW_AT_decl_column : 12
    <aed>   DW_AT_type        : <0xd2>
    <af1>   DW_AT_data_member_location: 24
 <2><af2>: Abbrev Number: 0
 <1><af3>: Abbrev Number: 3 (DW_TAG_typedef)
    <af4>   DW_AT_name        : (indirect string, offset: 0x14a96): TIM_OC_InitTypeDef
    <af8>   DW_AT_decl_file   : 13
    <af9>   DW_AT_decl_line   : 107
    <afa>   DW_AT_decl_column : 3
    <afb>   DW_AT_type        : <0xa8e>
 <1><aff>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b00>   DW_AT_byte_size   : 16
    <b01>   DW_AT_decl_file   : 13
    <b02>   DW_AT_decl_line   : 148
    <b03>   DW_AT_decl_column : 9
    <b04>   DW_AT_sibling     : <0xb3d>
 <2><b08>: Abbrev Number: 18 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0x10472e): ICPolarity
    <b0d>   DW_AT_decl_file   : 13
    <b0e>   DW_AT_decl_line   : 150
    <b0f>   DW_AT_decl_column : 13
    <b10>   DW_AT_type        : <0xd2>
    <b14>   DW_AT_data_member_location: 0
 <2><b15>: Abbrev Number: 18 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x10486b): ICSelection
    <b1a>   DW_AT_decl_file   : 13
    <b1b>   DW_AT_decl_line   : 153
    <b1c>   DW_AT_decl_column : 12
    <b1d>   DW_AT_type        : <0xd2>
    <b21>   DW_AT_data_member_location: 4
 <2><b22>: Abbrev Number: 18 (DW_TAG_member)
    <b23>   DW_AT_name        : (indirect string, offset: 0x2b3ff): ICPrescaler
    <b27>   DW_AT_decl_file   : 13
    <b28>   DW_AT_decl_line   : 156
    <b29>   DW_AT_decl_column : 12
    <b2a>   DW_AT_type        : <0xd2>
    <b2e>   DW_AT_data_member_location: 8
 <2><b2f>: Abbrev Number: 18 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0x10463c): ICFilter
    <b34>   DW_AT_decl_file   : 13
    <b35>   DW_AT_decl_line   : 159
    <b36>   DW_AT_decl_column : 12
    <b37>   DW_AT_type        : <0xd2>
    <b3b>   DW_AT_data_member_location: 12
 <2><b3c>: Abbrev Number: 0
 <1><b3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x6df28): TIM_IC_InitTypeDef
    <b42>   DW_AT_decl_file   : 13
    <b43>   DW_AT_decl_line   : 161
    <b44>   DW_AT_decl_column : 3
    <b45>   DW_AT_type        : <0xaff>
 <1><b49>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b4a>   DW_AT_byte_size   : 36
    <b4b>   DW_AT_decl_file   : 13
    <b4c>   DW_AT_decl_line   : 166
    <b4d>   DW_AT_decl_column : 9
    <b4e>   DW_AT_sibling     : <0xbc8>
 <2><b52>: Abbrev Number: 18 (DW_TAG_member)
    <b53>   DW_AT_name        : (indirect string, offset: 0x26b13): EncoderMode
    <b57>   DW_AT_decl_file   : 13
    <b58>   DW_AT_decl_line   : 168
    <b59>   DW_AT_decl_column : 12
    <b5a>   DW_AT_type        : <0xd2>
    <b5e>   DW_AT_data_member_location: 0
 <2><b5f>: Abbrev Number: 18 (DW_TAG_member)
    <b60>   DW_AT_name        : (indirect string, offset: 0xfbefe): IC1Polarity
    <b64>   DW_AT_decl_file   : 13
    <b65>   DW_AT_decl_line   : 171
    <b66>   DW_AT_decl_column : 12
    <b67>   DW_AT_type        : <0xd2>
    <b6b>   DW_AT_data_member_location: 4
 <2><b6c>: Abbrev Number: 18 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0xfc553): IC1Selection
    <b71>   DW_AT_decl_file   : 13
    <b72>   DW_AT_decl_line   : 174
    <b73>   DW_AT_decl_column : 12
    <b74>   DW_AT_type        : <0xd2>
    <b78>   DW_AT_data_member_location: 8
 <2><b79>: Abbrev Number: 18 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x7aac9): IC1Prescaler
    <b7e>   DW_AT_decl_file   : 13
    <b7f>   DW_AT_decl_line   : 177
    <b80>   DW_AT_decl_column : 12
    <b81>   DW_AT_type        : <0xd2>
    <b85>   DW_AT_data_member_location: 12
 <2><b86>: Abbrev Number: 18 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x1c257): IC1Filter
    <b8b>   DW_AT_decl_file   : 13
    <b8c>   DW_AT_decl_line   : 180
    <b8d>   DW_AT_decl_column : 12
    <b8e>   DW_AT_type        : <0xd2>
    <b92>   DW_AT_data_member_location: 16
 <2><b93>: Abbrev Number: 18 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0xb67cb): IC2Polarity
    <b98>   DW_AT_decl_file   : 13
    <b99>   DW_AT_decl_line   : 183
    <b9a>   DW_AT_decl_column : 12
    <b9b>   DW_AT_type        : <0xd2>
    <b9f>   DW_AT_data_member_location: 20
 <2><ba0>: Abbrev Number: 18 (DW_TAG_member)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xf1ac3): IC2Selection
    <ba5>   DW_AT_decl_file   : 13
    <ba6>   DW_AT_decl_line   : 186
    <ba7>   DW_AT_decl_column : 12
    <ba8>   DW_AT_type        : <0xd2>
    <bac>   DW_AT_data_member_location: 24
 <2><bad>: Abbrev Number: 18 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0x74fb4): IC2Prescaler
    <bb2>   DW_AT_decl_file   : 13
    <bb3>   DW_AT_decl_line   : 189
    <bb4>   DW_AT_decl_column : 12
    <bb5>   DW_AT_type        : <0xd2>
    <bb9>   DW_AT_data_member_location: 28
 <2><bba>: Abbrev Number: 18 (DW_TAG_member)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x7e41b): IC2Filter
    <bbf>   DW_AT_decl_file   : 13
    <bc0>   DW_AT_decl_line   : 192
    <bc1>   DW_AT_decl_column : 12
    <bc2>   DW_AT_type        : <0xd2>
    <bc6>   DW_AT_data_member_location: 32
 <2><bc7>: Abbrev Number: 0
 <1><bc8>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x35814): TIM_Encoder_InitTypeDef
    <bcd>   DW_AT_decl_file   : 13
    <bce>   DW_AT_decl_line   : 194
    <bcf>   DW_AT_decl_column : 3
    <bd0>   DW_AT_type        : <0xb49>
 <1><bd4>: Abbrev Number: 17 (DW_TAG_structure_type)
    <bd5>   DW_AT_byte_size   : 16
    <bd6>   DW_AT_decl_file   : 13
    <bd7>   DW_AT_decl_line   : 199
    <bd8>   DW_AT_decl_column : 9
    <bd9>   DW_AT_sibling     : <0xc12>
 <2><bdd>: Abbrev Number: 18 (DW_TAG_member)
    <bde>   DW_AT_name        : (indirect string, offset: 0x1047fa): ClockSource
    <be2>   DW_AT_decl_file   : 13
    <be3>   DW_AT_decl_line   : 201
    <be4>   DW_AT_decl_column : 12
    <be5>   DW_AT_type        : <0xd2>
    <be9>   DW_AT_data_member_location: 0
 <2><bea>: Abbrev Number: 18 (DW_TAG_member)
    <beb>   DW_AT_name        : (indirect string, offset: 0x8295c): ClockPolarity
    <bef>   DW_AT_decl_file   : 13
    <bf0>   DW_AT_decl_line   : 203
    <bf1>   DW_AT_decl_column : 12
    <bf2>   DW_AT_type        : <0xd2>
    <bf6>   DW_AT_data_member_location: 4
 <2><bf7>: Abbrev Number: 18 (DW_TAG_member)
    <bf8>   DW_AT_name        : (indirect string, offset: 0xddbb9): ClockPrescaler
    <bfc>   DW_AT_decl_file   : 13
    <bfd>   DW_AT_decl_line   : 205
    <bfe>   DW_AT_decl_column : 12
    <bff>   DW_AT_type        : <0xd2>
    <c03>   DW_AT_data_member_location: 8
 <2><c04>: Abbrev Number: 18 (DW_TAG_member)
    <c05>   DW_AT_name        : (indirect string, offset: 0x966d7): ClockFilter
    <c09>   DW_AT_decl_file   : 13
    <c0a>   DW_AT_decl_line   : 207
    <c0b>   DW_AT_decl_column : 12
    <c0c>   DW_AT_type        : <0xd2>
    <c10>   DW_AT_data_member_location: 12
 <2><c11>: Abbrev Number: 0
 <1><c12>: Abbrev Number: 3 (DW_TAG_typedef)
    <c13>   DW_AT_name        : (indirect string, offset: 0x6c8c): TIM_ClockConfigTypeDef
    <c17>   DW_AT_decl_file   : 13
    <c18>   DW_AT_decl_line   : 209
    <c19>   DW_AT_decl_column : 3
    <c1a>   DW_AT_type        : <0xbd4>
 <1><c1e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c1f>   DW_AT_byte_size   : 8
    <c20>   DW_AT_decl_file   : 13
    <c21>   DW_AT_decl_line   : 232
    <c22>   DW_AT_decl_column : 9
    <c23>   DW_AT_sibling     : <0xc42>
 <2><c27>: Abbrev Number: 18 (DW_TAG_member)
    <c28>   DW_AT_name        : (indirect string, offset: 0x8ab26): MasterOutputTrigger
    <c2c>   DW_AT_decl_file   : 13
    <c2d>   DW_AT_decl_line   : 234
    <c2e>   DW_AT_decl_column : 13
    <c2f>   DW_AT_type        : <0xd2>
    <c33>   DW_AT_data_member_location: 0
 <2><c34>: Abbrev Number: 18 (DW_TAG_member)
    <c35>   DW_AT_name        : (indirect string, offset: 0x7ce5d): MasterSlaveMode
    <c39>   DW_AT_decl_file   : 13
    <c3a>   DW_AT_decl_line   : 236
    <c3b>   DW_AT_decl_column : 13
    <c3c>   DW_AT_type        : <0xd2>
    <c40>   DW_AT_data_member_location: 4
 <2><c41>: Abbrev Number: 0
 <1><c42>: Abbrev Number: 3 (DW_TAG_typedef)
    <c43>   DW_AT_name        : (indirect string, offset: 0xaf800): TIM_MasterConfigTypeDef
    <c47>   DW_AT_decl_file   : 13
    <c48>   DW_AT_decl_line   : 243
    <c49>   DW_AT_decl_column : 3
    <c4a>   DW_AT_type        : <0xc1e>
 <1><c4e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c4f>   DW_AT_byte_size   : 32
    <c50>   DW_AT_decl_file   : 13
    <c51>   DW_AT_decl_line   : 268
    <c53>   DW_AT_decl_column : 9
    <c54>   DW_AT_sibling     : <0xcc9>
 <2><c58>: Abbrev Number: 13 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0xda90): OffStateRunMode
    <c5d>   DW_AT_decl_file   : 13
    <c5e>   DW_AT_decl_line   : 270
    <c60>   DW_AT_decl_column : 12
    <c61>   DW_AT_type        : <0xd2>
    <c65>   DW_AT_data_member_location: 0
 <2><c66>: Abbrev Number: 13 (DW_TAG_member)
    <c67>   DW_AT_name        : (indirect string, offset: 0xb5aa6): OffStateIDLEMode
    <c6b>   DW_AT_decl_file   : 13
    <c6c>   DW_AT_decl_line   : 272
    <c6e>   DW_AT_decl_column : 12
    <c6f>   DW_AT_type        : <0xd2>
    <c73>   DW_AT_data_member_location: 4
 <2><c74>: Abbrev Number: 13 (DW_TAG_member)
    <c75>   DW_AT_name        : (indirect string, offset: 0x78b5c): LockLevel
    <c79>   DW_AT_decl_file   : 13
    <c7a>   DW_AT_decl_line   : 274
    <c7c>   DW_AT_decl_column : 12
    <c7d>   DW_AT_type        : <0xd2>
    <c81>   DW_AT_data_member_location: 8
 <2><c82>: Abbrev Number: 13 (DW_TAG_member)
    <c83>   DW_AT_name        : (indirect string, offset: 0x105758): DeadTime
    <c87>   DW_AT_decl_file   : 13
    <c88>   DW_AT_decl_line   : 276
    <c8a>   DW_AT_decl_column : 12
    <c8b>   DW_AT_type        : <0xd2>
    <c8f>   DW_AT_data_member_location: 12
 <2><c90>: Abbrev Number: 13 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0x8320d): BreakState
    <c95>   DW_AT_decl_file   : 13
    <c96>   DW_AT_decl_line   : 278
    <c98>   DW_AT_decl_column : 12
    <c99>   DW_AT_type        : <0xd2>
    <c9d>   DW_AT_data_member_location: 16
 <2><c9e>: Abbrev Number: 13 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xcf914): BreakPolarity
    <ca3>   DW_AT_decl_file   : 13
    <ca4>   DW_AT_decl_line   : 280
    <ca6>   DW_AT_decl_column : 12
    <ca7>   DW_AT_type        : <0xd2>
    <cab>   DW_AT_data_member_location: 20
 <2><cac>: Abbrev Number: 13 (DW_TAG_member)
    <cad>   DW_AT_name        : (indirect string, offset: 0xb0e93): BreakFilter
    <cb1>   DW_AT_decl_file   : 13
    <cb2>   DW_AT_decl_line   : 282
    <cb4>   DW_AT_decl_column : 12
    <cb5>   DW_AT_type        : <0xd2>
    <cb9>   DW_AT_data_member_location: 24
 <2><cba>: Abbrev Number: 13 (DW_TAG_member)
    <cbb>   DW_AT_name        : (indirect string, offset: 0xe3155): AutomaticOutput
    <cbf>   DW_AT_decl_file   : 13
    <cc0>   DW_AT_decl_line   : 284
    <cc2>   DW_AT_decl_column : 12
    <cc3>   DW_AT_type        : <0xd2>
    <cc7>   DW_AT_data_member_location: 28
 <2><cc8>: Abbrev Number: 0
 <1><cc9>: Abbrev Number: 14 (DW_TAG_typedef)
    <cca>   DW_AT_name        : (indirect string, offset: 0x35260): TIM_BreakDeadTimeConfigTypeDef
    <cce>   DW_AT_decl_file   : 13
    <ccf>   DW_AT_decl_line   : 286
    <cd1>   DW_AT_decl_column : 3
    <cd2>   DW_AT_type        : <0xc4e>
 <1><cd6>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <cd7>   DW_AT_encoding    : 7	(unsigned)
    <cd8>   DW_AT_byte_size   : 1
    <cd9>   DW_AT_type        : <0x3c>
    <cdd>   DW_AT_decl_file   : 13
    <cde>   DW_AT_decl_line   : 292
    <ce0>   DW_AT_decl_column : 1
    <ce1>   DW_AT_sibling     : <0xd04>
 <2><ce5>: Abbrev Number: 16 (DW_TAG_enumerator)
    <ce6>   DW_AT_name        : (indirect string, offset: 0xdb020): HAL_TIM_STATE_RESET
    <cea>   DW_AT_const_value : 0
 <2><ceb>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cec>   DW_AT_name        : (indirect string, offset: 0x78bc): HAL_TIM_STATE_READY
    <cf0>   DW_AT_const_value : 1
 <2><cf1>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x3a0c0): HAL_TIM_STATE_BUSY
    <cf6>   DW_AT_const_value : 2
 <2><cf7>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xd04e0): HAL_TIM_STATE_TIMEOUT
    <cfc>   DW_AT_const_value : 3
 <2><cfd>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x907e9): HAL_TIM_STATE_ERROR
    <d02>   DW_AT_const_value : 4
 <2><d03>: Abbrev Number: 0
 <1><d04>: Abbrev Number: 14 (DW_TAG_typedef)
    <d05>   DW_AT_name        : (indirect string, offset: 0x9dafe): HAL_TIM_StateTypeDef
    <d09>   DW_AT_decl_file   : 13
    <d0a>   DW_AT_decl_line   : 298
    <d0c>   DW_AT_decl_column : 3
    <d0d>   DW_AT_type        : <0xcd6>
 <1><d11>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d12>   DW_AT_type        : <0xd04>
 <1><d16>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <d17>   DW_AT_encoding    : 7	(unsigned)
    <d18>   DW_AT_byte_size   : 1
    <d19>   DW_AT_type        : <0x3c>
    <d1d>   DW_AT_decl_file   : 13
    <d1e>   DW_AT_decl_line   : 304
    <d20>   DW_AT_decl_column : 1
    <d21>   DW_AT_sibling     : <0xd38>
 <2><d25>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d26>   DW_AT_name        : (indirect string, offset: 0xbd63): HAL_TIM_CHANNEL_STATE_RESET
    <d2a>   DW_AT_const_value : 0
 <2><d2b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x8a43a): HAL_TIM_CHANNEL_STATE_READY
    <d30>   DW_AT_const_value : 1
 <2><d31>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d32>   DW_AT_name        : (indirect string, offset: 0x73666): HAL_TIM_CHANNEL_STATE_BUSY
    <d36>   DW_AT_const_value : 2
 <2><d37>: Abbrev Number: 0
 <1><d38>: Abbrev Number: 14 (DW_TAG_typedef)
    <d39>   DW_AT_name        : (indirect string, offset: 0x31361): HAL_TIM_ChannelStateTypeDef
    <d3d>   DW_AT_decl_file   : 13
    <d3e>   DW_AT_decl_line   : 308
    <d40>   DW_AT_decl_column : 3
    <d41>   DW_AT_type        : <0xd16>
 <1><d45>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d46>   DW_AT_type        : <0xd38>
 <1><d4a>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <d4b>   DW_AT_encoding    : 7	(unsigned)
    <d4c>   DW_AT_byte_size   : 1
    <d4d>   DW_AT_type        : <0x3c>
    <d51>   DW_AT_decl_file   : 13
    <d52>   DW_AT_decl_line   : 314
    <d54>   DW_AT_decl_column : 1
    <d55>   DW_AT_sibling     : <0xd6c>
 <2><d59>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x452a): HAL_DMA_BURST_STATE_RESET
    <d5e>   DW_AT_const_value : 0
 <2><d5f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d60>   DW_AT_name        : (indirect string, offset: 0x825a5): HAL_DMA_BURST_STATE_READY
    <d64>   DW_AT_const_value : 1
 <2><d65>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d66>   DW_AT_name        : (indirect string, offset: 0x4c05d): HAL_DMA_BURST_STATE_BUSY
    <d6a>   DW_AT_const_value : 2
 <2><d6b>: Abbrev Number: 0
 <1><d6c>: Abbrev Number: 14 (DW_TAG_typedef)
    <d6d>   DW_AT_name        : (indirect string, offset: 0xe951f): HAL_TIM_DMABurstStateTypeDef
    <d71>   DW_AT_decl_file   : 13
    <d72>   DW_AT_decl_line   : 318
    <d74>   DW_AT_decl_column : 3
    <d75>   DW_AT_type        : <0xd4a>
 <1><d79>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d7a>   DW_AT_type        : <0xd6c>
 <1><d7e>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <d7f>   DW_AT_encoding    : 7	(unsigned)
    <d80>   DW_AT_byte_size   : 1
    <d81>   DW_AT_type        : <0x3c>
    <d85>   DW_AT_decl_file   : 13
    <d86>   DW_AT_decl_line   : 324
    <d88>   DW_AT_decl_column : 1
    <d89>   DW_AT_sibling     : <0xdac>
 <2><d8d>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x84949): HAL_TIM_ACTIVE_CHANNEL_1
    <d92>   DW_AT_const_value : 1
 <2><d93>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0x84962): HAL_TIM_ACTIVE_CHANNEL_2
    <d98>   DW_AT_const_value : 2
 <2><d99>: Abbrev Number: 16 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x8497b): HAL_TIM_ACTIVE_CHANNEL_3
    <d9e>   DW_AT_const_value : 4
 <2><d9f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x84994): HAL_TIM_ACTIVE_CHANNEL_4
    <da4>   DW_AT_const_value : 8
 <2><da5>: Abbrev Number: 16 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x64a13): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <daa>   DW_AT_const_value : 0
 <2><dab>: Abbrev Number: 0
 <1><dac>: Abbrev Number: 14 (DW_TAG_typedef)
    <dad>   DW_AT_name        : (indirect string, offset: 0x7b9d0): HAL_TIM_ActiveChannel
    <db1>   DW_AT_decl_file   : 13
    <db2>   DW_AT_decl_line   : 330
    <db4>   DW_AT_decl_column : 3
    <db5>   DW_AT_type        : <0xd7e>
 <1><db9>: Abbrev Number: 27 (DW_TAG_structure_type)
    <dba>   DW_AT_name        : (indirect string, offset: 0x4c868): __TIM_HandleTypeDef
    <dbe>   DW_AT_byte_size   : 180
    <dbf>   DW_AT_decl_file   : 13
    <dc0>   DW_AT_decl_line   : 336
    <dc2>   DW_AT_decl_column : 16
    <dc3>   DW_AT_sibling     : <0xfc0>
 <2><dc7>: Abbrev Number: 13 (DW_TAG_member)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xf403f): Instance
    <dcc>   DW_AT_decl_file   : 13
    <dcd>   DW_AT_decl_line   : 341
    <dcf>   DW_AT_decl_column : 39
    <dd0>   DW_AT_type        : <0xfc0>
    <dd4>   DW_AT_data_member_location: 0
 <2><dd5>: Abbrev Number: 13 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x10440f): Init
    <dda>   DW_AT_decl_file   : 13
    <ddb>   DW_AT_decl_line   : 342
    <ddd>   DW_AT_decl_column : 38
    <dde>   DW_AT_type        : <0xa82>
    <de2>   DW_AT_data_member_location: 4
 <2><de3>: Abbrev Number: 13 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x7b9de): Channel
    <de8>   DW_AT_decl_file   : 13
    <de9>   DW_AT_decl_line   : 343
    <deb>   DW_AT_decl_column : 38
    <dec>   DW_AT_type        : <0xdac>
    <df0>   DW_AT_data_member_location: 28
 <2><df1>: Abbrev Number: 13 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x8ccc9): hdma
    <df6>   DW_AT_decl_file   : 13
    <df7>   DW_AT_decl_line   : 344
    <df9>   DW_AT_decl_column : 39
    <dfa>   DW_AT_type        : <0xfc6>
    <dfe>   DW_AT_data_member_location: 32
 <2><dff>: Abbrev Number: 13 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0xad47c): Lock
    <e04>   DW_AT_decl_file   : 13
    <e05>   DW_AT_decl_line   : 346
    <e07>   DW_AT_decl_column : 38
    <e08>   DW_AT_type        : <0x687>
    <e0c>   DW_AT_data_member_location: 60
 <2><e0d>: Abbrev Number: 13 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0xa5c0b): State
    <e12>   DW_AT_decl_file   : 13
    <e13>   DW_AT_decl_line   : 347
    <e15>   DW_AT_decl_column : 38
    <e16>   DW_AT_type        : <0xd11>
    <e1a>   DW_AT_data_member_location: 61
 <2><e1b>: Abbrev Number: 13 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x1053b6): ChannelState
    <e20>   DW_AT_decl_file   : 13
    <e21>   DW_AT_decl_line   : 348
    <e23>   DW_AT_decl_column : 38
    <e24>   DW_AT_type        : <0xfec>
    <e28>   DW_AT_data_member_location: 62
 <2><e29>: Abbrev Number: 13 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x10591a): ChannelNState
    <e2e>   DW_AT_decl_file   : 13
    <e2f>   DW_AT_decl_line   : 349
    <e31>   DW_AT_decl_column : 38
    <e32>   DW_AT_type        : <0xfec>
    <e36>   DW_AT_data_member_location: 66
 <2><e37>: Abbrev Number: 13 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x104e95): DMABurstState
    <e3c>   DW_AT_decl_file   : 13
    <e3d>   DW_AT_decl_line   : 350
    <e3f>   DW_AT_decl_column : 38
    <e40>   DW_AT_type        : <0xd79>
    <e44>   DW_AT_data_member_location: 70
 <2><e45>: Abbrev Number: 13 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0xf35c1): Base_MspInitCallback
    <e4a>   DW_AT_decl_file   : 13
    <e4b>   DW_AT_decl_line   : 353
    <e4d>   DW_AT_decl_column : 11
    <e4e>   DW_AT_type        : <0x1002>
    <e52>   DW_AT_data_member_location: 72
 <2><e53>: Abbrev Number: 13 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0x85293): Base_MspDeInitCallback
    <e58>   DW_AT_decl_file   : 13
    <e59>   DW_AT_decl_line   : 354
    <e5b>   DW_AT_decl_column : 11
    <e5c>   DW_AT_type        : <0x1002>
    <e60>   DW_AT_data_member_location: 76
 <2><e61>: Abbrev Number: 13 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x7ed27): IC_MspInitCallback
    <e66>   DW_AT_decl_file   : 13
    <e67>   DW_AT_decl_line   : 355
    <e69>   DW_AT_decl_column : 11
    <e6a>   DW_AT_type        : <0x1002>
    <e6e>   DW_AT_data_member_location: 80
 <2><e6f>: Abbrev Number: 13 (DW_TAG_member)
    <e70>   DW_AT_name        : (indirect string, offset: 0xbb202): IC_MspDeInitCallback
    <e74>   DW_AT_decl_file   : 13
    <e75>   DW_AT_decl_line   : 356
    <e77>   DW_AT_decl_column : 11
    <e78>   DW_AT_type        : <0x1002>
    <e7c>   DW_AT_data_member_location: 84
 <2><e7d>: Abbrev Number: 13 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x6fbb1): OC_MspInitCallback
    <e82>   DW_AT_decl_file   : 13
    <e83>   DW_AT_decl_line   : 357
    <e85>   DW_AT_decl_column : 11
    <e86>   DW_AT_type        : <0x1002>
    <e8a>   DW_AT_data_member_location: 88
 <2><e8b>: Abbrev Number: 13 (DW_TAG_member)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x84fc5): OC_MspDeInitCallback
    <e90>   DW_AT_decl_file   : 13
    <e91>   DW_AT_decl_line   : 358
    <e93>   DW_AT_decl_column : 11
    <e94>   DW_AT_type        : <0x1002>
    <e98>   DW_AT_data_member_location: 92
 <2><e99>: Abbrev Number: 13 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x3d34): PWM_MspInitCallback
    <e9e>   DW_AT_decl_file   : 13
    <e9f>   DW_AT_decl_line   : 359
    <ea1>   DW_AT_decl_column : 11
    <ea2>   DW_AT_type        : <0x1002>
    <ea6>   DW_AT_data_member_location: 96
 <2><ea7>: Abbrev Number: 13 (DW_TAG_member)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xb0a59): PWM_MspDeInitCallback
    <eac>   DW_AT_decl_file   : 13
    <ead>   DW_AT_decl_line   : 360
    <eaf>   DW_AT_decl_column : 11
    <eb0>   DW_AT_type        : <0x1002>
    <eb4>   DW_AT_data_member_location: 100
 <2><eb5>: Abbrev Number: 13 (DW_TAG_member)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x9d08a): OnePulse_MspInitCallback
    <eba>   DW_AT_decl_file   : 13
    <ebb>   DW_AT_decl_line   : 361
    <ebd>   DW_AT_decl_column : 11
    <ebe>   DW_AT_type        : <0x1002>
    <ec2>   DW_AT_data_member_location: 104
 <2><ec3>: Abbrev Number: 13 (DW_TAG_member)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x8ecbc): OnePulse_MspDeInitCallback
    <ec8>   DW_AT_decl_file   : 13
    <ec9>   DW_AT_decl_line   : 362
    <ecb>   DW_AT_decl_column : 11
    <ecc>   DW_AT_type        : <0x1002>
    <ed0>   DW_AT_data_member_location: 108
 <2><ed1>: Abbrev Number: 13 (DW_TAG_member)
    <ed2>   DW_AT_name        : (indirect string, offset: 0xff49c): Encoder_MspInitCallback
    <ed6>   DW_AT_decl_file   : 13
    <ed7>   DW_AT_decl_line   : 363
    <ed9>   DW_AT_decl_column : 11
    <eda>   DW_AT_type        : <0x1002>
    <ede>   DW_AT_data_member_location: 112
 <2><edf>: Abbrev Number: 13 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x86e5): Encoder_MspDeInitCallback
    <ee4>   DW_AT_decl_file   : 13
    <ee5>   DW_AT_decl_line   : 364
    <ee7>   DW_AT_decl_column : 11
    <ee8>   DW_AT_type        : <0x1002>
    <eec>   DW_AT_data_member_location: 116
 <2><eed>: Abbrev Number: 13 (DW_TAG_member)
    <eee>   DW_AT_name        : (indirect string, offset: 0xace30): HallSensor_MspInitCallback
    <ef2>   DW_AT_decl_file   : 13
    <ef3>   DW_AT_decl_line   : 365
    <ef5>   DW_AT_decl_column : 11
    <ef6>   DW_AT_type        : <0x1002>
    <efa>   DW_AT_data_member_location: 120
 <2><efb>: Abbrev Number: 13 (DW_TAG_member)
    <efc>   DW_AT_name        : (indirect string, offset: 0xa6d01): HallSensor_MspDeInitCallback
    <f00>   DW_AT_decl_file   : 13
    <f01>   DW_AT_decl_line   : 366
    <f03>   DW_AT_decl_column : 11
    <f04>   DW_AT_type        : <0x1002>
    <f08>   DW_AT_data_member_location: 124
 <2><f09>: Abbrev Number: 13 (DW_TAG_member)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x102779): PeriodElapsedCallback
    <f0e>   DW_AT_decl_file   : 13
    <f0f>   DW_AT_decl_line   : 367
    <f11>   DW_AT_decl_column : 11
    <f12>   DW_AT_type        : <0x1002>
    <f16>   DW_AT_data_member_location: 128
 <2><f17>: Abbrev Number: 13 (DW_TAG_member)
    <f18>   DW_AT_name        : (indirect string, offset: 0x1048ed): PeriodElapsedHalfCpltCallback
    <f1c>   DW_AT_decl_file   : 13
    <f1d>   DW_AT_decl_line   : 368
    <f1f>   DW_AT_decl_column : 11
    <f20>   DW_AT_type        : <0x1002>
    <f24>   DW_AT_data_member_location: 132
 <2><f25>: Abbrev Number: 13 (DW_TAG_member)
    <f26>   DW_AT_name        : (indirect string, offset: 0x10517a): TriggerCallback
    <f2a>   DW_AT_decl_file   : 13
    <f2b>   DW_AT_decl_line   : 369
    <f2d>   DW_AT_decl_column : 11
    <f2e>   DW_AT_type        : <0x1002>
    <f32>   DW_AT_data_member_location: 136
 <2><f33>: Abbrev Number: 13 (DW_TAG_member)
    <f34>   DW_AT_name        : (indirect string, offset: 0x104fd7): TriggerHalfCpltCallback
    <f38>   DW_AT_decl_file   : 13
    <f39>   DW_AT_decl_line   : 370
    <f3b>   DW_AT_decl_column : 11
    <f3c>   DW_AT_type        : <0x1002>
    <f40>   DW_AT_data_member_location: 140
 <2><f41>: Abbrev Number: 13 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0x104625): IC_CaptureCallback
    <f46>   DW_AT_decl_file   : 13
    <f47>   DW_AT_decl_line   : 371
    <f49>   DW_AT_decl_column : 11
    <f4a>   DW_AT_type        : <0x1002>
    <f4e>   DW_AT_data_member_location: 144
 <2><f4f>: Abbrev Number: 13 (DW_TAG_member)
    <f50>   DW_AT_name        : (indirect string, offset: 0x1046fc): IC_CaptureHalfCpltCallback
    <f54>   DW_AT_decl_file   : 13
    <f55>   DW_AT_decl_line   : 372
    <f57>   DW_AT_decl_column : 11
    <f58>   DW_AT_type        : <0x1002>
    <f5c>   DW_AT_data_member_location: 148
 <2><f5d>: Abbrev Number: 13 (DW_TAG_member)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x104f8c): OC_DelayElapsedCallback
    <f62>   DW_AT_decl_file   : 13
    <f63>   DW_AT_decl_line   : 373
    <f65>   DW_AT_decl_column : 11
    <f66>   DW_AT_type        : <0x1002>
    <f6a>   DW_AT_data_member_location: 152
 <2><f6b>: Abbrev Number: 13 (DW_TAG_member)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x1051f1): PWM_PulseFinishedCallback
    <f70>   DW_AT_decl_file   : 13
    <f71>   DW_AT_decl_line   : 374
    <f73>   DW_AT_decl_column : 11
    <f74>   DW_AT_type        : <0x1002>
    <f78>   DW_AT_data_member_location: 156
 <2><f79>: Abbrev Number: 13 (DW_TAG_member)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x104927): PWM_PulseFinishedHalfCpltCallback
    <f7e>   DW_AT_decl_file   : 13
    <f7f>   DW_AT_decl_line   : 375
    <f81>   DW_AT_decl_column : 11
    <f82>   DW_AT_type        : <0x1002>
    <f86>   DW_AT_data_member_location: 160
 <2><f87>: Abbrev Number: 13 (DW_TAG_member)
    <f88>   DW_AT_name        : (indirect string, offset: 0x1026c7): ErrorCallback
    <f8c>   DW_AT_decl_file   : 13
    <f8d>   DW_AT_decl_line   : 376
    <f8f>   DW_AT_decl_column : 11
    <f90>   DW_AT_type        : <0x1002>
    <f94>   DW_AT_data_member_location: 164
 <2><f95>: Abbrev Number: 13 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0xeab9a): CommutationCallback
    <f9a>   DW_AT_decl_file   : 13
    <f9b>   DW_AT_decl_line   : 377
    <f9d>   DW_AT_decl_column : 11
    <f9e>   DW_AT_type        : <0x1002>
    <fa2>   DW_AT_data_member_location: 168
 <2><fa3>: Abbrev Number: 13 (DW_TAG_member)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x719f): CommutationHalfCpltCallback
    <fa8>   DW_AT_decl_file   : 13
    <fa9>   DW_AT_decl_line   : 378
    <fab>   DW_AT_decl_column : 11
    <fac>   DW_AT_type        : <0x1002>
    <fb0>   DW_AT_data_member_location: 172
 <2><fb1>: Abbrev Number: 13 (DW_TAG_member)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x1059a9): BreakCallback
    <fb6>   DW_AT_decl_file   : 13
    <fb7>   DW_AT_decl_line   : 379
    <fb9>   DW_AT_decl_column : 11
    <fba>   DW_AT_type        : <0x1002>
    <fbe>   DW_AT_data_member_location: 176
 <2><fbf>: Abbrev Number: 0
 <1><fc0>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <fc1>   DW_AT_byte_size   : 4
    <fc2>   DW_AT_type        : <0x5b9>
 <1><fc6>: Abbrev Number: 7 (DW_TAG_array_type)
    <fc7>   DW_AT_type        : <0xfd6>
    <fcb>   DW_AT_sibling     : <0xfd6>
 <2><fcf>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <fd0>   DW_AT_type        : <0x98>
    <fd4>   DW_AT_upper_bound : 6
 <2><fd5>: Abbrev Number: 0
 <1><fd6>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <fd7>   DW_AT_byte_size   : 4
    <fd8>   DW_AT_type        : <0xa1e>
 <1><fdc>: Abbrev Number: 7 (DW_TAG_array_type)
    <fdd>   DW_AT_type        : <0xd45>
    <fe1>   DW_AT_sibling     : <0xfec>
 <2><fe5>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <fe6>   DW_AT_type        : <0x98>
    <fea>   DW_AT_upper_bound : 3
 <2><feb>: Abbrev Number: 0
 <1><fec>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <fed>   DW_AT_type        : <0xfdc>
 <1><ff1>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <ff2>   DW_AT_prototyped  : 1
    <ff2>   DW_AT_sibling     : <0xffc>
 <2><ff6>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ff7>   DW_AT_type        : <0xffc>
 <2><ffb>: Abbrev Number: 0
 <1><ffc>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <ffd>   DW_AT_byte_size   : 4
    <ffe>   DW_AT_type        : <0xdb9>
 <1><1002>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1003>   DW_AT_byte_size   : 4
    <1004>   DW_AT_type        : <0xff1>
 <1><1008>: Abbrev Number: 14 (DW_TAG_typedef)
    <1009>   DW_AT_name        : (indirect string, offset: 0x4c86a): TIM_HandleTypeDef
    <100d>   DW_AT_decl_file   : 13
    <100e>   DW_AT_decl_line   : 381
    <1010>   DW_AT_decl_column : 3
    <1011>   DW_AT_type        : <0xdb9>
 <1><1015>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1016>   DW_AT_byte_size   : 4
    <1017>   DW_AT_type        : <0x1008>
 <1><101b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <101c>   DW_AT_byte_size   : 28
    <101d>   DW_AT_decl_file   : 14
    <101e>   DW_AT_decl_line   : 47
    <101f>   DW_AT_decl_column : 9
    <1020>   DW_AT_sibling     : <0x1080>
 <2><1024>: Abbrev Number: 18 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0xe8fb2): BaudRate
    <1029>   DW_AT_decl_file   : 14
    <102a>   DW_AT_decl_line   : 49
    <102b>   DW_AT_decl_column : 12
    <102c>   DW_AT_type        : <0xd2>
    <1030>   DW_AT_data_member_location: 0
 <2><1031>: Abbrev Number: 18 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0x619a): WordLength
    <1036>   DW_AT_decl_file   : 14
    <1037>   DW_AT_decl_line   : 55
    <1038>   DW_AT_decl_column : 12
    <1039>   DW_AT_type        : <0xd2>
    <103d>   DW_AT_data_member_location: 4
 <2><103e>: Abbrev Number: 18 (DW_TAG_member)
    <103f>   DW_AT_name        : (indirect string, offset: 0xe93a9): StopBits
    <1043>   DW_AT_decl_file   : 14
    <1044>   DW_AT_decl_line   : 58
    <1045>   DW_AT_decl_column : 12
    <1046>   DW_AT_type        : <0xd2>
    <104a>   DW_AT_data_member_location: 8
 <2><104b>: Abbrev Number: 18 (DW_TAG_member)
    <104c>   DW_AT_name        : (indirect string, offset: 0x4139c): Parity
    <1050>   DW_AT_decl_file   : 14
    <1051>   DW_AT_decl_line   : 61
    <1052>   DW_AT_decl_column : 12
    <1053>   DW_AT_type        : <0xd2>
    <1057>   DW_AT_data_member_location: 12
 <2><1058>: Abbrev Number: 18 (DW_TAG_member)
    <1059>   DW_AT_name        : (indirect string, offset: 0x698b5): Mode
    <105d>   DW_AT_decl_file   : 14
    <105e>   DW_AT_decl_line   : 68
    <105f>   DW_AT_decl_column : 12
    <1060>   DW_AT_type        : <0xd2>
    <1064>   DW_AT_data_member_location: 16
 <2><1065>: Abbrev Number: 18 (DW_TAG_member)
    <1066>   DW_AT_name        : (indirect string, offset: 0x1dc2b): HwFlowCtl
    <106a>   DW_AT_decl_file   : 14
    <106b>   DW_AT_decl_line   : 71
    <106c>   DW_AT_decl_column : 12
    <106d>   DW_AT_type        : <0xd2>
    <1071>   DW_AT_data_member_location: 20
 <2><1072>: Abbrev Number: 18 (DW_TAG_member)
    <1073>   DW_AT_name        : (indirect string, offset: 0xd0e38): OverSampling
    <1077>   DW_AT_decl_file   : 14
    <1078>   DW_AT_decl_line   : 74
    <1079>   DW_AT_decl_column : 12
    <107a>   DW_AT_type        : <0xd2>
    <107e>   DW_AT_data_member_location: 24
 <2><107f>: Abbrev Number: 0
 <1><1080>: Abbrev Number: 3 (DW_TAG_typedef)
    <1081>   DW_AT_name        : (indirect string, offset: 0x40270): UART_InitTypeDef
    <1085>   DW_AT_decl_file   : 14
    <1086>   DW_AT_decl_line   : 76
    <1087>   DW_AT_decl_column : 3
    <1088>   DW_AT_type        : <0x101b>
 <1><108c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <108d>   DW_AT_encoding    : 7	(unsigned)
    <108e>   DW_AT_byte_size   : 1
    <108f>   DW_AT_type        : <0x3c>
    <1093>   DW_AT_decl_file   : 14
    <1094>   DW_AT_decl_line   : 118
    <1095>   DW_AT_decl_column : 1
    <1096>   DW_AT_sibling     : <0x10cb>
 <2><109a>: Abbrev Number: 16 (DW_TAG_enumerator)
    <109b>   DW_AT_name        : (indirect string, offset: 0x3c196): HAL_UART_STATE_RESET
    <109f>   DW_AT_const_value : 0
 <2><10a0>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x1d1c7): HAL_UART_STATE_READY
    <10a5>   DW_AT_const_value : 32
 <2><10a6>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10a7>   DW_AT_name        : (indirect string, offset: 0xe300f): HAL_UART_STATE_BUSY
    <10ab>   DW_AT_const_value : 36
 <2><10ac>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10ad>   DW_AT_name        : (indirect string, offset: 0x298d): HAL_UART_STATE_BUSY_TX
    <10b1>   DW_AT_const_value : 33
 <2><10b2>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10b3>   DW_AT_name        : (indirect string, offset: 0x1c91): HAL_UART_STATE_BUSY_RX
    <10b7>   DW_AT_const_value : 34
 <2><10b8>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x343d8): HAL_UART_STATE_BUSY_TX_RX
    <10bd>   DW_AT_const_value : 35
 <2><10be>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10bf>   DW_AT_name        : (indirect string, offset: 0x742a2): HAL_UART_STATE_TIMEOUT
    <10c3>   DW_AT_const_value : 160
 <2><10c4>: Abbrev Number: 16 (DW_TAG_enumerator)
    <10c5>   DW_AT_name        : (indirect string, offset: 0xa9610): HAL_UART_STATE_ERROR
    <10c9>   DW_AT_const_value : 224
 <2><10ca>: Abbrev Number: 0
 <1><10cb>: Abbrev Number: 3 (DW_TAG_typedef)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x455fc): HAL_UART_StateTypeDef
    <10d0>   DW_AT_decl_file   : 14
    <10d1>   DW_AT_decl_line   : 136
    <10d2>   DW_AT_decl_column : 3
    <10d3>   DW_AT_type        : <0x108c>
 <1><10d7>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <10d8>   DW_AT_type        : <0x10cb>
 <1><10dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <10dd>   DW_AT_name        : (indirect string, offset: 0x64215): HAL_UART_RxTypeTypeDef
    <10e1>   DW_AT_decl_file   : 14
    <10e2>   DW_AT_decl_line   : 145
    <10e3>   DW_AT_decl_column : 18
    <10e4>   DW_AT_type        : <0xd2>
 <1><10e8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <10e9>   DW_AT_type        : <0x10dc>
 <1><10ed>: Abbrev Number: 22 (DW_TAG_structure_type)
    <10ee>   DW_AT_name        : (indirect string, offset: 0x884a0): __UART_HandleTypeDef
    <10f2>   DW_AT_byte_size   : 116
    <10f3>   DW_AT_decl_file   : 14
    <10f4>   DW_AT_decl_line   : 150
    <10f5>   DW_AT_decl_column : 16
    <10f6>   DW_AT_sibling     : <0x125a>
 <2><10fa>: Abbrev Number: 18 (DW_TAG_member)
    <10fb>   DW_AT_name        : (indirect string, offset: 0xf403f): Instance
    <10ff>   DW_AT_decl_file   : 14
    <1100>   DW_AT_decl_line   : 152
    <1101>   DW_AT_decl_column : 34
    <1102>   DW_AT_type        : <0x125a>
    <1106>   DW_AT_data_member_location: 0
 <2><1107>: Abbrev Number: 18 (DW_TAG_member)
    <1108>   DW_AT_name        : (indirect string, offset: 0x10440f): Init
    <110c>   DW_AT_decl_file   : 14
    <110d>   DW_AT_decl_line   : 154
    <110e>   DW_AT_decl_column : 33
    <110f>   DW_AT_type        : <0x1080>
    <1113>   DW_AT_data_member_location: 4
